bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/**
  ******************************************************************************
  * @file    rf_reg.h
  * @version V1.2
  * @date    2019-11-20
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __RF_REG_H__
#define __RF_REG_H__

#include "bl602.h"

/* 0x0 : Silicon revision */
#define RF_REV_OFFSET  (0x0)
#define RF_ID          RF_ID
#define RF_ID_POS      (0U)
#define RF_ID_LEN      (8U)
#define RF_ID_MSK      (((1U << RF_ID_LEN) - 1) << RF_ID_POS)
#define RF_ID_UMSK     (~(((1U << RF_ID_LEN) - 1) << RF_ID_POS))
#define RF_FW_REV      RF_FW_REV
#define RF_FW_REV_POS  (8U)
#define RF_FW_REV_LEN  (8U)
#define RF_FW_REV_MSK  (((1U << RF_FW_REV_LEN) - 1) << RF_FW_REV_POS)
#define RF_FW_REV_UMSK (~(((1U << RF_FW_REV_LEN) - 1) << RF_FW_REV_POS))
#define RF_HW_REV      RF_HW_REV
#define RF_HW_REV_POS  (16U)
#define RF_HW_REV_LEN  (8U)
#define RF_HW_REV_MSK  (((1U << RF_HW_REV_LEN) - 1) << RF_HW_REV_POS)
#define RF_HW_REV_UMSK (~(((1U << RF_HW_REV_LEN) - 1) << RF_HW_REV_POS))

/* 0x4 : Digital Control */
#define RF_FSM_CTRL_HW_OFFSET    (0x4)
#define RF_FSM_CTRL_EN           RF_FSM_CTRL_EN
#define RF_FSM_CTRL_EN_POS       (1U)
#define RF_FSM_CTRL_EN_LEN       (1U)
#define RF_FSM_CTRL_EN_MSK       (((1U << RF_FSM_CTRL_EN_LEN) - 1) << RF_FSM_CTRL_EN_POS)
#define RF_FSM_CTRL_EN_UMSK      (~(((1U << RF_FSM_CTRL_EN_LEN) - 1) << RF_FSM_CTRL_EN_POS))
#define RF_FSM_T2R_CAL_MODE      RF_FSM_T2R_CAL_MODE
#define RF_FSM_T2R_CAL_MODE_POS  (2U)
#define RF_FSM_T2R_CAL_MODE_LEN  (2U)
#define RF_FSM_T2R_CAL_MODE_MSK  (((1U << RF_FSM_T2R_CAL_MODE_LEN) - 1) << RF_FSM_T2R_CAL_MODE_POS)
#define RF_FSM_T2R_CAL_MODE_UMSK (~(((1U << RF_FSM_T2R_CAL_MODE_LEN) - 1) << RF_FSM_T2R_CAL_MODE_POS))
#define RF_FSM_STATE             RF_FSM_STATE
#define RF_FSM_STATE_POS         (4U)
#define RF_FSM_STATE_LEN         (3U)
#define RF_FSM_STATE_MSK         (((1U << RF_FSM_STATE_LEN) - 1) << RF_FSM_STATE_POS)
#define RF_FSM_STATE_UMSK        (~(((1U << RF_FSM_STATE_LEN) - 1) << RF_FSM_STATE_POS))
#define RF_RC_STATE_DBG          RF_RC_STATE_DBG
#define RF_RC_STATE_DBG_POS      (8U)
#define RF_RC_STATE_DBG_LEN      (3U)
#define RF_RC_STATE_DBG_MSK      (((1U << RF_RC_STATE_DBG_LEN) - 1) << RF_RC_STATE_DBG_POS)
#define RF_RC_STATE_DBG_UMSK     (~(((1U << RF_RC_STATE_DBG_LEN) - 1) << RF_RC_STATE_DBG_POS))
#define RF_RC_STATE_DBG_EN       RF_RC_STATE_DBG_EN
#define RF_RC_STATE_DBG_EN_POS   (11U)
#define RF_RC_STATE_DBG_EN_LEN   (1U)
#define RF_RC_STATE_DBG_EN_MSK   (((1U << RF_RC_STATE_DBG_EN_LEN) - 1) << RF_RC_STATE_DBG_EN_POS)
#define RF_RC_STATE_DBG_EN_UMSK  (~(((1U << RF_RC_STATE_DBG_EN_LEN) - 1) << RF_RC_STATE_DBG_EN_POS))
#define RF_FSM_ST_INT_SEL        RF_FSM_ST_INT_SEL
#define RF_FSM_ST_INT_SEL_POS    (12U)
#define RF_FSM_ST_INT_SEL_LEN    (3U)
#define RF_FSM_ST_INT_SEL_MSK    (((1U << RF_FSM_ST_INT_SEL_LEN) - 1) << RF_FSM_ST_INT_SEL_POS)
#define RF_FSM_ST_INT_SEL_UMSK   (~(((1U << RF_FSM_ST_INT_SEL_LEN) - 1) << RF_FSM_ST_INT_SEL_POS))
#define RF_FSM_ST_INT            RF_FSM_ST_INT
#define RF_FSM_ST_INT_POS        (16U)
#define RF_FSM_ST_INT_LEN        (1U)
#define RF_FSM_ST_INT_MSK        (((1U << RF_FSM_ST_INT_LEN) - 1) << RF_FSM_ST_INT_POS)
#define RF_FSM_ST_INT_UMSK       (~(((1U << RF_FSM_ST_INT_LEN) - 1) << RF_FSM_ST_INT_POS))
#define RF_FSM_ST_INT_CLR        RF_FSM_ST_INT_CLR
#define RF_FSM_ST_INT_CLR_POS    (20U)
#define RF_FSM_ST_INT_CLR_LEN    (1U)
#define RF_FSM_ST_INT_CLR_MSK    (((1U << RF_FSM_ST_INT_CLR_LEN) - 1) << RF_FSM_ST_INT_CLR_POS)
#define RF_FSM_ST_INT_CLR_UMSK   (~(((1U << RF_FSM_ST_INT_CLR_LEN) - 1) << RF_FSM_ST_INT_CLR_POS))
#define RF_FSM_ST_INT_SET        RF_FSM_ST_INT_SET
#define RF_FSM_ST_INT_SET_POS    (24U)
#define RF_FSM_ST_INT_SET_LEN    (1U)
#define RF_FSM_ST_INT_SET_MSK    (((1U << RF_FSM_ST_INT_SET_LEN) - 1) << RF_FSM_ST_INT_SET_POS)
#define RF_FSM_ST_INT_SET_UMSK   (~(((1U << RF_FSM_ST_INT_SET_LEN) - 1) << RF_FSM_ST_INT_SET_POS))
#define RF_RC_STATE_VALUE        RF_RC_STATE_VALUE
#define RF_RC_STATE_VALUE_POS    (28U)
#define RF_RC_STATE_VALUE_LEN    (3U)
#define RF_RC_STATE_VALUE_MSK    (((1U << RF_RC_STATE_VALUE_LEN) - 1) << RF_RC_STATE_VALUE_POS)
#define RF_RC_STATE_VALUE_UMSK   (~(((1U << RF_RC_STATE_VALUE_LEN) - 1) << RF_RC_STATE_VALUE_POS))

/* 0x8 : rfsm status reg */
#define RF_FSM_CTRL_SW_OFFSET   (0x8)
#define RF_FSM_SW_ST            RF_FSM_SW_ST
#define RF_FSM_SW_ST_POS        (0U)
#define RF_FSM_SW_ST_LEN        (5U)
#define RF_FSM_SW_ST_MSK        (((1U << RF_FSM_SW_ST_LEN) - 1) << RF_FSM_SW_ST_POS)
#define RF_FSM_SW_ST_UMSK       (~(((1U << RF_FSM_SW_ST_LEN) - 1) << RF_FSM_SW_ST_POS))
#define RF_FSM_SW_ST_VLD        RF_FSM_SW_ST_VLD
#define RF_FSM_SW_ST_VLD_POS    (8U)
#define RF_FSM_SW_ST_VLD_LEN    (1U)
#define RF_FSM_SW_ST_VLD_MSK    (((1U << RF_FSM_SW_ST_VLD_LEN) - 1) << RF_FSM_SW_ST_VLD_POS)
#define RF_FSM_SW_ST_VLD_UMSK   (~(((1U << RF_FSM_SW_ST_VLD_LEN) - 1) << RF_FSM_SW_ST_VLD_POS))
#define RF_FULL_CAL_EN          RF_FULL_CAL_EN
#define RF_FULL_CAL_EN_POS      (12U)
#define RF_FULL_CAL_EN_LEN      (1U)
#define RF_FULL_CAL_EN_MSK      (((1U << RF_FULL_CAL_EN_LEN) - 1) << RF_FULL_CAL_EN_POS)
#define RF_FULL_CAL_EN_UMSK     (~(((1U << RF_FULL_CAL_EN_LEN) - 1) << RF_FULL_CAL_EN_POS))
#define RF_INC_CAL_TIMEOUT      RF_INC_CAL_TIMEOUT
#define RF_INC_CAL_TIMEOUT_POS  (16U)
#define RF_INC_CAL_TIMEOUT_LEN  (1U)
#define RF_INC_CAL_TIMEOUT_MSK  (((1U << RF_INC_CAL_TIMEOUT_LEN) - 1) << RF_INC_CAL_TIMEOUT_POS)
#define RF_INC_CAL_TIMEOUT_UMSK (~(((1U << RF_INC_CAL_TIMEOUT_LEN) - 1) << RF_INC_CAL_TIMEOUT_POS))
#define RF_LO_UNLOCKED          RF_LO_UNLOCKED
#define RF_LO_UNLOCKED_POS      (20U)
#define RF_LO_UNLOCKED_LEN      (1U)
#define RF_LO_UNLOCKED_MSK      (((1U << RF_LO_UNLOCKED_LEN) - 1) << RF_LO_UNLOCKED_POS)
#define RF_LO_UNLOCKED_UMSK     (~(((1U << RF_LO_UNLOCKED_LEN) - 1) << RF_LO_UNLOCKED_POS))

