bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0xC : Control logic switch */
#define RFCTRL_HW_EN_OFFSET                (0xC)
#define RF_PU_CTRL_HW                      RF_PU_CTRL_HW
#define RF_PU_CTRL_HW_POS                  (0U)
#define RF_PU_CTRL_HW_LEN                  (1U)
#define RF_PU_CTRL_HW_MSK                  (((1U << RF_PU_CTRL_HW_LEN) - 1) << RF_PU_CTRL_HW_POS)
#define RF_PU_CTRL_HW_UMSK                 (~(((1U << RF_PU_CTRL_HW_LEN) - 1) << RF_PU_CTRL_HW_POS))
#define RF_RX_GAIN_CTRL_HW                 RF_RX_GAIN_CTRL_HW
#define RF_RX_GAIN_CTRL_HW_POS             (1U)
#define RF_RX_GAIN_CTRL_HW_LEN             (1U)
#define RF_RX_GAIN_CTRL_HW_MSK             (((1U << RF_RX_GAIN_CTRL_HW_LEN) - 1) << RF_RX_GAIN_CTRL_HW_POS)
#define RF_RX_GAIN_CTRL_HW_UMSK            (~(((1U << RF_RX_GAIN_CTRL_HW_LEN) - 1) << RF_RX_GAIN_CTRL_HW_POS))
#define RF_TX_GAIN_CTRL_HW                 RF_TX_GAIN_CTRL_HW
#define RF_TX_GAIN_CTRL_HW_POS             (2U)
#define RF_TX_GAIN_CTRL_HW_LEN             (1U)
#define RF_TX_GAIN_CTRL_HW_MSK             (((1U << RF_TX_GAIN_CTRL_HW_LEN) - 1) << RF_TX_GAIN_CTRL_HW_POS)
#define RF_TX_GAIN_CTRL_HW_UMSK            (~(((1U << RF_TX_GAIN_CTRL_HW_LEN) - 1) << RF_TX_GAIN_CTRL_HW_POS))
#define RF_LNA_CTRL_HW                     RF_LNA_CTRL_HW
#define RF_LNA_CTRL_HW_POS                 (3U)
#define RF_LNA_CTRL_HW_LEN                 (1U)
#define RF_LNA_CTRL_HW_MSK                 (((1U << RF_LNA_CTRL_HW_LEN) - 1) << RF_LNA_CTRL_HW_POS)
#define RF_LNA_CTRL_HW_UMSK                (~(((1U << RF_LNA_CTRL_HW_LEN) - 1) << RF_LNA_CTRL_HW_POS))
#define RF_RBB_BW_CTRL_HW                  RF_RBB_BW_CTRL_HW
#define RF_RBB_BW_CTRL_HW_POS              (4U)
#define RF_RBB_BW_CTRL_HW_LEN              (1U)
#define RF_RBB_BW_CTRL_HW_MSK              (((1U << RF_RBB_BW_CTRL_HW_LEN) - 1) << RF_RBB_BW_CTRL_HW_POS)
#define RF_RBB_BW_CTRL_HW_UMSK             (~(((1U << RF_RBB_BW_CTRL_HW_LEN) - 1) << RF_RBB_BW_CTRL_HW_POS))
#define RF_TRXCAL_CTRL_HW                  RF_TRXCAL_CTRL_HW
#define RF_TRXCAL_CTRL_HW_POS              (5U)
#define RF_TRXCAL_CTRL_HW_LEN              (1U)
#define RF_TRXCAL_CTRL_HW_MSK              (((1U << RF_TRXCAL_CTRL_HW_LEN) - 1) << RF_TRXCAL_CTRL_HW_POS)
#define RF_TRXCAL_CTRL_HW_UMSK             (~(((1U << RF_TRXCAL_CTRL_HW_LEN) - 1) << RF_TRXCAL_CTRL_HW_POS))
#define RF_LO_CTRL_HW                      RF_LO_CTRL_HW
#define RF_LO_CTRL_HW_POS                  (6U)
#define RF_LO_CTRL_HW_LEN                  (1U)
#define RF_LO_CTRL_HW_MSK                  (((1U << RF_LO_CTRL_HW_LEN) - 1) << RF_LO_CTRL_HW_POS)
#define RF_LO_CTRL_HW_UMSK                 (~(((1U << RF_LO_CTRL_HW_LEN) - 1) << RF_LO_CTRL_HW_POS))
#define RF_INC_ACAL_CTRL_EN_HW             RF_INC_ACAL_CTRL_EN_HW
#define RF_INC_ACAL_CTRL_EN_HW_POS         (7U)
#define RF_INC_ACAL_CTRL_EN_HW_LEN         (1U)
#define RF_INC_ACAL_CTRL_EN_HW_MSK         (((1U << RF_INC_ACAL_CTRL_EN_HW_LEN) - 1) << RF_INC_ACAL_CTRL_EN_HW_POS)
#define RF_INC_ACAL_CTRL_EN_HW_UMSK        (~(((1U << RF_INC_ACAL_CTRL_EN_HW_LEN) - 1) << RF_INC_ACAL_CTRL_EN_HW_POS))
#define RF_INC_FCAL_CTRL_EN_HW             RF_INC_FCAL_CTRL_EN_HW
#define RF_INC_FCAL_CTRL_EN_HW_POS         (8U)
#define RF_INC_FCAL_CTRL_EN_HW_LEN         (1U)
#define RF_INC_FCAL_CTRL_EN_HW_MSK         (((1U << RF_INC_FCAL_CTRL_EN_HW_LEN) - 1) << RF_INC_FCAL_CTRL_EN_HW_POS)
#define RF_INC_FCAL_CTRL_EN_HW_UMSK        (~(((1U << RF_INC_FCAL_CTRL_EN_HW_LEN) - 1) << RF_INC_FCAL_CTRL_EN_HW_POS))
#define RF_SDM_CTRL_HW                     RF_SDM_CTRL_HW
#define RF_SDM_CTRL_HW_POS                 (9U)
#define RF_SDM_CTRL_HW_LEN                 (1U)
#define RF_SDM_CTRL_HW_MSK                 (((1U << RF_SDM_CTRL_HW_LEN) - 1) << RF_SDM_CTRL_HW_POS)
#define RF_SDM_CTRL_HW_UMSK                (~(((1U << RF_SDM_CTRL_HW_LEN) - 1) << RF_SDM_CTRL_HW_POS))
#define RF_RBB_PKDET_EN_CTRL_HW            RF_RBB_PKDET_EN_CTRL_HW
#define RF_RBB_PKDET_EN_CTRL_HW_POS        (10U)
#define RF_RBB_PKDET_EN_CTRL_HW_LEN        (1U)
#define RF_RBB_PKDET_EN_CTRL_HW_MSK        (((1U << RF_RBB_PKDET_EN_CTRL_HW_LEN) - 1) << RF_RBB_PKDET_EN_CTRL_HW_POS)
#define RF_RBB_PKDET_EN_CTRL_HW_UMSK       (~(((1U << RF_RBB_PKDET_EN_CTRL_HW_LEN) - 1) << RF_RBB_PKDET_EN_CTRL_HW_POS))
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW      RF_RBB_PKDET_OUT_RSTN_CTRL_HW
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW_POS  (11U)
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW_LEN  (1U)
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW_MSK  (((1U << RF_RBB_PKDET_OUT_RSTN_CTRL_HW_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_CTRL_HW_POS)
#define RF_RBB_PKDET_OUT_RSTN_CTRL_HW_UMSK (~(((1U << RF_RBB_PKDET_OUT_RSTN_CTRL_HW_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_CTRL_HW_POS))
#define RF_ADDA_CTRL_HW                    RF_ADDA_CTRL_HW
#define RF_ADDA_CTRL_HW_POS                (12U)
#define RF_ADDA_CTRL_HW_LEN                (1U)
#define RF_ADDA_CTRL_HW_MSK                (((1U << RF_ADDA_CTRL_HW_LEN) - 1) << RF_ADDA_CTRL_HW_POS)
#define RF_ADDA_CTRL_HW_UMSK               (~(((1U << RF_ADDA_CTRL_HW_LEN) - 1) << RF_ADDA_CTRL_HW_POS))

/* 0x10 : temp_comp */
#define RF_TEMP_COMP_OFFSET  (0x10)
#define RF_CONST_ACAL        RF_CONST_ACAL
#define RF_CONST_ACAL_POS    (0U)
#define RF_CONST_ACAL_LEN    (8U)
#define RF_CONST_ACAL_MSK    (((1U << RF_CONST_ACAL_LEN) - 1) << RF_CONST_ACAL_POS)
#define RF_CONST_ACAL_UMSK   (~(((1U << RF_CONST_ACAL_LEN) - 1) << RF_CONST_ACAL_POS))
#define RF_CONST_FCAL        RF_CONST_FCAL
#define RF_CONST_FCAL_POS    (8U)
#define RF_CONST_FCAL_LEN    (8U)
#define RF_CONST_FCAL_MSK    (((1U << RF_CONST_FCAL_LEN) - 1) << RF_CONST_FCAL_POS)
#define RF_CONST_FCAL_UMSK   (~(((1U << RF_CONST_FCAL_LEN) - 1) << RF_CONST_FCAL_POS))
#define RF_TEMP_COMP_EN      RF_TEMP_COMP_EN
#define RF_TEMP_COMP_EN_POS  (16U)
#define RF_TEMP_COMP_EN_LEN  (1U)
#define RF_TEMP_COMP_EN_MSK  (((1U << RF_TEMP_COMP_EN_LEN) - 1) << RF_TEMP_COMP_EN_POS)
#define RF_TEMP_COMP_EN_UMSK (~(((1U << RF_TEMP_COMP_EN_LEN) - 1) << RF_TEMP_COMP_EN_POS))

/* 0x14 : rfcal_status */
#define RFCAL_STATUS_OFFSET        (0x14)
#define RF_RCAL_STATUS             RF_RCAL_STATUS
#define RF_RCAL_STATUS_POS         (0U)
#define RF_RCAL_STATUS_LEN         (2U)
#define RF_RCAL_STATUS_MSK         (((1U << RF_RCAL_STATUS_LEN) - 1) << RF_RCAL_STATUS_POS)
#define RF_RCAL_STATUS_UMSK        (~(((1U << RF_RCAL_STATUS_LEN) - 1) << RF_RCAL_STATUS_POS))
#define RF_ADC_OSCAL_STATUS        RF_ADC_OSCAL_STATUS
#define RF_ADC_OSCAL_STATUS_POS    (2U)
#define RF_ADC_OSCAL_STATUS_LEN    (2U)
#define RF_ADC_OSCAL_STATUS_MSK    (((1U << RF_ADC_OSCAL_STATUS_LEN) - 1) << RF_ADC_OSCAL_STATUS_POS)
#define RF_ADC_OSCAL_STATUS_UMSK   (~(((1U << RF_ADC_OSCAL_STATUS_LEN) - 1) << RF_ADC_OSCAL_STATUS_POS))
#define RF_FCAL_STATUS             RF_FCAL_STATUS
#define RF_FCAL_STATUS_POS         (4U)
#define RF_FCAL_STATUS_LEN         (2U)
#define RF_FCAL_STATUS_MSK         (((1U << RF_FCAL_STATUS_LEN) - 1) << RF_FCAL_STATUS_POS)
#define RF_FCAL_STATUS_UMSK        (~(((1U << RF_FCAL_STATUS_LEN) - 1) << RF_FCAL_STATUS_POS))
#define RF_ACAL_STATUS             RF_ACAL_STATUS
#define RF_ACAL_STATUS_POS         (6U)
#define RF_ACAL_STATUS_LEN         (2U)
#define RF_ACAL_STATUS_MSK         (((1U << RF_ACAL_STATUS_LEN) - 1) << RF_ACAL_STATUS_POS)
#define RF_ACAL_STATUS_UMSK        (~(((1U << RF_ACAL_STATUS_LEN) - 1) << RF_ACAL_STATUS_POS))
#define RF_INC_FCAL_STATUS         RF_INC_FCAL_STATUS
#define RF_INC_FCAL_STATUS_POS     (8U)
#define RF_INC_FCAL_STATUS_LEN     (2U)
#define RF_INC_FCAL_STATUS_MSK     (((1U << RF_INC_FCAL_STATUS_LEN) - 1) << RF_INC_FCAL_STATUS_POS)
#define RF_INC_FCAL_STATUS_UMSK    (~(((1U << RF_INC_FCAL_STATUS_LEN) - 1) << RF_INC_FCAL_STATUS_POS))
#define RF_INC_ACAL_STATUS         RF_INC_ACAL_STATUS
#define RF_INC_ACAL_STATUS_POS     (10U)
#define RF_INC_ACAL_STATUS_LEN     (2U)
#define RF_INC_ACAL_STATUS_MSK     (((1U << RF_INC_ACAL_STATUS_LEN) - 1) << RF_INC_ACAL_STATUS_POS)
#define RF_INC_ACAL_STATUS_UMSK    (~(((1U << RF_INC_ACAL_STATUS_LEN) - 1) << RF_INC_ACAL_STATUS_POS))
#define RF_CLKPLL_CAL_STATUS       RF_CLKPLL_CAL_STATUS
#define RF_CLKPLL_CAL_STATUS_POS   (12U)
#define RF_CLKPLL_CAL_STATUS_LEN   (2U)
#define RF_CLKPLL_CAL_STATUS_MSK   (((1U << RF_CLKPLL_CAL_STATUS_LEN) - 1) << RF_CLKPLL_CAL_STATUS_POS)
#define RF_CLKPLL_CAL_STATUS_UMSK  (~(((1U << RF_CLKPLL_CAL_STATUS_LEN) - 1) << RF_CLKPLL_CAL_STATUS_POS))
#define RF_ROS_STATUS              RF_ROS_STATUS
#define RF_ROS_STATUS_POS          (14U)
#define RF_ROS_STATUS_LEN          (2U)
#define RF_ROS_STATUS_MSK          (((1U << RF_ROS_STATUS_LEN) - 1) << RF_ROS_STATUS_POS)
#define RF_ROS_STATUS_UMSK         (~(((1U << RF_ROS_STATUS_LEN) - 1) << RF_ROS_STATUS_POS))
#define RF_TOS_STATUS              RF_TOS_STATUS
#define RF_TOS_STATUS_POS          (16U)
#define RF_TOS_STATUS_LEN          (2U)
#define RF_TOS_STATUS_MSK          (((1U << RF_TOS_STATUS_LEN) - 1) << RF_TOS_STATUS_POS)
#define RF_TOS_STATUS_UMSK         (~(((1U << RF_TOS_STATUS_LEN) - 1) << RF_TOS_STATUS_POS))
#define RF_RCCAL_STATUS            RF_RCCAL_STATUS
#define RF_RCCAL_STATUS_POS        (18U)
#define RF_RCCAL_STATUS_LEN        (2U)
#define RF_RCCAL_STATUS_MSK        (((1U << RF_RCCAL_STATUS_LEN) - 1) << RF_RCCAL_STATUS_POS)
#define RF_RCCAL_STATUS_UMSK       (~(((1U << RF_RCCAL_STATUS_LEN) - 1) << RF_RCCAL_STATUS_POS))
#define RF_LO_LEAKCAL_STATUS       RF_LO_LEAKCAL_STATUS
#define RF_LO_LEAKCAL_STATUS_POS   (20U)
#define RF_LO_LEAKCAL_STATUS_LEN   (2U)
#define RF_LO_LEAKCAL_STATUS_MSK   (((1U << RF_LO_LEAKCAL_STATUS_LEN) - 1) << RF_LO_LEAKCAL_STATUS_POS)
#define RF_LO_LEAKCAL_STATUS_UMSK  (~(((1U << RF_LO_LEAKCAL_STATUS_LEN) - 1) << RF_LO_LEAKCAL_STATUS_POS))
#define RF_TIQCAL_STATUS_RESV      RF_TIQCAL_STATUS_RESV
#define RF_TIQCAL_STATUS_RESV_POS  (22U)
#define RF_TIQCAL_STATUS_RESV_LEN  (2U)
#define RF_TIQCAL_STATUS_RESV_MSK  (((1U << RF_TIQCAL_STATUS_RESV_LEN) - 1) << RF_TIQCAL_STATUS_RESV_POS)
#define RF_TIQCAL_STATUS_RESV_UMSK (~(((1U << RF_TIQCAL_STATUS_RESV_LEN) - 1) << RF_TIQCAL_STATUS_RESV_POS))
#define RF_RIQCAL_STATUS_RESV      RF_RIQCAL_STATUS_RESV
#define RF_RIQCAL_STATUS_RESV_POS  (24U)
#define RF_RIQCAL_STATUS_RESV_LEN  (2U)
#define RF_RIQCAL_STATUS_RESV_MSK  (((1U << RF_RIQCAL_STATUS_RESV_LEN) - 1) << RF_RIQCAL_STATUS_RESV_POS)
#define RF_RIQCAL_STATUS_RESV_UMSK (~(((1U << RF_RIQCAL_STATUS_RESV_LEN) - 1) << RF_RIQCAL_STATUS_RESV_POS))
#define RF_PWDET_CAL_STATUS        RF_PWDET_CAL_STATUS
#define RF_PWDET_CAL_STATUS_POS    (26U)
#define RF_PWDET_CAL_STATUS_LEN    (2U)
#define RF_PWDET_CAL_STATUS_MSK    (((1U << RF_PWDET_CAL_STATUS_LEN) - 1) << RF_PWDET_CAL_STATUS_POS)
#define RF_PWDET_CAL_STATUS_UMSK   (~(((1U << RF_PWDET_CAL_STATUS_LEN) - 1) << RF_PWDET_CAL_STATUS_POS))
#define RF_TENSCAL_STATUS          RF_TENSCAL_STATUS
#define RF_TENSCAL_STATUS_POS      (28U)
#define RF_TENSCAL_STATUS_LEN      (2U)
#define RF_TENSCAL_STATUS_MSK      (((1U << RF_TENSCAL_STATUS_LEN) - 1) << RF_TENSCAL_STATUS_POS)
#define RF_TENSCAL_STATUS_UMSK     (~(((1U << RF_TENSCAL_STATUS_LEN) - 1) << RF_TENSCAL_STATUS_POS))
#define RF_DPD_STATUS              RF_DPD_STATUS
#define RF_DPD_STATUS_POS          (30U)
#define RF_DPD_STATUS_LEN          (2U)
#define RF_DPD_STATUS_MSK          (((1U << RF_DPD_STATUS_LEN) - 1) << RF_DPD_STATUS_POS)
#define RF_DPD_STATUS_UMSK         (~(((1U << RF_DPD_STATUS_LEN) - 1) << RF_DPD_STATUS_POS))

/* 0x18 : rfcal_status2 */
#define RFCAL_STATUS2_OFFSET          (0x18)
#define RF_DL_RFCAL_TABLE_STATUS      RF_DL_RFCAL_TABLE_STATUS
#define RF_DL_RFCAL_TABLE_STATUS_POS  (0U)
#define RF_DL_RFCAL_TABLE_STATUS_LEN  (2U)
#define RF_DL_RFCAL_TABLE_STATUS_MSK  (((1U << RF_DL_RFCAL_TABLE_STATUS_LEN) - 1) << RF_DL_RFCAL_TABLE_STATUS_POS)
#define RF_DL_RFCAL_TABLE_STATUS_UMSK (~(((1U << RF_DL_RFCAL_TABLE_STATUS_LEN) - 1) << RF_DL_RFCAL_TABLE_STATUS_POS))

/* 0x1C : Calibration mode register */
#define RFCAL_CTRLEN_OFFSET       (0x1C)
#define RF_RCAL_EN_RESV           RF_RCAL_EN_RESV
#define RF_RCAL_EN_RESV_POS       (0U)
#define RF_RCAL_EN_RESV_LEN       (1U)
#define RF_RCAL_EN_RESV_MSK       (((1U << RF_RCAL_EN_RESV_LEN) - 1) << RF_RCAL_EN_RESV_POS)
#define RF_RCAL_EN_RESV_UMSK      (~(((1U << RF_RCAL_EN_RESV_LEN) - 1) << RF_RCAL_EN_RESV_POS))
#define RF_ADC_OSCAL_EN           RF_ADC_OSCAL_EN
#define RF_ADC_OSCAL_EN_POS       (1U)
#define RF_ADC_OSCAL_EN_LEN       (1U)
#define RF_ADC_OSCAL_EN_MSK       (((1U << RF_ADC_OSCAL_EN_LEN) - 1) << RF_ADC_OSCAL_EN_POS)
#define RF_ADC_OSCAL_EN_UMSK      (~(((1U << RF_ADC_OSCAL_EN_LEN) - 1) << RF_ADC_OSCAL_EN_POS))
#define RF_DL_RFCAL_TABLE_EN      RF_DL_RFCAL_TABLE_EN
#define RF_DL_RFCAL_TABLE_EN_POS  (2U)
#define RF_DL_RFCAL_TABLE_EN_LEN  (1U)
#define RF_DL_RFCAL_TABLE_EN_MSK  (((1U << RF_DL_RFCAL_TABLE_EN_LEN) - 1) << RF_DL_RFCAL_TABLE_EN_POS)
#define RF_DL_RFCAL_TABLE_EN_UMSK (~(((1U << RF_DL_RFCAL_TABLE_EN_LEN) - 1) << RF_DL_RFCAL_TABLE_EN_POS))
#define RF_FCAL_EN                RF_FCAL_EN
#define RF_FCAL_EN_POS            (3U)
#define RF_FCAL_EN_LEN            (1U)
#define RF_FCAL_EN_MSK            (((1U << RF_FCAL_EN_LEN) - 1) << RF_FCAL_EN_POS)
#define RF_FCAL_EN_UMSK           (~(((1U << RF_FCAL_EN_LEN) - 1) << RF_FCAL_EN_POS))
#define RF_ACAL_EN                RF_ACAL_EN
#define RF_ACAL_EN_POS            (4U)
#define RF_ACAL_EN_LEN            (1U)
#define RF_ACAL_EN_MSK            (((1U << RF_ACAL_EN_LEN) - 1) << RF_ACAL_EN_POS)
#define RF_ACAL_EN_UMSK           (~(((1U << RF_ACAL_EN_LEN) - 1) << RF_ACAL_EN_POS))
#define RF_FCAL_INC_EN            RF_FCAL_INC_EN
#define RF_FCAL_INC_EN_POS        (5U)
#define RF_FCAL_INC_EN_LEN        (1U)
#define RF_FCAL_INC_EN_MSK        (((1U << RF_FCAL_INC_EN_LEN) - 1) << RF_FCAL_INC_EN_POS)
#define RF_FCAL_INC_EN_UMSK       (~(((1U << RF_FCAL_INC_EN_LEN) - 1) << RF_FCAL_INC_EN_POS))
#define RF_ACAL_INC_EN            RF_ACAL_INC_EN
#define RF_ACAL_INC_EN_POS        (6U)
#define RF_ACAL_INC_EN_LEN        (1U)
#define RF_ACAL_INC_EN_MSK        (((1U << RF_ACAL_INC_EN_LEN) - 1) << RF_ACAL_INC_EN_POS)
#define RF_ACAL_INC_EN_UMSK       (~(((1U << RF_ACAL_INC_EN_LEN) - 1) << RF_ACAL_INC_EN_POS))
#define RF_ROSCAL_INC_EN          RF_ROSCAL_INC_EN
#define RF_ROSCAL_INC_EN_POS      (7U)
#define RF_ROSCAL_INC_EN_LEN      (1U)
#define RF_ROSCAL_INC_EN_MSK      (((1U << RF_ROSCAL_INC_EN_LEN) - 1) << RF_ROSCAL_INC_EN_POS)
#define RF_ROSCAL_INC_EN_UMSK     (~(((1U << RF_ROSCAL_INC_EN_LEN) - 1) << RF_ROSCAL_INC_EN_POS))
#define RF_CLKPLL_CAL_EN          RF_CLKPLL_CAL_EN
#define RF_CLKPLL_CAL_EN_POS      (8U)
#define RF_CLKPLL_CAL_EN_LEN      (1U)
#define RF_CLKPLL_CAL_EN_MSK      (((1U << RF_CLKPLL_CAL_EN_LEN) - 1) << RF_CLKPLL_CAL_EN_POS)
#define RF_CLKPLL_CAL_EN_UMSK     (~(((1U << RF_CLKPLL_CAL_EN_LEN) - 1) << RF_CLKPLL_CAL_EN_POS))
#define RF_ROSCAL_EN              RF_ROSCAL_EN
#define RF_ROSCAL_EN_POS          (9U)
#define RF_ROSCAL_EN_LEN          (1U)
#define RF_ROSCAL_EN_MSK          (((1U << RF_ROSCAL_EN_LEN) - 1) << RF_ROSCAL_EN_POS)
#define RF_ROSCAL_EN_UMSK         (~(((1U << RF_ROSCAL_EN_LEN) - 1) << RF_ROSCAL_EN_POS))
#define RF_TOSCAL_EN              RF_TOSCAL_EN
#define RF_TOSCAL_EN_POS          (10U)
#define RF_TOSCAL_EN_LEN          (1U)
#define RF_TOSCAL_EN_MSK          (((1U << RF_TOSCAL_EN_LEN) - 1) << RF_TOSCAL_EN_POS)
#define RF_TOSCAL_EN_UMSK         (~(((1U << RF_TOSCAL_EN_LEN) - 1) << RF_TOSCAL_EN_POS))
#define RF_RCCAL_EN               RF_RCCAL_EN
#define RF_RCCAL_EN_POS           (11U)
#define RF_RCCAL_EN_LEN           (1U)
#define RF_RCCAL_EN_MSK           (((1U << RF_RCCAL_EN_LEN) - 1) << RF_RCCAL_EN_POS)
#define RF_RCCAL_EN_UMSK          (~(((1U << RF_RCCAL_EN_LEN) - 1) << RF_RCCAL_EN_POS))
#define RF_LO_LEAKCAL_EN          RF_LO_LEAKCAL_EN
#define RF_LO_LEAKCAL_EN_POS      (12U)
#define RF_LO_LEAKCAL_EN_LEN      (1U)
#define RF_LO_LEAKCAL_EN_MSK      (((1U << RF_LO_LEAKCAL_EN_LEN) - 1) << RF_LO_LEAKCAL_EN_POS)
#define RF_LO_LEAKCAL_EN_UMSK     (~(((1U << RF_LO_LEAKCAL_EN_LEN) - 1) << RF_LO_LEAKCAL_EN_POS))
#define RF_TIQCAL_EN              RF_TIQCAL_EN
#define RF_TIQCAL_EN_POS          (13U)
#define RF_TIQCAL_EN_LEN          (1U)
#define RF_TIQCAL_EN_MSK          (((1U << RF_TIQCAL_EN_LEN) - 1) << RF_TIQCAL_EN_POS)
#define RF_TIQCAL_EN_UMSK         (~(((1U << RF_TIQCAL_EN_LEN) - 1) << RF_TIQCAL_EN_POS))
#define RF_RIQCAL_EN              RF_RIQCAL_EN
#define RF_RIQCAL_EN_POS          (14U)
#define RF_RIQCAL_EN_LEN          (1U)
#define RF_RIQCAL_EN_MSK          (((1U << RF_RIQCAL_EN_LEN) - 1) << RF_RIQCAL_EN_POS)
#define RF_RIQCAL_EN_UMSK         (~(((1U << RF_RIQCAL_EN_LEN) - 1) << RF_RIQCAL_EN_POS))
#define RF_PWDET_CAL_EN           RF_PWDET_CAL_EN
#define RF_PWDET_CAL_EN_POS       (15U)
#define RF_PWDET_CAL_EN_LEN       (1U)
#define RF_PWDET_CAL_EN_MSK       (((1U << RF_PWDET_CAL_EN_LEN) - 1) << RF_PWDET_CAL_EN_POS)
#define RF_PWDET_CAL_EN_UMSK      (~(((1U << RF_PWDET_CAL_EN_LEN) - 1) << RF_PWDET_CAL_EN_POS))
#define RF_TSENCAL_EN             RF_TSENCAL_EN
#define RF_TSENCAL_EN_POS         (16U)
#define RF_TSENCAL_EN_LEN         (1U)
#define RF_TSENCAL_EN_MSK         (((1U << RF_TSENCAL_EN_LEN) - 1) << RF_TSENCAL_EN_POS)
#define RF_TSENCAL_EN_UMSK        (~(((1U << RF_TSENCAL_EN_LEN) - 1) << RF_TSENCAL_EN_POS))
#define RF_DPD_EN                 RF_DPD_EN
#define RF_DPD_EN_POS             (17U)
#define RF_DPD_EN_LEN             (1U)
#define RF_DPD_EN_MSK             (((1U << RF_DPD_EN_LEN) - 1) << RF_DPD_EN_POS)
#define RF_DPD_EN_UMSK            (~(((1U << RF_DPD_EN_LEN) - 1) << RF_DPD_EN_POS))

/* 0x20 : rf calibration state enabl in full cal list */
#define RFCAL_STATEEN_OFFSET        (0x20)
#define RF_RCAL_STEN_RESV           RF_RCAL_STEN_RESV
#define RF_RCAL_STEN_RESV_POS       (0U)
#define RF_RCAL_STEN_RESV_LEN       (1U)
#define RF_RCAL_STEN_RESV_MSK       (((1U << RF_RCAL_STEN_RESV_LEN) - 1) << RF_RCAL_STEN_RESV_POS)
#define RF_RCAL_STEN_RESV_UMSK      (~(((1U << RF_RCAL_STEN_RESV_LEN) - 1) << RF_RCAL_STEN_RESV_POS))
#define RF_ADC_OSCAL_STEN           RF_ADC_OSCAL_STEN
#define RF_ADC_OSCAL_STEN_POS       (1U)
#define RF_ADC_OSCAL_STEN_LEN       (1U)
#define RF_ADC_OSCAL_STEN_MSK       (((1U << RF_ADC_OSCAL_STEN_LEN) - 1) << RF_ADC_OSCAL_STEN_POS)
#define RF_ADC_OSCAL_STEN_UMSK      (~(((1U << RF_ADC_OSCAL_STEN_LEN) - 1) << RF_ADC_OSCAL_STEN_POS))
#define RF_DL_RFCAL_TABLE_STEN      RF_DL_RFCAL_TABLE_STEN
#define RF_DL_RFCAL_TABLE_STEN_POS  (2U)
#define RF_DL_RFCAL_TABLE_STEN_LEN  (1U)
#define RF_DL_RFCAL_TABLE_STEN_MSK  (((1U << RF_DL_RFCAL_TABLE_STEN_LEN) - 1) << RF_DL_RFCAL_TABLE_STEN_POS)
#define RF_DL_RFCAL_TABLE_STEN_UMSK (~(((1U << RF_DL_RFCAL_TABLE_STEN_LEN) - 1) << RF_DL_RFCAL_TABLE_STEN_POS))
#define RF_FCAL_STEN                RF_FCAL_STEN
#define RF_FCAL_STEN_POS            (3U)
#define RF_FCAL_STEN_LEN            (1U)
#define RF_FCAL_STEN_MSK            (((1U << RF_FCAL_STEN_LEN) - 1) << RF_FCAL_STEN_POS)
#define RF_FCAL_STEN_UMSK           (~(((1U << RF_FCAL_STEN_LEN) - 1) << RF_FCAL_STEN_POS))
#define RF_ACAL_STEN                RF_ACAL_STEN
#define RF_ACAL_STEN_POS            (4U)
#define RF_ACAL_STEN_LEN            (1U)
#define RF_ACAL_STEN_MSK            (((1U << RF_ACAL_STEN_LEN) - 1) << RF_ACAL_STEN_POS)
#define RF_ACAL_STEN_UMSK           (~(((1U << RF_ACAL_STEN_LEN) - 1) << RF_ACAL_STEN_POS))
#define RF_INC_FCAL_STEN            RF_INC_FCAL_STEN
#define RF_INC_FCAL_STEN_POS        (5U)
#define RF_INC_FCAL_STEN_LEN        (1U)
#define RF_INC_FCAL_STEN_MSK        (((1U << RF_INC_FCAL_STEN_LEN) - 1) << RF_INC_FCAL_STEN_POS)
#define RF_INC_FCAL_STEN_UMSK       (~(((1U << RF_INC_FCAL_STEN_LEN) - 1) << RF_INC_FCAL_STEN_POS))
#define RF_INC_ACAL_STEN            RF_INC_ACAL_STEN
#define RF_INC_ACAL_STEN_POS        (6U)
#define RF_INC_ACAL_STEN_LEN        (1U)
#define RF_INC_ACAL_STEN_MSK        (((1U << RF_INC_ACAL_STEN_LEN) - 1) << RF_INC_ACAL_STEN_POS)
#define RF_INC_ACAL_STEN_UMSK       (~(((1U << RF_INC_ACAL_STEN_LEN) - 1) << RF_INC_ACAL_STEN_POS))
#define RF_CLKPLL_CAL_STEN          RF_CLKPLL_CAL_STEN
#define RF_CLKPLL_CAL_STEN_POS      (7U)
#define RF_CLKPLL_CAL_STEN_LEN      (1U)
#define RF_CLKPLL_CAL_STEN_MSK      (((1U << RF_CLKPLL_CAL_STEN_LEN) - 1) << RF_CLKPLL_CAL_STEN_POS)
#define RF_CLKPLL_CAL_STEN_UMSK     (~(((1U << RF_CLKPLL_CAL_STEN_LEN) - 1) << RF_CLKPLL_CAL_STEN_POS))
#define RF_ROSCAL_STEN              RF_ROSCAL_STEN
#define RF_ROSCAL_STEN_POS          (8U)
#define RF_ROSCAL_STEN_LEN          (1U)
#define RF_ROSCAL_STEN_MSK          (((1U << RF_ROSCAL_STEN_LEN) - 1) << RF_ROSCAL_STEN_POS)
#define RF_ROSCAL_STEN_UMSK         (~(((1U << RF_ROSCAL_STEN_LEN) - 1) << RF_ROSCAL_STEN_POS))
#define RF_TOSCAL_STEN_RESV         RF_TOSCAL_STEN_RESV
#define RF_TOSCAL_STEN_RESV_POS     (9U)
#define RF_TOSCAL_STEN_RESV_LEN     (1U)
#define RF_TOSCAL_STEN_RESV_MSK     (((1U << RF_TOSCAL_STEN_RESV_LEN) - 1) << RF_TOSCAL_STEN_RESV_POS)
#define RF_TOSCAL_STEN_RESV_UMSK    (~(((1U << RF_TOSCAL_STEN_RESV_LEN) - 1) << RF_TOSCAL_STEN_RESV_POS))
#define RF_RCCAL_STEN               RF_RCCAL_STEN
#define RF_RCCAL_STEN_POS           (10U)
#define RF_RCCAL_STEN_LEN           (1U)
#define RF_RCCAL_STEN_MSK           (((1U << RF_RCCAL_STEN_LEN) - 1) << RF_RCCAL_STEN_POS)
#define RF_RCCAL_STEN_UMSK          (~(((1U << RF_RCCAL_STEN_LEN) - 1) << RF_RCCAL_STEN_POS))
#define RF_LO_LEAKCAL_STEN          RF_LO_LEAKCAL_STEN
#define RF_LO_LEAKCAL_STEN_POS      (11U)
#define RF_LO_LEAKCAL_STEN_LEN      (1U)
#define RF_LO_LEAKCAL_STEN_MSK      (((1U << RF_LO_LEAKCAL_STEN_LEN) - 1) << RF_LO_LEAKCAL_STEN_POS)
#define RF_LO_LEAKCAL_STEN_UMSK     (~(((1U << RF_LO_LEAKCAL_STEN_LEN) - 1) << RF_LO_LEAKCAL_STEN_POS))
#define RF_TIQCAL_STEN              RF_TIQCAL_STEN
#define RF_TIQCAL_STEN_POS          (12U)
#define RF_TIQCAL_STEN_LEN          (1U)
#define RF_TIQCAL_STEN_MSK          (((1U << RF_TIQCAL_STEN_LEN) - 1) << RF_TIQCAL_STEN_POS)
#define RF_TIQCAL_STEN_UMSK         (~(((1U << RF_TIQCAL_STEN_LEN) - 1) << RF_TIQCAL_STEN_POS))
#define RF_RIQCAL_STEN              RF_RIQCAL_STEN
#define RF_RIQCAL_STEN_POS          (13U)
#define RF_RIQCAL_STEN_LEN          (1U)
#define RF_RIQCAL_STEN_MSK          (((1U << RF_RIQCAL_STEN_LEN) - 1) << RF_RIQCAL_STEN_POS)
#define RF_RIQCAL_STEN_UMSK         (~(((1U << RF_RIQCAL_STEN_LEN) - 1) << RF_RIQCAL_STEN_POS))
#define RF_PWDET_CAL_STEN           RF_PWDET_CAL_STEN
#define RF_PWDET_CAL_STEN_POS       (14U)
#define RF_PWDET_CAL_STEN_LEN       (1U)
#define RF_PWDET_CAL_STEN_MSK       (((1U << RF_PWDET_CAL_STEN_LEN) - 1) << RF_PWDET_CAL_STEN_POS)
#define RF_PWDET_CAL_STEN_UMSK      (~(((1U << RF_PWDET_CAL_STEN_LEN) - 1) << RF_PWDET_CAL_STEN_POS))
#define RF_TSENCAL_STEN             RF_TSENCAL_STEN
#define RF_TSENCAL_STEN_POS         (15U)
#define RF_TSENCAL_STEN_LEN         (1U)
#define RF_TSENCAL_STEN_MSK         (((1U << RF_TSENCAL_STEN_LEN) - 1) << RF_TSENCAL_STEN_POS)
#define RF_TSENCAL_STEN_UMSK        (~(((1U << RF_TSENCAL_STEN_LEN) - 1) << RF_TSENCAL_STEN_POS))
#define RF_DPD_STEN                 RF_DPD_STEN
#define RF_DPD_STEN_POS             (16U)
#define RF_DPD_STEN_LEN             (1U)
#define RF_DPD_STEN_MSK             (((1U << RF_DPD_STEN_LEN) - 1) << RF_DPD_STEN_POS)
#define RF_DPD_STEN_UMSK            (~(((1U << RF_DPD_STEN_LEN) - 1) << RF_DPD_STEN_POS))
#define RFCAL_LEVEL                 RFCAL_LEVEL
#define RFCAL_LEVEL_POS             (30U)
#define RFCAL_LEVEL_LEN             (2U)
#define RFCAL_LEVEL_MSK             (((1U << RFCAL_LEVEL_LEN) - 1) << RFCAL_LEVEL_POS)
#define RFCAL_LEVEL_UMSK            (~(((1U << RFCAL_LEVEL_LEN) - 1) << RFCAL_LEVEL_POS))

/* 0x24 : SARADC Control Registers */
#define RF_SARADC_RESV_OFFSET (0x24)

