bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x28 : ZRF Control register 0 */
#define RF_BASE_CTRL1_OFFSET      (0x28)
#define RF_AUPLL_SDM_RST_DLY      RF_AUPLL_SDM_RST_DLY
#define RF_AUPLL_SDM_RST_DLY_POS  (0U)
#define RF_AUPLL_SDM_RST_DLY_LEN  (2U)
#define RF_AUPLL_SDM_RST_DLY_MSK  (((1U << RF_AUPLL_SDM_RST_DLY_LEN) - 1) << RF_AUPLL_SDM_RST_DLY_POS)
#define RF_AUPLL_SDM_RST_DLY_UMSK (~(((1U << RF_AUPLL_SDM_RST_DLY_LEN) - 1) << RF_AUPLL_SDM_RST_DLY_POS))
#define RF_LO_SDM_RST_DLY         RF_LO_SDM_RST_DLY
#define RF_LO_SDM_RST_DLY_POS     (2U)
#define RF_LO_SDM_RST_DLY_LEN     (2U)
#define RF_LO_SDM_RST_DLY_MSK     (((1U << RF_LO_SDM_RST_DLY_LEN) - 1) << RF_LO_SDM_RST_DLY_POS)
#define RF_LO_SDM_RST_DLY_UMSK    (~(((1U << RF_LO_SDM_RST_DLY_LEN) - 1) << RF_LO_SDM_RST_DLY_POS))
#define RF_PPU_LEAD               RF_PPU_LEAD
#define RF_PPU_LEAD_POS           (8U)
#define RF_PPU_LEAD_LEN           (2U)
#define RF_PPU_LEAD_MSK           (((1U << RF_PPU_LEAD_LEN) - 1) << RF_PPU_LEAD_POS)
#define RF_PPU_LEAD_UMSK          (~(((1U << RF_PPU_LEAD_LEN) - 1) << RF_PPU_LEAD_POS))
#define RF_PUD_VCO_DLY            RF_PUD_VCO_DLY
#define RF_PUD_VCO_DLY_POS        (10U)
#define RF_PUD_VCO_DLY_LEN        (2U)
#define RF_PUD_VCO_DLY_MSK        (((1U << RF_PUD_VCO_DLY_LEN) - 1) << RF_PUD_VCO_DLY_POS)
#define RF_PUD_VCO_DLY_UMSK       (~(((1U << RF_PUD_VCO_DLY_LEN) - 1) << RF_PUD_VCO_DLY_POS))
#define RF_PUD_IREF_DLY           RF_PUD_IREF_DLY
#define RF_PUD_IREF_DLY_POS       (12U)
#define RF_PUD_IREF_DLY_LEN       (2U)
#define RF_PUD_IREF_DLY_MSK       (((1U << RF_PUD_IREF_DLY_LEN) - 1) << RF_PUD_IREF_DLY_POS)
#define RF_PUD_IREF_DLY_UMSK      (~(((1U << RF_PUD_IREF_DLY_LEN) - 1) << RF_PUD_IREF_DLY_POS))
#define RF_PUD_PA_DLY             RF_PUD_PA_DLY
#define RF_PUD_PA_DLY_POS         (14U)
#define RF_PUD_PA_DLY_LEN         (2U)
#define RF_PUD_PA_DLY_MSK         (((1U << RF_PUD_PA_DLY_LEN) - 1) << RF_PUD_PA_DLY_POS)
#define RF_PUD_PA_DLY_UMSK        (~(((1U << RF_PUD_PA_DLY_LEN) - 1) << RF_PUD_PA_DLY_POS))
#define RF_MBG_TRIM               RF_MBG_TRIM
#define RF_MBG_TRIM_POS           (27U)
#define RF_MBG_TRIM_LEN           (2U)
#define RF_MBG_TRIM_MSK           (((1U << RF_MBG_TRIM_LEN) - 1) << RF_MBG_TRIM_POS)
#define RF_MBG_TRIM_UMSK          (~(((1U << RF_MBG_TRIM_LEN) - 1) << RF_MBG_TRIM_POS))

/* 0x2C : ZRF Control register 0 */
#define RF_BASE_CTRL2_OFFSET (0x2C)

/* 0x30 : pucr1 */
#define RF_PUCR1_OFFSET     (0x30)
#define RF_PU_SFREG         RF_PU_SFREG
#define RF_PU_SFREG_POS     (0U)
#define RF_PU_SFREG_LEN     (1U)
#define RF_PU_SFREG_MSK     (((1U << RF_PU_SFREG_LEN) - 1) << RF_PU_SFREG_POS)
#define RF_PU_SFREG_UMSK    (~(((1U << RF_PU_SFREG_LEN) - 1) << RF_PU_SFREG_POS))
#define RF_PU_LNA           RF_PU_LNA
#define RF_PU_LNA_POS       (8U)
#define RF_PU_LNA_LEN       (1U)
#define RF_PU_LNA_MSK       (((1U << RF_PU_LNA_LEN) - 1) << RF_PU_LNA_POS)
#define RF_PU_LNA_UMSK      (~(((1U << RF_PU_LNA_LEN) - 1) << RF_PU_LNA_POS))
#define RF_PU_RMXGM         RF_PU_RMXGM
#define RF_PU_RMXGM_POS     (9U)
#define RF_PU_RMXGM_LEN     (1U)
#define RF_PU_RMXGM_MSK     (((1U << RF_PU_RMXGM_LEN) - 1) << RF_PU_RMXGM_POS)
#define RF_PU_RMXGM_UMSK    (~(((1U << RF_PU_RMXGM_LEN) - 1) << RF_PU_RMXGM_POS))
#define RF_PU_RMX           RF_PU_RMX
#define RF_PU_RMX_POS       (10U)
#define RF_PU_RMX_LEN       (1U)
#define RF_PU_RMX_MSK       (((1U << RF_PU_RMX_LEN) - 1) << RF_PU_RMX_POS)
#define RF_PU_RMX_UMSK      (~(((1U << RF_PU_RMX_LEN) - 1) << RF_PU_RMX_POS))
#define RF_PU_RBB           RF_PU_RBB
#define RF_PU_RBB_POS       (11U)
#define RF_PU_RBB_LEN       (1U)
#define RF_PU_RBB_MSK       (((1U << RF_PU_RBB_LEN) - 1) << RF_PU_RBB_POS)
#define RF_PU_RBB_UMSK      (~(((1U << RF_PU_RBB_LEN) - 1) << RF_PU_RBB_POS))
#define RF_PU_ADDA_LDO      RF_PU_ADDA_LDO
#define RF_PU_ADDA_LDO_POS  (12U)
#define RF_PU_ADDA_LDO_LEN  (1U)
#define RF_PU_ADDA_LDO_MSK  (((1U << RF_PU_ADDA_LDO_LEN) - 1) << RF_PU_ADDA_LDO_POS)
#define RF_PU_ADDA_LDO_UMSK (~(((1U << RF_PU_ADDA_LDO_LEN) - 1) << RF_PU_ADDA_LDO_POS))
#define RF_ADC_CLK_EN       RF_ADC_CLK_EN
#define RF_ADC_CLK_EN_POS   (13U)
#define RF_ADC_CLK_EN_LEN   (1U)
#define RF_ADC_CLK_EN_MSK   (((1U << RF_ADC_CLK_EN_LEN) - 1) << RF_ADC_CLK_EN_POS)
#define RF_ADC_CLK_EN_UMSK  (~(((1U << RF_ADC_CLK_EN_LEN) - 1) << RF_ADC_CLK_EN_POS))
#define RF_PU_ADC           RF_PU_ADC
#define RF_PU_ADC_POS       (14U)
#define RF_PU_ADC_LEN       (1U)
#define RF_PU_ADC_MSK       (((1U << RF_PU_ADC_LEN) - 1) << RF_PU_ADC_POS)
#define RF_PU_ADC_UMSK      (~(((1U << RF_PU_ADC_LEN) - 1) << RF_PU_ADC_POS))
#define RF_PU_OP_ATEST      RF_PU_OP_ATEST
#define RF_PU_OP_ATEST_POS  (15U)
#define RF_PU_OP_ATEST_LEN  (1U)
#define RF_PU_OP_ATEST_MSK  (((1U << RF_PU_OP_ATEST_LEN) - 1) << RF_PU_OP_ATEST_POS)
#define RF_PU_OP_ATEST_UMSK (~(((1U << RF_PU_OP_ATEST_LEN) - 1) << RF_PU_OP_ATEST_POS))
#define RF_PU_PA            RF_PU_PA
#define RF_PU_PA_POS        (16U)
#define RF_PU_PA_LEN        (1U)
#define RF_PU_PA_MSK        (((1U << RF_PU_PA_LEN) - 1) << RF_PU_PA_POS)
#define RF_PU_PA_UMSK       (~(((1U << RF_PU_PA_LEN) - 1) << RF_PU_PA_POS))
#define RF_PU_TMX           RF_PU_TMX
#define RF_PU_TMX_POS       (17U)
#define RF_PU_TMX_LEN       (1U)
#define RF_PU_TMX_MSK       (((1U << RF_PU_TMX_LEN) - 1) << RF_PU_TMX_POS)
#define RF_PU_TMX_UMSK      (~(((1U << RF_PU_TMX_LEN) - 1) << RF_PU_TMX_POS))
#define RF_PU_TBB           RF_PU_TBB
#define RF_PU_TBB_POS       (18U)
#define RF_PU_TBB_LEN       (1U)
#define RF_PU_TBB_MSK       (((1U << RF_PU_TBB_LEN) - 1) << RF_PU_TBB_POS)
#define RF_PU_TBB_UMSK      (~(((1U << RF_PU_TBB_LEN) - 1) << RF_PU_TBB_POS))
#define RF_PU_DAC           RF_PU_DAC
#define RF_PU_DAC_POS       (19U)
#define RF_PU_DAC_LEN       (1U)
#define RF_PU_DAC_MSK       (((1U << RF_PU_DAC_LEN) - 1) << RF_PU_DAC_POS)
#define RF_PU_DAC_UMSK      (~(((1U << RF_PU_DAC_LEN) - 1) << RF_PU_DAC_POS))
#define RF_PU_VCO           RF_PU_VCO
#define RF_PU_VCO_POS       (20U)
#define RF_PU_VCO_LEN       (1U)
#define RF_PU_VCO_MSK       (((1U << RF_PU_VCO_LEN) - 1) << RF_PU_VCO_POS)
#define RF_PU_VCO_UMSK      (~(((1U << RF_PU_VCO_LEN) - 1) << RF_PU_VCO_POS))
#define RF_PU_FBDV          RF_PU_FBDV
#define RF_PU_FBDV_POS      (21U)
#define RF_PU_FBDV_LEN      (1U)
#define RF_PU_FBDV_MSK      (((1U << RF_PU_FBDV_LEN) - 1) << RF_PU_FBDV_POS)
#define RF_PU_FBDV_UMSK     (~(((1U << RF_PU_FBDV_LEN) - 1) << RF_PU_FBDV_POS))
#define RF_PU_PFD           RF_PU_PFD
#define RF_PU_PFD_POS       (22U)
#define RF_PU_PFD_LEN       (1U)
#define RF_PU_PFD_MSK       (((1U << RF_PU_PFD_LEN) - 1) << RF_PU_PFD_POS)
#define RF_PU_PFD_UMSK      (~(((1U << RF_PU_PFD_LEN) - 1) << RF_PU_PFD_POS))
#define RF_PU_OSMX          RF_PU_OSMX
#define RF_PU_OSMX_POS      (23U)
#define RF_PU_OSMX_LEN      (1U)
#define RF_PU_OSMX_MSK      (((1U << RF_PU_OSMX_LEN) - 1) << RF_PU_OSMX_POS)
#define RF_PU_OSMX_UMSK     (~(((1U << RF_PU_OSMX_LEN) - 1) << RF_PU_OSMX_POS))
#define RF_PU_RXBUF         RF_PU_RXBUF
#define RF_PU_RXBUF_POS     (24U)
#define RF_PU_RXBUF_LEN     (1U)
#define RF_PU_RXBUF_MSK     (((1U << RF_PU_RXBUF_LEN) - 1) << RF_PU_RXBUF_POS)
#define RF_PU_RXBUF_UMSK    (~(((1U << RF_PU_RXBUF_LEN) - 1) << RF_PU_RXBUF_POS))
#define RF_PU_TXBUF         RF_PU_TXBUF
#define RF_PU_TXBUF_POS     (25U)
#define RF_PU_TXBUF_LEN     (1U)
#define RF_PU_TXBUF_MSK     (((1U << RF_PU_TXBUF_LEN) - 1) << RF_PU_TXBUF_POS)
#define RF_PU_TXBUF_UMSK    (~(((1U << RF_PU_TXBUF_LEN) - 1) << RF_PU_TXBUF_POS))
#define RF_TRSW_EN          RF_TRSW_EN
#define RF_TRSW_EN_POS      (26U)
#define RF_TRSW_EN_LEN      (1U)
#define RF_TRSW_EN_MSK      (((1U << RF_TRSW_EN_LEN) - 1) << RF_TRSW_EN_POS)
#define RF_TRSW_EN_UMSK     (~(((1U << RF_TRSW_EN_LEN) - 1) << RF_TRSW_EN_POS))
#define RF_PU_PKDET         RF_PU_PKDET
#define RF_PU_PKDET_POS     (28U)
#define RF_PU_PKDET_LEN     (1U)
#define RF_PU_PKDET_MSK     (((1U << RF_PU_PKDET_LEN) - 1) << RF_PU_PKDET_POS)
#define RF_PU_PKDET_UMSK    (~(((1U << RF_PU_PKDET_LEN) - 1) << RF_PU_PKDET_POS))
#define RF_PU_ROSDAC        RF_PU_ROSDAC
#define RF_PU_ROSDAC_POS    (29U)
#define RF_PU_ROSDAC_LEN    (1U)
#define RF_PU_ROSDAC_MSK    (((1U << RF_PU_ROSDAC_LEN) - 1) << RF_PU_ROSDAC_POS)
#define RF_PU_ROSDAC_UMSK   (~(((1U << RF_PU_ROSDAC_LEN) - 1) << RF_PU_ROSDAC_POS))
#define RF_PU_PWRMX         RF_PU_PWRMX
#define RF_PU_PWRMX_POS     (30U)
#define RF_PU_PWRMX_LEN     (1U)
#define RF_PU_PWRMX_MSK     (((1U << RF_PU_PWRMX_LEN) - 1) << RF_PU_PWRMX_POS)
#define RF_PU_PWRMX_UMSK    (~(((1U << RF_PU_PWRMX_LEN) - 1) << RF_PU_PWRMX_POS))
#define RF_PU_TOSDAC        RF_PU_TOSDAC
#define RF_PU_TOSDAC_POS    (31U)
#define RF_PU_TOSDAC_LEN    (1U)
#define RF_PU_TOSDAC_MSK    (((1U << RF_PU_TOSDAC_LEN) - 1) << RF_PU_TOSDAC_POS)
#define RF_PU_TOSDAC_UMSK   (~(((1U << RF_PU_TOSDAC_LEN) - 1) << RF_PU_TOSDAC_POS))

/* 0x34 : read only from hardware logic */
#define RF_PUCR1_HW_OFFSET     (0x34)
#define RF_PU_SFREG_HW         RF_PU_SFREG_HW
#define RF_PU_SFREG_HW_POS     (0U)
#define RF_PU_SFREG_HW_LEN     (1U)
#define RF_PU_SFREG_HW_MSK     (((1U << RF_PU_SFREG_HW_LEN) - 1) << RF_PU_SFREG_HW_POS)
#define RF_PU_SFREG_HW_UMSK    (~(((1U << RF_PU_SFREG_HW_LEN) - 1) << RF_PU_SFREG_HW_POS))
#define RF_PU_LNA_HW           RF_PU_LNA_HW
#define RF_PU_LNA_HW_POS       (8U)
#define RF_PU_LNA_HW_LEN       (1U)
#define RF_PU_LNA_HW_MSK       (((1U << RF_PU_LNA_HW_LEN) - 1) << RF_PU_LNA_HW_POS)
#define RF_PU_LNA_HW_UMSK      (~(((1U << RF_PU_LNA_HW_LEN) - 1) << RF_PU_LNA_HW_POS))
#define RF_PU_RMXGM_HW         RF_PU_RMXGM_HW
#define RF_PU_RMXGM_HW_POS     (9U)
#define RF_PU_RMXGM_HW_LEN     (1U)
#define RF_PU_RMXGM_HW_MSK     (((1U << RF_PU_RMXGM_HW_LEN) - 1) << RF_PU_RMXGM_HW_POS)
#define RF_PU_RMXGM_HW_UMSK    (~(((1U << RF_PU_RMXGM_HW_LEN) - 1) << RF_PU_RMXGM_HW_POS))
#define RF_PU_RMX_HW           RF_PU_RMX_HW
#define RF_PU_RMX_HW_POS       (10U)
#define RF_PU_RMX_HW_LEN       (1U)
#define RF_PU_RMX_HW_MSK       (((1U << RF_PU_RMX_HW_LEN) - 1) << RF_PU_RMX_HW_POS)
#define RF_PU_RMX_HW_UMSK      (~(((1U << RF_PU_RMX_HW_LEN) - 1) << RF_PU_RMX_HW_POS))
#define RF_PU_RBB_HW           RF_PU_RBB_HW
#define RF_PU_RBB_HW_POS       (11U)
#define RF_PU_RBB_HW_LEN       (1U)
#define RF_PU_RBB_HW_MSK       (((1U << RF_PU_RBB_HW_LEN) - 1) << RF_PU_RBB_HW_POS)
#define RF_PU_RBB_HW_UMSK      (~(((1U << RF_PU_RBB_HW_LEN) - 1) << RF_PU_RBB_HW_POS))
#define RF_PU_ADDA_LDO_HW      RF_PU_ADDA_LDO_HW
#define RF_PU_ADDA_LDO_HW_POS  (12U)
#define RF_PU_ADDA_LDO_HW_LEN  (1U)
#define RF_PU_ADDA_LDO_HW_MSK  (((1U << RF_PU_ADDA_LDO_HW_LEN) - 1) << RF_PU_ADDA_LDO_HW_POS)
#define RF_PU_ADDA_LDO_HW_UMSK (~(((1U << RF_PU_ADDA_LDO_HW_LEN) - 1) << RF_PU_ADDA_LDO_HW_POS))
#define RF_ADC_CLK_EN_HW       RF_ADC_CLK_EN_HW
#define RF_ADC_CLK_EN_HW_POS   (13U)
#define RF_ADC_CLK_EN_HW_LEN   (1U)
#define RF_ADC_CLK_EN_HW_MSK   (((1U << RF_ADC_CLK_EN_HW_LEN) - 1) << RF_ADC_CLK_EN_HW_POS)
#define RF_ADC_CLK_EN_HW_UMSK  (~(((1U << RF_ADC_CLK_EN_HW_LEN) - 1) << RF_ADC_CLK_EN_HW_POS))
#define RF_PU_ADC_HW           RF_PU_ADC_HW
#define RF_PU_ADC_HW_POS       (14U)
#define RF_PU_ADC_HW_LEN       (1U)
#define RF_PU_ADC_HW_MSK       (((1U << RF_PU_ADC_HW_LEN) - 1) << RF_PU_ADC_HW_POS)
#define RF_PU_ADC_HW_UMSK      (~(((1U << RF_PU_ADC_HW_LEN) - 1) << RF_PU_ADC_HW_POS))
#define RF_PU_PA_HW            RF_PU_PA_HW
#define RF_PU_PA_HW_POS        (16U)
#define RF_PU_PA_HW_LEN        (1U)
#define RF_PU_PA_HW_MSK        (((1U << RF_PU_PA_HW_LEN) - 1) << RF_PU_PA_HW_POS)
#define RF_PU_PA_HW_UMSK       (~(((1U << RF_PU_PA_HW_LEN) - 1) << RF_PU_PA_HW_POS))
#define RF_PU_TMX_HW           RF_PU_TMX_HW
#define RF_PU_TMX_HW_POS       (17U)
#define RF_PU_TMX_HW_LEN       (1U)
#define RF_PU_TMX_HW_MSK       (((1U << RF_PU_TMX_HW_LEN) - 1) << RF_PU_TMX_HW_POS)
#define RF_PU_TMX_HW_UMSK      (~(((1U << RF_PU_TMX_HW_LEN) - 1) << RF_PU_TMX_HW_POS))
#define RF_PU_TBB_HW           RF_PU_TBB_HW
#define RF_PU_TBB_HW_POS       (18U)
#define RF_PU_TBB_HW_LEN       (1U)
#define RF_PU_TBB_HW_MSK       (((1U << RF_PU_TBB_HW_LEN) - 1) << RF_PU_TBB_HW_POS)
#define RF_PU_TBB_HW_UMSK      (~(((1U << RF_PU_TBB_HW_LEN) - 1) << RF_PU_TBB_HW_POS))
#define RF_PU_DAC_HW           RF_PU_DAC_HW
#define RF_PU_DAC_HW_POS       (19U)
#define RF_PU_DAC_HW_LEN       (1U)
#define RF_PU_DAC_HW_MSK       (((1U << RF_PU_DAC_HW_LEN) - 1) << RF_PU_DAC_HW_POS)
#define RF_PU_DAC_HW_UMSK      (~(((1U << RF_PU_DAC_HW_LEN) - 1) << RF_PU_DAC_HW_POS))
#define RF_PU_VCO_HW           RF_PU_VCO_HW
#define RF_PU_VCO_HW_POS       (20U)
#define RF_PU_VCO_HW_LEN       (1U)
#define RF_PU_VCO_HW_MSK       (((1U << RF_PU_VCO_HW_LEN) - 1) << RF_PU_VCO_HW_POS)
#define RF_PU_VCO_HW_UMSK      (~(((1U << RF_PU_VCO_HW_LEN) - 1) << RF_PU_VCO_HW_POS))
#define RF_PU_FBDV_HW          RF_PU_FBDV_HW
#define RF_PU_FBDV_HW_POS      (21U)
#define RF_PU_FBDV_HW_LEN      (1U)
#define RF_PU_FBDV_HW_MSK      (((1U << RF_PU_FBDV_HW_LEN) - 1) << RF_PU_FBDV_HW_POS)
#define RF_PU_FBDV_HW_UMSK     (~(((1U << RF_PU_FBDV_HW_LEN) - 1) << RF_PU_FBDV_HW_POS))
#define RF_PU_PFD_HW           RF_PU_PFD_HW
#define RF_PU_PFD_HW_POS       (22U)
#define RF_PU_PFD_HW_LEN       (1U)
#define RF_PU_PFD_HW_MSK       (((1U << RF_PU_PFD_HW_LEN) - 1) << RF_PU_PFD_HW_POS)
#define RF_PU_PFD_HW_UMSK      (~(((1U << RF_PU_PFD_HW_LEN) - 1) << RF_PU_PFD_HW_POS))
#define RF_PU_OSMX_HW          RF_PU_OSMX_HW
#define RF_PU_OSMX_HW_POS      (23U)
#define RF_PU_OSMX_HW_LEN      (1U)
#define RF_PU_OSMX_HW_MSK      (((1U << RF_PU_OSMX_HW_LEN) - 1) << RF_PU_OSMX_HW_POS)
#define RF_PU_OSMX_HW_UMSK     (~(((1U << RF_PU_OSMX_HW_LEN) - 1) << RF_PU_OSMX_HW_POS))
#define RF_PU_RXBUF_HW         RF_PU_RXBUF_HW
#define RF_PU_RXBUF_HW_POS     (24U)
#define RF_PU_RXBUF_HW_LEN     (1U)
#define RF_PU_RXBUF_HW_MSK     (((1U << RF_PU_RXBUF_HW_LEN) - 1) << RF_PU_RXBUF_HW_POS)
#define RF_PU_RXBUF_HW_UMSK    (~(((1U << RF_PU_RXBUF_HW_LEN) - 1) << RF_PU_RXBUF_HW_POS))
#define RF_PU_TXBUF_HW         RF_PU_TXBUF_HW
#define RF_PU_TXBUF_HW_POS     (25U)
#define RF_PU_TXBUF_HW_LEN     (1U)
#define RF_PU_TXBUF_HW_MSK     (((1U << RF_PU_TXBUF_HW_LEN) - 1) << RF_PU_TXBUF_HW_POS)
#define RF_PU_TXBUF_HW_UMSK    (~(((1U << RF_PU_TXBUF_HW_LEN) - 1) << RF_PU_TXBUF_HW_POS))
#define RF_TRSW_EN_HW          RF_TRSW_EN_HW
#define RF_TRSW_EN_HW_POS      (26U)
#define RF_TRSW_EN_HW_LEN      (1U)
#define RF_TRSW_EN_HW_MSK      (((1U << RF_TRSW_EN_HW_LEN) - 1) << RF_TRSW_EN_HW_POS)
#define RF_TRSW_EN_HW_UMSK     (~(((1U << RF_TRSW_EN_HW_LEN) - 1) << RF_TRSW_EN_HW_POS))
#define RF_PU_PKDET_HW         RF_PU_PKDET_HW
#define RF_PU_PKDET_HW_POS     (28U)
#define RF_PU_PKDET_HW_LEN     (1U)
#define RF_PU_PKDET_HW_MSK     (((1U << RF_PU_PKDET_HW_LEN) - 1) << RF_PU_PKDET_HW_POS)
#define RF_PU_PKDET_HW_UMSK    (~(((1U << RF_PU_PKDET_HW_LEN) - 1) << RF_PU_PKDET_HW_POS))
#define RF_PU_ROSDAC_HW        RF_PU_ROSDAC_HW
#define RF_PU_ROSDAC_HW_POS    (29U)
#define RF_PU_ROSDAC_HW_LEN    (1U)
#define RF_PU_ROSDAC_HW_MSK    (((1U << RF_PU_ROSDAC_HW_LEN) - 1) << RF_PU_ROSDAC_HW_POS)
#define RF_PU_ROSDAC_HW_UMSK   (~(((1U << RF_PU_ROSDAC_HW_LEN) - 1) << RF_PU_ROSDAC_HW_POS))
#define RF_PU_TOSDAC_HW        RF_PU_TOSDAC_HW
#define RF_PU_TOSDAC_HW_POS    (31U)
#define RF_PU_TOSDAC_HW_LEN    (1U)
#define RF_PU_TOSDAC_HW_MSK    (((1U << RF_PU_TOSDAC_HW_LEN) - 1) << RF_PU_TOSDAC_HW_POS)
#define RF_PU_TOSDAC_HW_UMSK   (~(((1U << RF_PU_TOSDAC_HW_LEN) - 1) << RF_PU_TOSDAC_HW_POS))

/* 0x38 : pucr2 */
#define RF_PUCR2_OFFSET (0x38)

/* 0x3C : pucr2_hw */
#define RF_PUCR2_HW_OFFSET (0x3C)

/* 0x40 : ppu_ctrl_hw */
#define RF_PPU_CTRL_HW_OFFSET (0x40)
#define RF_PPU_LNA_HW         RF_PPU_LNA_HW
#define RF_PPU_LNA_HW_POS     (8U)
#define RF_PPU_LNA_HW_LEN     (1U)
#define RF_PPU_LNA_HW_MSK     (((1U << RF_PPU_LNA_HW_LEN) - 1) << RF_PPU_LNA_HW_POS)
#define RF_PPU_LNA_HW_UMSK    (~(((1U << RF_PPU_LNA_HW_LEN) - 1) << RF_PPU_LNA_HW_POS))
#define RF_PPU_RMXGM_HW       RF_PPU_RMXGM_HW
#define RF_PPU_RMXGM_HW_POS   (9U)
#define RF_PPU_RMXGM_HW_LEN   (1U)
#define RF_PPU_RMXGM_HW_MSK   (((1U << RF_PPU_RMXGM_HW_LEN) - 1) << RF_PPU_RMXGM_HW_POS)
#define RF_PPU_RMXGM_HW_UMSK  (~(((1U << RF_PPU_RMXGM_HW_LEN) - 1) << RF_PPU_RMXGM_HW_POS))
#define RF_PPU_RBB_HW         RF_PPU_RBB_HW
#define RF_PPU_RBB_HW_POS     (11U)
#define RF_PPU_RBB_HW_LEN     (1U)
#define RF_PPU_RBB_HW_MSK     (((1U << RF_PPU_RBB_HW_LEN) - 1) << RF_PPU_RBB_HW_POS)
#define RF_PPU_RBB_HW_UMSK    (~(((1U << RF_PPU_RBB_HW_LEN) - 1) << RF_PPU_RBB_HW_POS))
#define RF_PPU_VCO_HW         RF_PPU_VCO_HW
#define RF_PPU_VCO_HW_POS     (20U)
#define RF_PPU_VCO_HW_LEN     (1U)
#define RF_PPU_VCO_HW_MSK     (((1U << RF_PPU_VCO_HW_LEN) - 1) << RF_PPU_VCO_HW_POS)
#define RF_PPU_VCO_HW_UMSK    (~(((1U << RF_PPU_VCO_HW_LEN) - 1) << RF_PPU_VCO_HW_POS))
#define RF_PPU_FBDV_HW        RF_PPU_FBDV_HW
#define RF_PPU_FBDV_HW_POS    (21U)
#define RF_PPU_FBDV_HW_LEN    (1U)
#define RF_PPU_FBDV_HW_MSK    (((1U << RF_PPU_FBDV_HW_LEN) - 1) << RF_PPU_FBDV_HW_POS)
#define RF_PPU_FBDV_HW_UMSK   (~(((1U << RF_PPU_FBDV_HW_LEN) - 1) << RF_PPU_FBDV_HW_POS))
#define RF_PPU_PFD_HW         RF_PPU_PFD_HW
#define RF_PPU_PFD_HW_POS     (22U)
#define RF_PPU_PFD_HW_LEN     (1U)
#define RF_PPU_PFD_HW_MSK     (((1U << RF_PPU_PFD_HW_LEN) - 1) << RF_PPU_PFD_HW_POS)
#define RF_PPU_PFD_HW_UMSK    (~(((1U << RF_PPU_PFD_HW_LEN) - 1) << RF_PPU_PFD_HW_POS))
#define RF_PPU_OSMX_HW        RF_PPU_OSMX_HW
#define RF_PPU_OSMX_HW_POS    (23U)
#define RF_PPU_OSMX_HW_LEN    (1U)
#define RF_PPU_OSMX_HW_MSK    (((1U << RF_PPU_OSMX_HW_LEN) - 1) << RF_PPU_OSMX_HW_POS)
#define RF_PPU_OSMX_HW_UMSK   (~(((1U << RF_PPU_OSMX_HW_LEN) - 1) << RF_PPU_OSMX_HW_POS))
#define RF_PPU_RXBUF_HW       RF_PPU_RXBUF_HW
#define RF_PPU_RXBUF_HW_POS   (24U)
#define RF_PPU_RXBUF_HW_LEN   (1U)
#define RF_PPU_RXBUF_HW_MSK   (((1U << RF_PPU_RXBUF_HW_LEN) - 1) << RF_PPU_RXBUF_HW_POS)
#define RF_PPU_RXBUF_HW_UMSK  (~(((1U << RF_PPU_RXBUF_HW_LEN) - 1) << RF_PPU_RXBUF_HW_POS))
#define RF_PPU_TXBUF_HW       RF_PPU_TXBUF_HW
#define RF_PPU_TXBUF_HW_POS   (25U)
#define RF_PPU_TXBUF_HW_LEN   (1U)
#define RF_PPU_TXBUF_HW_MSK   (((1U << RF_PPU_TXBUF_HW_LEN) - 1) << RF_PPU_TXBUF_HW_POS)
#define RF_PPU_TXBUF_HW_UMSK  (~(((1U << RF_PPU_TXBUF_HW_LEN) - 1) << RF_PPU_TXBUF_HW_POS))

/* 0x44 : pud_ctrl_hw */
#define RF_PUD_CTRL_HW_OFFSET (0x44)
#define RF_PUD_VCO_HW         RF_PUD_VCO_HW
#define RF_PUD_VCO_HW_POS     (20U)
#define RF_PUD_VCO_HW_LEN     (1U)
#define RF_PUD_VCO_HW_MSK     (((1U << RF_PUD_VCO_HW_LEN) - 1) << RF_PUD_VCO_HW_POS)
#define RF_PUD_VCO_HW_UMSK    (~(((1U << RF_PUD_VCO_HW_LEN) - 1) << RF_PUD_VCO_HW_POS))

