bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x48 : gain control1 */
#define RF_TRX_GAIN1_OFFSET  (0x48)
#define RF_GC_LNA            RF_GC_LNA
#define RF_GC_LNA_POS        (0U)
#define RF_GC_LNA_LEN        (3U)
#define RF_GC_LNA_MSK        (((1U << RF_GC_LNA_LEN) - 1) << RF_GC_LNA_POS)
#define RF_GC_LNA_UMSK       (~(((1U << RF_GC_LNA_LEN) - 1) << RF_GC_LNA_POS))
#define RF_GC_RMXGM          RF_GC_RMXGM
#define RF_GC_RMXGM_POS      (4U)
#define RF_GC_RMXGM_LEN      (2U)
#define RF_GC_RMXGM_MSK      (((1U << RF_GC_RMXGM_LEN) - 1) << RF_GC_RMXGM_POS)
#define RF_GC_RMXGM_UMSK     (~(((1U << RF_GC_RMXGM_LEN) - 1) << RF_GC_RMXGM_POS))
#define RF_GC_RBB1           RF_GC_RBB1
#define RF_GC_RBB1_POS       (8U)
#define RF_GC_RBB1_LEN       (2U)
#define RF_GC_RBB1_MSK       (((1U << RF_GC_RBB1_LEN) - 1) << RF_GC_RBB1_POS)
#define RF_GC_RBB1_UMSK      (~(((1U << RF_GC_RBB1_LEN) - 1) << RF_GC_RBB1_POS))
#define RF_GC_RBB2           RF_GC_RBB2
#define RF_GC_RBB2_POS       (12U)
#define RF_GC_RBB2_LEN       (3U)
#define RF_GC_RBB2_MSK       (((1U << RF_GC_RBB2_LEN) - 1) << RF_GC_RBB2_POS)
#define RF_GC_RBB2_UMSK      (~(((1U << RF_GC_RBB2_LEN) - 1) << RF_GC_RBB2_POS))
#define RF_GC_TMX            RF_GC_TMX
#define RF_GC_TMX_POS        (16U)
#define RF_GC_TMX_LEN        (3U)
#define RF_GC_TMX_MSK        (((1U << RF_GC_TMX_LEN) - 1) << RF_GC_TMX_POS)
#define RF_GC_TMX_UMSK       (~(((1U << RF_GC_TMX_LEN) - 1) << RF_GC_TMX_POS))
#define RF_GC_TBB            RF_GC_TBB
#define RF_GC_TBB_POS        (20U)
#define RF_GC_TBB_LEN        (5U)
#define RF_GC_TBB_MSK        (((1U << RF_GC_TBB_LEN) - 1) << RF_GC_TBB_POS)
#define RF_GC_TBB_UMSK       (~(((1U << RF_GC_TBB_LEN) - 1) << RF_GC_TBB_POS))
#define RF_GC_TBB_BOOST      RF_GC_TBB_BOOST
#define RF_GC_TBB_BOOST_POS  (28U)
#define RF_GC_TBB_BOOST_LEN  (2U)
#define RF_GC_TBB_BOOST_MSK  (((1U << RF_GC_TBB_BOOST_LEN) - 1) << RF_GC_TBB_BOOST_POS)
#define RF_GC_TBB_BOOST_UMSK (~(((1U << RF_GC_TBB_BOOST_LEN) - 1) << RF_GC_TBB_BOOST_POS))

/* 0x4C : trx gain hardware readback */
#define RF_TRX_GAIN_HW_OFFSET   (0x4C)
#define RF_GC_LNA_HW            RF_GC_LNA_HW
#define RF_GC_LNA_HW_POS        (0U)
#define RF_GC_LNA_HW_LEN        (3U)
#define RF_GC_LNA_HW_MSK        (((1U << RF_GC_LNA_HW_LEN) - 1) << RF_GC_LNA_HW_POS)
#define RF_GC_LNA_HW_UMSK       (~(((1U << RF_GC_LNA_HW_LEN) - 1) << RF_GC_LNA_HW_POS))
#define RF_GC_RMXGM_HW          RF_GC_RMXGM_HW
#define RF_GC_RMXGM_HW_POS      (4U)
#define RF_GC_RMXGM_HW_LEN      (2U)
#define RF_GC_RMXGM_HW_MSK      (((1U << RF_GC_RMXGM_HW_LEN) - 1) << RF_GC_RMXGM_HW_POS)
#define RF_GC_RMXGM_HW_UMSK     (~(((1U << RF_GC_RMXGM_HW_LEN) - 1) << RF_GC_RMXGM_HW_POS))
#define RF_GC_RBB1_HW           RF_GC_RBB1_HW
#define RF_GC_RBB1_HW_POS       (8U)
#define RF_GC_RBB1_HW_LEN       (2U)
#define RF_GC_RBB1_HW_MSK       (((1U << RF_GC_RBB1_HW_LEN) - 1) << RF_GC_RBB1_HW_POS)
#define RF_GC_RBB1_HW_UMSK      (~(((1U << RF_GC_RBB1_HW_LEN) - 1) << RF_GC_RBB1_HW_POS))
#define RF_GC_RBB2_HW           RF_GC_RBB2_HW
#define RF_GC_RBB2_HW_POS       (12U)
#define RF_GC_RBB2_HW_LEN       (3U)
#define RF_GC_RBB2_HW_MSK       (((1U << RF_GC_RBB2_HW_LEN) - 1) << RF_GC_RBB2_HW_POS)
#define RF_GC_RBB2_HW_UMSK      (~(((1U << RF_GC_RBB2_HW_LEN) - 1) << RF_GC_RBB2_HW_POS))
#define RF_GC_TMX_HW            RF_GC_TMX_HW
#define RF_GC_TMX_HW_POS        (16U)
#define RF_GC_TMX_HW_LEN        (3U)
#define RF_GC_TMX_HW_MSK        (((1U << RF_GC_TMX_HW_LEN) - 1) << RF_GC_TMX_HW_POS)
#define RF_GC_TMX_HW_UMSK       (~(((1U << RF_GC_TMX_HW_LEN) - 1) << RF_GC_TMX_HW_POS))
#define RF_GC_TBB_HW            RF_GC_TBB_HW
#define RF_GC_TBB_HW_POS        (20U)
#define RF_GC_TBB_HW_LEN        (5U)
#define RF_GC_TBB_HW_MSK        (((1U << RF_GC_TBB_HW_LEN) - 1) << RF_GC_TBB_HW_POS)
#define RF_GC_TBB_HW_UMSK       (~(((1U << RF_GC_TBB_HW_LEN) - 1) << RF_GC_TBB_HW_POS))
#define RF_GC_TBB_BOOST_HW      RF_GC_TBB_BOOST_HW
#define RF_GC_TBB_BOOST_HW_POS  (28U)
#define RF_GC_TBB_BOOST_HW_LEN  (2U)
#define RF_GC_TBB_BOOST_HW_MSK  (((1U << RF_GC_TBB_BOOST_HW_LEN) - 1) << RF_GC_TBB_BOOST_HW_POS)
#define RF_GC_TBB_BOOST_HW_UMSK (~(((1U << RF_GC_TBB_BOOST_HW_LEN) - 1) << RF_GC_TBB_BOOST_HW_POS))

/* 0x50 : dc test register */
#define RF_TEN_DC_OFFSET         (0x50)
#define RF_TMUX                  RF_TMUX
#define RF_TMUX_POS              (0U)
#define RF_TMUX_LEN              (3U)
#define RF_TMUX_MSK              (((1U << RF_TMUX_LEN) - 1) << RF_TMUX_POS)
#define RF_TMUX_UMSK             (~(((1U << RF_TMUX_LEN) - 1) << RF_TMUX_POS))
#define RF_DC_TP_EN              RF_DC_TP_EN
#define RF_DC_TP_EN_POS          (3U)
#define RF_DC_TP_EN_LEN          (1U)
#define RF_DC_TP_EN_MSK          (((1U << RF_DC_TP_EN_LEN) - 1) << RF_DC_TP_EN_POS)
#define RF_DC_TP_EN_UMSK         (~(((1U << RF_DC_TP_EN_LEN) - 1) << RF_DC_TP_EN_POS))
#define RF_DC_TP_CLKPLL_EN       RF_DC_TP_CLKPLL_EN
#define RF_DC_TP_CLKPLL_EN_POS   (4U)
#define RF_DC_TP_CLKPLL_EN_LEN   (1U)
#define RF_DC_TP_CLKPLL_EN_MSK   (((1U << RF_DC_TP_CLKPLL_EN_LEN) - 1) << RF_DC_TP_CLKPLL_EN_POS)
#define RF_DC_TP_CLKPLL_EN_UMSK  (~(((1U << RF_DC_TP_CLKPLL_EN_LEN) - 1) << RF_DC_TP_CLKPLL_EN_POS))
#define RF_TEN_CLKPLL            RF_TEN_CLKPLL
#define RF_TEN_CLKPLL_POS        (8U)
#define RF_TEN_CLKPLL_LEN        (1U)
#define RF_TEN_CLKPLL_MSK        (((1U << RF_TEN_CLKPLL_LEN) - 1) << RF_TEN_CLKPLL_POS)
#define RF_TEN_CLKPLL_UMSK       (~(((1U << RF_TEN_CLKPLL_LEN) - 1) << RF_TEN_CLKPLL_POS))
#define RF_TEN_CLKPLL_SFREG      RF_TEN_CLKPLL_SFREG
#define RF_TEN_CLKPLL_SFREG_POS  (9U)
#define RF_TEN_CLKPLL_SFREG_LEN  (1U)
#define RF_TEN_CLKPLL_SFREG_MSK  (((1U << RF_TEN_CLKPLL_SFREG_LEN) - 1) << RF_TEN_CLKPLL_SFREG_POS)
#define RF_TEN_CLKPLL_SFREG_UMSK (~(((1U << RF_TEN_CLKPLL_SFREG_LEN) - 1) << RF_TEN_CLKPLL_SFREG_POS))
#define RF_TEN_RRF_0             RF_TEN_RRF_0
#define RF_TEN_RRF_0_POS         (12U)
#define RF_TEN_RRF_0_LEN         (1U)
#define RF_TEN_RRF_0_MSK         (((1U << RF_TEN_RRF_0_LEN) - 1) << RF_TEN_RRF_0_POS)
#define RF_TEN_RRF_0_UMSK        (~(((1U << RF_TEN_RRF_0_LEN) - 1) << RF_TEN_RRF_0_POS))
#define RF_TEN_RRF_1             RF_TEN_RRF_1
#define RF_TEN_RRF_1_POS         (13U)
#define RF_TEN_RRF_1_LEN         (1U)
#define RF_TEN_RRF_1_MSK         (((1U << RF_TEN_RRF_1_LEN) - 1) << RF_TEN_RRF_1_POS)
#define RF_TEN_RRF_1_UMSK        (~(((1U << RF_TEN_RRF_1_LEN) - 1) << RF_TEN_RRF_1_POS))
#define RF_TEN_PA                RF_TEN_PA
#define RF_TEN_PA_POS            (14U)
#define RF_TEN_PA_LEN            (1U)
#define RF_TEN_PA_MSK            (((1U << RF_TEN_PA_LEN) - 1) << RF_TEN_PA_POS)
#define RF_TEN_PA_UMSK           (~(((1U << RF_TEN_PA_LEN) - 1) << RF_TEN_PA_POS))
#define RF_TEN_TMX               RF_TEN_TMX
#define RF_TEN_TMX_POS           (15U)
#define RF_TEN_TMX_LEN           (1U)
#define RF_TEN_TMX_MSK           (((1U << RF_TEN_TMX_LEN) - 1) << RF_TEN_TMX_POS)
#define RF_TEN_TMX_UMSK          (~(((1U << RF_TEN_TMX_LEN) - 1) << RF_TEN_TMX_POS))
#define RF_TEN_TIA               RF_TEN_TIA
#define RF_TEN_TIA_POS           (16U)
#define RF_TEN_TIA_LEN           (1U)
#define RF_TEN_TIA_MSK           (((1U << RF_TEN_TIA_LEN) - 1) << RF_TEN_TIA_POS)
#define RF_TEN_TIA_UMSK          (~(((1U << RF_TEN_TIA_LEN) - 1) << RF_TEN_TIA_POS))
#define RF_TEN_BQ                RF_TEN_BQ
#define RF_TEN_BQ_POS            (17U)
#define RF_TEN_BQ_LEN            (1U)
#define RF_TEN_BQ_MSK            (((1U << RF_TEN_BQ_LEN) - 1) << RF_TEN_BQ_POS)
#define RF_TEN_BQ_UMSK           (~(((1U << RF_TEN_BQ_LEN) - 1) << RF_TEN_BQ_POS))
#define RF_TEN_ATEST             RF_TEN_ATEST
#define RF_TEN_ATEST_POS         (18U)
#define RF_TEN_ATEST_LEN         (1U)
#define RF_TEN_ATEST_MSK         (((1U << RF_TEN_ATEST_LEN) - 1) << RF_TEN_ATEST_POS)
#define RF_TEN_ATEST_UMSK        (~(((1U << RF_TEN_ATEST_LEN) - 1) << RF_TEN_ATEST_POS))
#define RF_TEN_TBB               RF_TEN_TBB
#define RF_TEN_TBB_POS           (19U)
#define RF_TEN_TBB_LEN           (1U)
#define RF_TEN_TBB_MSK           (((1U << RF_TEN_TBB_LEN) - 1) << RF_TEN_TBB_POS)
#define RF_TEN_TBB_UMSK          (~(((1U << RF_TEN_TBB_LEN) - 1) << RF_TEN_TBB_POS))
#define RF_TEN_ADC               RF_TEN_ADC
#define RF_TEN_ADC_POS           (20U)
#define RF_TEN_ADC_LEN           (1U)
#define RF_TEN_ADC_MSK           (((1U << RF_TEN_ADC_LEN) - 1) << RF_TEN_ADC_POS)
#define RF_TEN_ADC_UMSK          (~(((1U << RF_TEN_ADC_LEN) - 1) << RF_TEN_ADC_POS))
#define RF_TEN_DAC_I             RF_TEN_DAC_I
#define RF_TEN_DAC_I_POS         (21U)
#define RF_TEN_DAC_I_LEN         (1U)
#define RF_TEN_DAC_I_MSK         (((1U << RF_TEN_DAC_I_LEN) - 1) << RF_TEN_DAC_I_POS)
#define RF_TEN_DAC_I_UMSK        (~(((1U << RF_TEN_DAC_I_LEN) - 1) << RF_TEN_DAC_I_POS))
#define RF_TEN_DAC_Q             RF_TEN_DAC_Q
#define RF_TEN_DAC_Q_POS         (22U)
#define RF_TEN_DAC_Q_LEN         (1U)
#define RF_TEN_DAC_Q_MSK         (((1U << RF_TEN_DAC_Q_LEN) - 1) << RF_TEN_DAC_Q_POS)
#define RF_TEN_DAC_Q_UMSK        (~(((1U << RF_TEN_DAC_Q_LEN) - 1) << RF_TEN_DAC_Q_POS))
#define RF_TEN_VCO               RF_TEN_VCO
#define RF_TEN_VCO_POS           (24U)
#define RF_TEN_VCO_LEN           (1U)
#define RF_TEN_VCO_MSK           (((1U << RF_TEN_VCO_LEN) - 1) << RF_TEN_VCO_POS)
#define RF_TEN_VCO_UMSK          (~(((1U << RF_TEN_VCO_LEN) - 1) << RF_TEN_VCO_POS))
#define RF_TEN_PFDCP             RF_TEN_PFDCP
#define RF_TEN_PFDCP_POS         (25U)
#define RF_TEN_PFDCP_LEN         (1U)
#define RF_TEN_PFDCP_MSK         (((1U << RF_TEN_PFDCP_LEN) - 1) << RF_TEN_PFDCP_POS)
#define RF_TEN_PFDCP_UMSK        (~(((1U << RF_TEN_PFDCP_LEN) - 1) << RF_TEN_PFDCP_POS))
#define RF_TEN_LF                RF_TEN_LF
#define RF_TEN_LF_POS            (26U)
#define RF_TEN_LF_LEN            (1U)
#define RF_TEN_LF_MSK            (((1U << RF_TEN_LF_LEN) - 1) << RF_TEN_LF_POS)
#define RF_TEN_LF_UMSK           (~(((1U << RF_TEN_LF_LEN) - 1) << RF_TEN_LF_POS))
#define RF_TEN_LODIST            RF_TEN_LODIST
#define RF_TEN_LODIST_POS        (27U)
#define RF_TEN_LODIST_LEN        (1U)
#define RF_TEN_LODIST_MSK        (((1U << RF_TEN_LODIST_LEN) - 1) << RF_TEN_LODIST_POS)
#define RF_TEN_LODIST_UMSK       (~(((1U << RF_TEN_LODIST_LEN) - 1) << RF_TEN_LODIST_POS))

/* 0x54 : digital test register */
#define RF_TEN_DIG_OFFSET               (0x54)
#define RF_DTEN_CLKPLL_POSTDIV_CLK      RF_DTEN_CLKPLL_POSTDIV_CLK
#define RF_DTEN_CLKPLL_POSTDIV_CLK_POS  (0U)
#define RF_DTEN_CLKPLL_POSTDIV_CLK_LEN  (1U)
#define RF_DTEN_CLKPLL_POSTDIV_CLK_MSK  (((1U << RF_DTEN_CLKPLL_POSTDIV_CLK_LEN) - 1) << RF_DTEN_CLKPLL_POSTDIV_CLK_POS)
#define RF_DTEN_CLKPLL_POSTDIV_CLK_UMSK (~(((1U << RF_DTEN_CLKPLL_POSTDIV_CLK_LEN) - 1) << RF_DTEN_CLKPLL_POSTDIV_CLK_POS))
#define RF_DTEN_CLKPLL_CLK96M           RF_DTEN_CLKPLL_CLK96M
#define RF_DTEN_CLKPLL_CLK96M_POS       (1U)
#define RF_DTEN_CLKPLL_CLK96M_LEN       (1U)
#define RF_DTEN_CLKPLL_CLK96M_MSK       (((1U << RF_DTEN_CLKPLL_CLK96M_LEN) - 1) << RF_DTEN_CLKPLL_CLK96M_POS)
#define RF_DTEN_CLKPLL_CLK96M_UMSK      (~(((1U << RF_DTEN_CLKPLL_CLK96M_LEN) - 1) << RF_DTEN_CLKPLL_CLK96M_POS))
#define RF_DTEN_CLKPLL_CLK32M           RF_DTEN_CLKPLL_CLK32M
#define RF_DTEN_CLKPLL_CLK32M_POS       (2U)
#define RF_DTEN_CLKPLL_CLK32M_LEN       (1U)
#define RF_DTEN_CLKPLL_CLK32M_MSK       (((1U << RF_DTEN_CLKPLL_CLK32M_LEN) - 1) << RF_DTEN_CLKPLL_CLK32M_POS)
#define RF_DTEN_CLKPLL_CLK32M_UMSK      (~(((1U << RF_DTEN_CLKPLL_CLK32M_LEN) - 1) << RF_DTEN_CLKPLL_CLK32M_POS))
#define RF_DTEN_CLKPLL_FSDM             RF_DTEN_CLKPLL_FSDM
#define RF_DTEN_CLKPLL_FSDM_POS         (3U)
#define RF_DTEN_CLKPLL_FSDM_LEN         (1U)
#define RF_DTEN_CLKPLL_FSDM_MSK         (((1U << RF_DTEN_CLKPLL_FSDM_LEN) - 1) << RF_DTEN_CLKPLL_FSDM_POS)
#define RF_DTEN_CLKPLL_FSDM_UMSK        (~(((1U << RF_DTEN_CLKPLL_FSDM_LEN) - 1) << RF_DTEN_CLKPLL_FSDM_POS))
#define RF_DTEN_CLKPLL_FREF             RF_DTEN_CLKPLL_FREF
#define RF_DTEN_CLKPLL_FREF_POS         (4U)
#define RF_DTEN_CLKPLL_FREF_LEN         (1U)
#define RF_DTEN_CLKPLL_FREF_MSK         (((1U << RF_DTEN_CLKPLL_FREF_LEN) - 1) << RF_DTEN_CLKPLL_FREF_POS)
#define RF_DTEN_CLKPLL_FREF_UMSK        (~(((1U << RF_DTEN_CLKPLL_FREF_LEN) - 1) << RF_DTEN_CLKPLL_FREF_POS))
#define RF_DTEN_CLKPLL_FIN              RF_DTEN_CLKPLL_FIN
#define RF_DTEN_CLKPLL_FIN_POS          (5U)
#define RF_DTEN_CLKPLL_FIN_LEN          (1U)
#define RF_DTEN_CLKPLL_FIN_MSK          (((1U << RF_DTEN_CLKPLL_FIN_LEN) - 1) << RF_DTEN_CLKPLL_FIN_POS)
#define RF_DTEN_CLKPLL_FIN_UMSK         (~(((1U << RF_DTEN_CLKPLL_FIN_LEN) - 1) << RF_DTEN_CLKPLL_FIN_POS))
#define RF_DTEN_LO_FSDM                 RF_DTEN_LO_FSDM
#define RF_DTEN_LO_FSDM_POS             (6U)
#define RF_DTEN_LO_FSDM_LEN             (1U)
#define RF_DTEN_LO_FSDM_MSK             (((1U << RF_DTEN_LO_FSDM_LEN) - 1) << RF_DTEN_LO_FSDM_POS)
#define RF_DTEN_LO_FSDM_UMSK            (~(((1U << RF_DTEN_LO_FSDM_LEN) - 1) << RF_DTEN_LO_FSDM_POS))
#define RF_DTEN_LO_FREF                 RF_DTEN_LO_FREF
#define RF_DTEN_LO_FREF_POS             (8U)
#define RF_DTEN_LO_FREF_LEN             (1U)
#define RF_DTEN_LO_FREF_MSK             (((1U << RF_DTEN_LO_FREF_LEN) - 1) << RF_DTEN_LO_FREF_POS)
#define RF_DTEN_LO_FREF_UMSK            (~(((1U << RF_DTEN_LO_FREF_LEN) - 1) << RF_DTEN_LO_FREF_POS))
#define RF_DTEST_PULL_DOWN              RF_DTEST_PULL_DOWN
#define RF_DTEST_PULL_DOWN_POS          (9U)
#define RF_DTEST_PULL_DOWN_LEN          (1U)
#define RF_DTEST_PULL_DOWN_MSK          (((1U << RF_DTEST_PULL_DOWN_LEN) - 1) << RF_DTEST_PULL_DOWN_POS)
#define RF_DTEST_PULL_DOWN_UMSK         (~(((1U << RF_DTEST_PULL_DOWN_LEN) - 1) << RF_DTEST_PULL_DOWN_POS))
#define RF_DTEST_EN                     RF_DTEST_EN
#define RF_DTEST_EN_POS                 (23U)
#define RF_DTEST_EN_LEN                 (1U)
#define RF_DTEST_EN_MSK                 (((1U << RF_DTEST_EN_LEN) - 1) << RF_DTEST_EN_POS)
#define RF_DTEST_EN_UMSK                (~(((1U << RF_DTEST_EN_LEN) - 1) << RF_DTEST_EN_POS))

/* 0x58 : ac test register */
#define RF_TEN_AC_OFFSET        (0x58)
#define RF_ATEST_OP_CC          RF_ATEST_OP_CC
#define RF_ATEST_OP_CC_POS      (0U)
#define RF_ATEST_OP_CC_LEN      (4U)
#define RF_ATEST_OP_CC_MSK      (((1U << RF_ATEST_OP_CC_LEN) - 1) << RF_ATEST_OP_CC_POS)
#define RF_ATEST_OP_CC_UMSK     (~(((1U << RF_ATEST_OP_CC_LEN) - 1) << RF_ATEST_OP_CC_POS))
#define RF_ATEST_DAC_EN         RF_ATEST_DAC_EN
#define RF_ATEST_DAC_EN_POS     (4U)
#define RF_ATEST_DAC_EN_LEN     (1U)
#define RF_ATEST_DAC_EN_MSK     (((1U << RF_ATEST_DAC_EN_LEN) - 1) << RF_ATEST_DAC_EN_POS)
#define RF_ATEST_DAC_EN_UMSK    (~(((1U << RF_ATEST_DAC_EN_LEN) - 1) << RF_ATEST_DAC_EN_POS))
#define RF_ATEST_IN_TRX_SW      RF_ATEST_IN_TRX_SW
#define RF_ATEST_IN_TRX_SW_POS  (5U)
#define RF_ATEST_IN_TRX_SW_LEN  (1U)
#define RF_ATEST_IN_TRX_SW_MSK  (((1U << RF_ATEST_IN_TRX_SW_LEN) - 1) << RF_ATEST_IN_TRX_SW_POS)
#define RF_ATEST_IN_TRX_SW_UMSK (~(((1U << RF_ATEST_IN_TRX_SW_LEN) - 1) << RF_ATEST_IN_TRX_SW_POS))
#define RF_ATEST_IN_EN          RF_ATEST_IN_EN
#define RF_ATEST_IN_EN_POS      (6U)
#define RF_ATEST_IN_EN_LEN      (1U)
#define RF_ATEST_IN_EN_MSK      (((1U << RF_ATEST_IN_EN_LEN) - 1) << RF_ATEST_IN_EN_POS)
#define RF_ATEST_IN_EN_UMSK     (~(((1U << RF_ATEST_IN_EN_LEN) - 1) << RF_ATEST_IN_EN_POS))
#define RF_ATEST_GAIN_R9        RF_ATEST_GAIN_R9
#define RF_ATEST_GAIN_R9_POS    (8U)
#define RF_ATEST_GAIN_R9_LEN    (2U)
#define RF_ATEST_GAIN_R9_MSK    (((1U << RF_ATEST_GAIN_R9_LEN) - 1) << RF_ATEST_GAIN_R9_POS)
#define RF_ATEST_GAIN_R9_UMSK   (~(((1U << RF_ATEST_GAIN_R9_LEN) - 1) << RF_ATEST_GAIN_R9_POS))
#define RF_ATEST_GAIN_R8        RF_ATEST_GAIN_R8
#define RF_ATEST_GAIN_R8_POS    (10U)
#define RF_ATEST_GAIN_R8_LEN    (2U)
#define RF_ATEST_GAIN_R8_MSK    (((1U << RF_ATEST_GAIN_R8_LEN) - 1) << RF_ATEST_GAIN_R8_POS)
#define RF_ATEST_GAIN_R8_UMSK   (~(((1U << RF_ATEST_GAIN_R8_LEN) - 1) << RF_ATEST_GAIN_R8_POS))
#define RF_ATEST_GAIN_R7        RF_ATEST_GAIN_R7
#define RF_ATEST_GAIN_R7_POS    (12U)
#define RF_ATEST_GAIN_R7_LEN    (2U)
#define RF_ATEST_GAIN_R7_MSK    (((1U << RF_ATEST_GAIN_R7_LEN) - 1) << RF_ATEST_GAIN_R7_POS)
#define RF_ATEST_GAIN_R7_UMSK   (~(((1U << RF_ATEST_GAIN_R7_LEN) - 1) << RF_ATEST_GAIN_R7_POS))
#define RF_ATEST_GAIN_R6        RF_ATEST_GAIN_R6
#define RF_ATEST_GAIN_R6_POS    (14U)
#define RF_ATEST_GAIN_R6_LEN    (2U)
#define RF_ATEST_GAIN_R6_MSK    (((1U << RF_ATEST_GAIN_R6_LEN) - 1) << RF_ATEST_GAIN_R6_POS)
#define RF_ATEST_GAIN_R6_UMSK   (~(((1U << RF_ATEST_GAIN_R6_LEN) - 1) << RF_ATEST_GAIN_R6_POS))
#define RF_ATEST_GAIN_R5        RF_ATEST_GAIN_R5
#define RF_ATEST_GAIN_R5_POS    (16U)
#define RF_ATEST_GAIN_R5_LEN    (3U)
#define RF_ATEST_GAIN_R5_MSK    (((1U << RF_ATEST_GAIN_R5_LEN) - 1) << RF_ATEST_GAIN_R5_POS)
#define RF_ATEST_GAIN_R5_UMSK   (~(((1U << RF_ATEST_GAIN_R5_LEN) - 1) << RF_ATEST_GAIN_R5_POS))
#define RF_ATEST_OUT_EN_Q       RF_ATEST_OUT_EN_Q
#define RF_ATEST_OUT_EN_Q_POS   (20U)
#define RF_ATEST_OUT_EN_Q_LEN   (1U)
#define RF_ATEST_OUT_EN_Q_MSK   (((1U << RF_ATEST_OUT_EN_Q_LEN) - 1) << RF_ATEST_OUT_EN_Q_POS)
#define RF_ATEST_OUT_EN_Q_UMSK  (~(((1U << RF_ATEST_OUT_EN_Q_LEN) - 1) << RF_ATEST_OUT_EN_Q_POS))
#define RF_ATEST_OUT_EN_I       RF_ATEST_OUT_EN_I
#define RF_ATEST_OUT_EN_I_POS   (21U)
#define RF_ATEST_OUT_EN_I_LEN   (1U)
#define RF_ATEST_OUT_EN_I_MSK   (((1U << RF_ATEST_OUT_EN_I_LEN) - 1) << RF_ATEST_OUT_EN_I_POS)
#define RF_ATEST_OUT_EN_I_UMSK  (~(((1U << RF_ATEST_OUT_EN_I_LEN) - 1) << RF_ATEST_OUT_EN_I_POS))
#define RF_ATEST_IN_EN_Q        RF_ATEST_IN_EN_Q
#define RF_ATEST_IN_EN_Q_POS    (22U)
#define RF_ATEST_IN_EN_Q_LEN    (1U)
#define RF_ATEST_IN_EN_Q_MSK    (((1U << RF_ATEST_IN_EN_Q_LEN) - 1) << RF_ATEST_IN_EN_Q_POS)
#define RF_ATEST_IN_EN_Q_UMSK   (~(((1U << RF_ATEST_IN_EN_Q_LEN) - 1) << RF_ATEST_IN_EN_Q_POS))
#define RF_ATEST_IN_EN_I        RF_ATEST_IN_EN_I
#define RF_ATEST_IN_EN_I_POS    (23U)
#define RF_ATEST_IN_EN_I_LEN    (1U)
#define RF_ATEST_IN_EN_I_MSK    (((1U << RF_ATEST_IN_EN_I_LEN) - 1) << RF_ATEST_IN_EN_I_POS)
#define RF_ATEST_IN_EN_I_UMSK   (~(((1U << RF_ATEST_IN_EN_I_LEN) - 1) << RF_ATEST_IN_EN_I_POS))

/* 0x5C : pmip_mv2aon */
#define RF_PMIP_MV2AON_OFFSET (0x5C)

/* 0x60 : RX normal bias mode registers */
#define RF_CIP_OFFSET    (0x60)
#define RF_VG11_SEL      RF_VG11_SEL
#define RF_VG11_SEL_POS  (0U)
#define RF_VG11_SEL_LEN  (2U)
#define RF_VG11_SEL_MSK  (((1U << RF_VG11_SEL_LEN) - 1) << RF_VG11_SEL_POS)
#define RF_VG11_SEL_UMSK (~(((1U << RF_VG11_SEL_LEN) - 1) << RF_VG11_SEL_POS))
#define RF_VG13_SEL      RF_VG13_SEL
#define RF_VG13_SEL_POS  (2U)
#define RF_VG13_SEL_LEN  (2U)
#define RF_VG13_SEL_MSK  (((1U << RF_VG13_SEL_LEN) - 1) << RF_VG13_SEL_POS)
#define RF_VG13_SEL_UMSK (~(((1U << RF_VG13_SEL_LEN) - 1) << RF_VG13_SEL_POS))

/* 0x64 : pa1 */
#define RF_PA1_OFFSET                  (0x64)
#define RF_PA_IAQ                      RF_PA_IAQ
#define RF_PA_IAQ_POS                  (0U)
#define RF_PA_IAQ_LEN                  (3U)
#define RF_PA_IAQ_MSK                  (((1U << RF_PA_IAQ_LEN) - 1) << RF_PA_IAQ_POS)
#define RF_PA_IAQ_UMSK                 (~(((1U << RF_PA_IAQ_LEN) - 1) << RF_PA_IAQ_POS))
#define RF_PA_ETB_EN                   RF_PA_ETB_EN
#define RF_PA_ETB_EN_POS               (3U)
#define RF_PA_ETB_EN_LEN               (1U)
#define RF_PA_ETB_EN_MSK               (((1U << RF_PA_ETB_EN_LEN) - 1) << RF_PA_ETB_EN_POS)
#define RF_PA_ETB_EN_UMSK              (~(((1U << RF_PA_ETB_EN_LEN) - 1) << RF_PA_ETB_EN_POS))
#define RF_PA_IET                      RF_PA_IET
#define RF_PA_IET_POS                  (4U)
#define RF_PA_IET_LEN                  (4U)
#define RF_PA_IET_MSK                  (((1U << RF_PA_IET_LEN) - 1) << RF_PA_IET_POS)
#define RF_PA_IET_UMSK                 (~(((1U << RF_PA_IET_LEN) - 1) << RF_PA_IET_POS))
#define RF_PA_VBCORE                   RF_PA_VBCORE
#define RF_PA_VBCORE_POS               (8U)
#define RF_PA_VBCORE_LEN               (4U)
#define RF_PA_VBCORE_MSK               (((1U << RF_PA_VBCORE_LEN) - 1) << RF_PA_VBCORE_POS)
#define RF_PA_VBCORE_UMSK              (~(((1U << RF_PA_VBCORE_LEN) - 1) << RF_PA_VBCORE_POS))
#define RF_PA_VBCAS                    RF_PA_VBCAS
#define RF_PA_VBCAS_POS                (12U)
#define RF_PA_VBCAS_LEN                (3U)
#define RF_PA_VBCAS_MSK                (((1U << RF_PA_VBCAS_LEN) - 1) << RF_PA_VBCAS_POS)
#define RF_PA_VBCAS_UMSK               (~(((1U << RF_PA_VBCAS_LEN) - 1) << RF_PA_VBCAS_POS))
#define RF_PA_HALF_ON                  RF_PA_HALF_ON
#define RF_PA_HALF_ON_POS              (15U)
#define RF_PA_HALF_ON_LEN              (1U)
#define RF_PA_HALF_ON_MSK              (((1U << RF_PA_HALF_ON_LEN) - 1) << RF_PA_HALF_ON_POS)
#define RF_PA_HALF_ON_UMSK             (~(((1U << RF_PA_HALF_ON_LEN) - 1) << RF_PA_HALF_ON_POS))
#define RF_PA_IB_FIX                   RF_PA_IB_FIX
#define RF_PA_IB_FIX_POS               (16U)
#define RF_PA_IB_FIX_LEN               (1U)
#define RF_PA_IB_FIX_MSK               (((1U << RF_PA_IB_FIX_LEN) - 1) << RF_PA_IB_FIX_POS)
#define RF_PA_IB_FIX_UMSK              (~(((1U << RF_PA_IB_FIX_LEN) - 1) << RF_PA_IB_FIX_POS))
#define RF_PA_LZ_BIAS_EN               RF_PA_LZ_BIAS_EN
#define RF_PA_LZ_BIAS_EN_POS           (17U)
#define RF_PA_LZ_BIAS_EN_LEN           (1U)
#define RF_PA_LZ_BIAS_EN_MSK           (((1U << RF_PA_LZ_BIAS_EN_LEN) - 1) << RF_PA_LZ_BIAS_EN_POS)
#define RF_PA_LZ_BIAS_EN_UMSK          (~(((1U << RF_PA_LZ_BIAS_EN_LEN) - 1) << RF_PA_LZ_BIAS_EN_POS))
#define RF_PA_PWRMX_OSDAC              RF_PA_PWRMX_OSDAC
#define RF_PA_PWRMX_OSDAC_POS          (18U)
#define RF_PA_PWRMX_OSDAC_LEN          (4U)
#define RF_PA_PWRMX_OSDAC_MSK          (((1U << RF_PA_PWRMX_OSDAC_LEN) - 1) << RF_PA_PWRMX_OSDAC_POS)
#define RF_PA_PWRMX_OSDAC_UMSK         (~(((1U << RF_PA_PWRMX_OSDAC_LEN) - 1) << RF_PA_PWRMX_OSDAC_POS))
#define RF_PA_PWRMX_DAC_PN_SWITCH      RF_PA_PWRMX_DAC_PN_SWITCH
#define RF_PA_PWRMX_DAC_PN_SWITCH_POS  (22U)
#define RF_PA_PWRMX_DAC_PN_SWITCH_LEN  (1U)
#define RF_PA_PWRMX_DAC_PN_SWITCH_MSK  (((1U << RF_PA_PWRMX_DAC_PN_SWITCH_LEN) - 1) << RF_PA_PWRMX_DAC_PN_SWITCH_POS)
#define RF_PA_PWRMX_DAC_PN_SWITCH_UMSK (~(((1U << RF_PA_PWRMX_DAC_PN_SWITCH_LEN) - 1) << RF_PA_PWRMX_DAC_PN_SWITCH_POS))
#define RF_PA_PWRMX_BM                 RF_PA_PWRMX_BM
#define RF_PA_PWRMX_BM_POS             (24U)
#define RF_PA_PWRMX_BM_LEN             (3U)
#define RF_PA_PWRMX_BM_MSK             (((1U << RF_PA_PWRMX_BM_LEN) - 1) << RF_PA_PWRMX_BM_POS)
#define RF_PA_PWRMX_BM_UMSK            (~(((1U << RF_PA_PWRMX_BM_LEN) - 1) << RF_PA_PWRMX_BM_POS))
#define RF_PA_ATT_GC                   RF_PA_ATT_GC
#define RF_PA_ATT_GC_POS               (28U)
#define RF_PA_ATT_GC_LEN               (4U)
#define RF_PA_ATT_GC_MSK               (((1U << RF_PA_ATT_GC_LEN) - 1) << RF_PA_ATT_GC_POS)
#define RF_PA_ATT_GC_UMSK              (~(((1U << RF_PA_ATT_GC_LEN) - 1) << RF_PA_ATT_GC_POS))

