bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x68 : RX normal bias mode registers */
#define RF_PA2_OFFSET         (0x68)
#define RF_PA_ETB_EN_HW       RF_PA_ETB_EN_HW
#define RF_PA_ETB_EN_HW_POS   (3U)
#define RF_PA_ETB_EN_HW_LEN   (1U)
#define RF_PA_ETB_EN_HW_MSK   (((1U << RF_PA_ETB_EN_HW_LEN) - 1) << RF_PA_ETB_EN_HW_POS)
#define RF_PA_ETB_EN_HW_UMSK  (~(((1U << RF_PA_ETB_EN_HW_LEN) - 1) << RF_PA_ETB_EN_HW_POS))
#define RF_PA_IET_HW          RF_PA_IET_HW
#define RF_PA_IET_HW_POS      (4U)
#define RF_PA_IET_HW_LEN      (4U)
#define RF_PA_IET_HW_MSK      (((1U << RF_PA_IET_HW_LEN) - 1) << RF_PA_IET_HW_POS)
#define RF_PA_IET_HW_UMSK     (~(((1U << RF_PA_IET_HW_LEN) - 1) << RF_PA_IET_HW_POS))
#define RF_PA_VBCORE_HW       RF_PA_VBCORE_HW
#define RF_PA_VBCORE_HW_POS   (8U)
#define RF_PA_VBCORE_HW_LEN   (4U)
#define RF_PA_VBCORE_HW_MSK   (((1U << RF_PA_VBCORE_HW_LEN) - 1) << RF_PA_VBCORE_HW_POS)
#define RF_PA_VBCORE_HW_UMSK  (~(((1U << RF_PA_VBCORE_HW_LEN) - 1) << RF_PA_VBCORE_HW_POS))
#define RF_PA_VBCAS_HW        RF_PA_VBCAS_HW
#define RF_PA_VBCAS_HW_POS    (12U)
#define RF_PA_VBCAS_HW_LEN    (3U)
#define RF_PA_VBCAS_HW_MSK    (((1U << RF_PA_VBCAS_HW_LEN) - 1) << RF_PA_VBCAS_HW_POS)
#define RF_PA_VBCAS_HW_UMSK   (~(((1U << RF_PA_VBCAS_HW_LEN) - 1) << RF_PA_VBCAS_HW_POS))
#define RF_PA_HALF_ON_HW      RF_PA_HALF_ON_HW
#define RF_PA_HALF_ON_HW_POS  (16U)
#define RF_PA_HALF_ON_HW_LEN  (1U)
#define RF_PA_HALF_ON_HW_MSK  (((1U << RF_PA_HALF_ON_HW_LEN) - 1) << RF_PA_HALF_ON_HW_POS)
#define RF_PA_HALF_ON_HW_UMSK (~(((1U << RF_PA_HALF_ON_HW_LEN) - 1) << RF_PA_HALF_ON_HW_POS))
#define RF_PA_IB_FIX_HW       RF_PA_IB_FIX_HW
#define RF_PA_IB_FIX_HW_POS   (17U)
#define RF_PA_IB_FIX_HW_LEN   (1U)
#define RF_PA_IB_FIX_HW_MSK   (((1U << RF_PA_IB_FIX_HW_LEN) - 1) << RF_PA_IB_FIX_HW_POS)
#define RF_PA_IB_FIX_HW_UMSK  (~(((1U << RF_PA_IB_FIX_HW_LEN) - 1) << RF_PA_IB_FIX_HW_POS))

/* 0x6C : tmx */
#define RF_TMX_OFFSET           (0x6C)
#define RF_TMX_CS               RF_TMX_CS
#define RF_TMX_CS_POS           (0U)
#define RF_TMX_CS_LEN           (3U)
#define RF_TMX_CS_MSK           (((1U << RF_TMX_CS_LEN) - 1) << RF_TMX_CS_POS)
#define RF_TMX_CS_UMSK          (~(((1U << RF_TMX_CS_LEN) - 1) << RF_TMX_CS_POS))
#define RF_TMX_BM_SW            RF_TMX_BM_SW
#define RF_TMX_BM_SW_POS        (4U)
#define RF_TMX_BM_SW_LEN        (3U)
#define RF_TMX_BM_SW_MSK        (((1U << RF_TMX_BM_SW_LEN) - 1) << RF_TMX_BM_SW_POS)
#define RF_TMX_BM_SW_UMSK       (~(((1U << RF_TMX_BM_SW_LEN) - 1) << RF_TMX_BM_SW_POS))
#define RF_TMX_BM_CAS           RF_TMX_BM_CAS
#define RF_TMX_BM_CAS_POS       (8U)
#define RF_TMX_BM_CAS_LEN       (3U)
#define RF_TMX_BM_CAS_MSK       (((1U << RF_TMX_BM_CAS_LEN) - 1) << RF_TMX_BM_CAS_POS)
#define RF_TMX_BM_CAS_UMSK      (~(((1U << RF_TMX_BM_CAS_LEN) - 1) << RF_TMX_BM_CAS_POS))
#define RF_TMX_BM_CAS_BULK      RF_TMX_BM_CAS_BULK
#define RF_TMX_BM_CAS_BULK_POS  (12U)
#define RF_TMX_BM_CAS_BULK_LEN  (3U)
#define RF_TMX_BM_CAS_BULK_MSK  (((1U << RF_TMX_BM_CAS_BULK_LEN) - 1) << RF_TMX_BM_CAS_BULK_POS)
#define RF_TMX_BM_CAS_BULK_UMSK (~(((1U << RF_TMX_BM_CAS_BULK_LEN) - 1) << RF_TMX_BM_CAS_BULK_POS))
#define RF_TX_TSENSE_EN         RF_TX_TSENSE_EN
#define RF_TX_TSENSE_EN_POS     (16U)
#define RF_TX_TSENSE_EN_LEN     (1U)
#define RF_TX_TSENSE_EN_MSK     (((1U << RF_TX_TSENSE_EN_LEN) - 1) << RF_TX_TSENSE_EN_POS)
#define RF_TX_TSENSE_EN_UMSK    (~(((1U << RF_TX_TSENSE_EN_LEN) - 1) << RF_TX_TSENSE_EN_POS))

/* 0x70 : tbb */
#define RF_TBB_OFFSET             (0x70)
#define RF_TBB_BM_SF              RF_TBB_BM_SF
#define RF_TBB_BM_SF_POS          (0U)
#define RF_TBB_BM_SF_LEN          (2U)
#define RF_TBB_BM_SF_MSK          (((1U << RF_TBB_BM_SF_LEN) - 1) << RF_TBB_BM_SF_POS)
#define RF_TBB_BM_SF_UMSK         (~(((1U << RF_TBB_BM_SF_LEN) - 1) << RF_TBB_BM_SF_POS))
#define RF_TBB_BM_CG              RF_TBB_BM_CG
#define RF_TBB_BM_CG_POS          (4U)
#define RF_TBB_BM_CG_LEN          (2U)
#define RF_TBB_BM_CG_MSK          (((1U << RF_TBB_BM_CG_LEN) - 1) << RF_TBB_BM_CG_POS)
#define RF_TBB_BM_CG_UMSK         (~(((1U << RF_TBB_BM_CG_LEN) - 1) << RF_TBB_BM_CG_POS))
#define RF_TBB_VCM                RF_TBB_VCM
#define RF_TBB_VCM_POS            (8U)
#define RF_TBB_VCM_LEN            (2U)
#define RF_TBB_VCM_MSK            (((1U << RF_TBB_VCM_LEN) - 1) << RF_TBB_VCM_POS)
#define RF_TBB_VCM_UMSK           (~(((1U << RF_TBB_VCM_LEN) - 1) << RF_TBB_VCM_POS))
#define RF_TBB_CFLT               RF_TBB_CFLT
#define RF_TBB_CFLT_POS           (12U)
#define RF_TBB_CFLT_LEN           (2U)
#define RF_TBB_CFLT_MSK           (((1U << RF_TBB_CFLT_LEN) - 1) << RF_TBB_CFLT_POS)
#define RF_TBB_CFLT_UMSK          (~(((1U << RF_TBB_CFLT_LEN) - 1) << RF_TBB_CFLT_POS))
#define RF_TBB_IQ_BIAS_SHORT      RF_TBB_IQ_BIAS_SHORT
#define RF_TBB_IQ_BIAS_SHORT_POS  (14U)
#define RF_TBB_IQ_BIAS_SHORT_LEN  (1U)
#define RF_TBB_IQ_BIAS_SHORT_MSK  (((1U << RF_TBB_IQ_BIAS_SHORT_LEN) - 1) << RF_TBB_IQ_BIAS_SHORT_POS)
#define RF_TBB_IQ_BIAS_SHORT_UMSK (~(((1U << RF_TBB_IQ_BIAS_SHORT_LEN) - 1) << RF_TBB_IQ_BIAS_SHORT_POS))
#define RF_TBB_ATEST_OUT_EN       RF_TBB_ATEST_OUT_EN
#define RF_TBB_ATEST_OUT_EN_POS   (15U)
#define RF_TBB_ATEST_OUT_EN_LEN   (1U)
#define RF_TBB_ATEST_OUT_EN_MSK   (((1U << RF_TBB_ATEST_OUT_EN_LEN) - 1) << RF_TBB_ATEST_OUT_EN_POS)
#define RF_TBB_ATEST_OUT_EN_UMSK  (~(((1U << RF_TBB_ATEST_OUT_EN_LEN) - 1) << RF_TBB_ATEST_OUT_EN_POS))
#define RF_TBB_TOSDAC_Q           RF_TBB_TOSDAC_Q
#define RF_TBB_TOSDAC_Q_POS       (16U)
#define RF_TBB_TOSDAC_Q_LEN       (6U)
#define RF_TBB_TOSDAC_Q_MSK       (((1U << RF_TBB_TOSDAC_Q_LEN) - 1) << RF_TBB_TOSDAC_Q_POS)
#define RF_TBB_TOSDAC_Q_UMSK      (~(((1U << RF_TBB_TOSDAC_Q_LEN) - 1) << RF_TBB_TOSDAC_Q_POS))
#define RF_TBB_TOSDAC_I           RF_TBB_TOSDAC_I
#define RF_TBB_TOSDAC_I_POS       (24U)
#define RF_TBB_TOSDAC_I_LEN       (6U)
#define RF_TBB_TOSDAC_I_MSK       (((1U << RF_TBB_TOSDAC_I_LEN) - 1) << RF_TBB_TOSDAC_I_POS)
#define RF_TBB_TOSDAC_I_UMSK      (~(((1U << RF_TBB_TOSDAC_I_LEN) - 1) << RF_TBB_TOSDAC_I_POS))

/* 0x74 : lna */
#define RF_LNA_OFFSET           (0x74)
#define RF_LNA_BM               RF_LNA_BM
#define RF_LNA_BM_POS           (0U)
#define RF_LNA_BM_LEN           (4U)
#define RF_LNA_BM_MSK           (((1U << RF_LNA_BM_LEN) - 1) << RF_LNA_BM_POS)
#define RF_LNA_BM_UMSK          (~(((1U << RF_LNA_BM_LEN) - 1) << RF_LNA_BM_POS))
#define RF_LNA_BM_HW            RF_LNA_BM_HW
#define RF_LNA_BM_HW_POS        (4U)
#define RF_LNA_BM_HW_LEN        (4U)
#define RF_LNA_BM_HW_MSK        (((1U << RF_LNA_BM_HW_LEN) - 1) << RF_LNA_BM_HW_POS)
#define RF_LNA_BM_HW_UMSK       (~(((1U << RF_LNA_BM_HW_LEN) - 1) << RF_LNA_BM_HW_POS))
#define RF_LNA_LOAD_CSW         RF_LNA_LOAD_CSW
#define RF_LNA_LOAD_CSW_POS     (8U)
#define RF_LNA_LOAD_CSW_LEN     (4U)
#define RF_LNA_LOAD_CSW_MSK     (((1U << RF_LNA_LOAD_CSW_LEN) - 1) << RF_LNA_LOAD_CSW_POS)
#define RF_LNA_LOAD_CSW_UMSK    (~(((1U << RF_LNA_LOAD_CSW_LEN) - 1) << RF_LNA_LOAD_CSW_POS))
#define RF_LNA_LOAD_CSW_HW      RF_LNA_LOAD_CSW_HW
#define RF_LNA_LOAD_CSW_HW_POS  (12U)
#define RF_LNA_LOAD_CSW_HW_LEN  (4U)
#define RF_LNA_LOAD_CSW_HW_MSK  (((1U << RF_LNA_LOAD_CSW_HW_LEN) - 1) << RF_LNA_LOAD_CSW_HW_POS)
#define RF_LNA_LOAD_CSW_HW_UMSK (~(((1U << RF_LNA_LOAD_CSW_HW_LEN) - 1) << RF_LNA_LOAD_CSW_HW_POS))
#define RF_LNA_RFB_MATCH        RF_LNA_RFB_MATCH
#define RF_LNA_RFB_MATCH_POS    (16U)
#define RF_LNA_RFB_MATCH_LEN    (3U)
#define RF_LNA_RFB_MATCH_MSK    (((1U << RF_LNA_RFB_MATCH_LEN) - 1) << RF_LNA_RFB_MATCH_POS)
#define RF_LNA_RFB_MATCH_UMSK   (~(((1U << RF_LNA_RFB_MATCH_LEN) - 1) << RF_LNA_RFB_MATCH_POS))
#define RF_LNA_CAP_LG           RF_LNA_CAP_LG
#define RF_LNA_CAP_LG_POS       (20U)
#define RF_LNA_CAP_LG_LEN       (2U)
#define RF_LNA_CAP_LG_MSK       (((1U << RF_LNA_CAP_LG_LEN) - 1) << RF_LNA_CAP_LG_POS)
#define RF_LNA_CAP_LG_UMSK      (~(((1U << RF_LNA_CAP_LG_LEN) - 1) << RF_LNA_CAP_LG_POS))
#define RF_LNA_LG_GSEL          RF_LNA_LG_GSEL
#define RF_LNA_LG_GSEL_POS      (24U)
#define RF_LNA_LG_GSEL_LEN      (3U)
#define RF_LNA_LG_GSEL_MSK      (((1U << RF_LNA_LG_GSEL_LEN) - 1) << RF_LNA_LG_GSEL_POS)
#define RF_LNA_LG_GSEL_UMSK     (~(((1U << RF_LNA_LG_GSEL_LEN) - 1) << RF_LNA_LG_GSEL_POS))

/* 0x78 : rmxgm */
#define RF_RMXGM_OFFSET           (0x78)
#define RF_RMX_BM                 RF_RMX_BM
#define RF_RMX_BM_POS             (0U)
#define RF_RMX_BM_LEN             (3U)
#define RF_RMX_BM_MSK             (((1U << RF_RMX_BM_LEN) - 1) << RF_RMX_BM_POS)
#define RF_RMX_BM_UMSK            (~(((1U << RF_RMX_BM_LEN) - 1) << RF_RMX_BM_POS))
#define RF_RMXGM_BM               RF_RMXGM_BM
#define RF_RMXGM_BM_POS           (4U)
#define RF_RMXGM_BM_LEN           (3U)
#define RF_RMXGM_BM_MSK           (((1U << RF_RMXGM_BM_LEN) - 1) << RF_RMXGM_BM_POS)
#define RF_RMXGM_BM_UMSK          (~(((1U << RF_RMXGM_BM_LEN) - 1) << RF_RMXGM_BM_POS))
#define RF_RMXGM_10M_MODE_EN      RF_RMXGM_10M_MODE_EN
#define RF_RMXGM_10M_MODE_EN_POS  (8U)
#define RF_RMXGM_10M_MODE_EN_LEN  (1U)
#define RF_RMXGM_10M_MODE_EN_MSK  (((1U << RF_RMXGM_10M_MODE_EN_LEN) - 1) << RF_RMXGM_10M_MODE_EN_POS)
#define RF_RMXGM_10M_MODE_EN_UMSK (~(((1U << RF_RMXGM_10M_MODE_EN_LEN) - 1) << RF_RMXGM_10M_MODE_EN_POS))

