bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x7C : rbb1 */
#define RF_RBB1_OFFSET       (0x7C)
#define RF_ROSDAC_Q          RF_ROSDAC_Q
#define RF_ROSDAC_Q_POS      (0U)
#define RF_ROSDAC_Q_LEN      (6U)
#define RF_ROSDAC_Q_MSK      (((1U << RF_ROSDAC_Q_LEN) - 1) << RF_ROSDAC_Q_POS)
#define RF_ROSDAC_Q_UMSK     (~(((1U << RF_ROSDAC_Q_LEN) - 1) << RF_ROSDAC_Q_POS))
#define RF_ROSDAC_I          RF_ROSDAC_I
#define RF_ROSDAC_I_POS      (8U)
#define RF_ROSDAC_I_LEN      (6U)
#define RF_ROSDAC_I_MSK      (((1U << RF_ROSDAC_I_LEN) - 1) << RF_ROSDAC_I_POS)
#define RF_ROSDAC_I_UMSK     (~(((1U << RF_ROSDAC_I_LEN) - 1) << RF_ROSDAC_I_POS))
#define RF_ROSDAC_Q_HW       RF_ROSDAC_Q_HW
#define RF_ROSDAC_Q_HW_POS   (16U)
#define RF_ROSDAC_Q_HW_LEN   (6U)
#define RF_ROSDAC_Q_HW_MSK   (((1U << RF_ROSDAC_Q_HW_LEN) - 1) << RF_ROSDAC_Q_HW_POS)
#define RF_ROSDAC_Q_HW_UMSK  (~(((1U << RF_ROSDAC_Q_HW_LEN) - 1) << RF_ROSDAC_Q_HW_POS))
#define RF_ROSDAC_I_HW       RF_ROSDAC_I_HW
#define RF_ROSDAC_I_HW_POS   (24U)
#define RF_ROSDAC_I_HW_LEN   (6U)
#define RF_ROSDAC_I_HW_MSK   (((1U << RF_ROSDAC_I_HW_LEN) - 1) << RF_ROSDAC_I_HW_POS)
#define RF_ROSDAC_I_HW_UMSK  (~(((1U << RF_ROSDAC_I_HW_LEN) - 1) << RF_ROSDAC_I_HW_POS))
#define RF_ROSDAC_RANGE      RF_ROSDAC_RANGE
#define RF_ROSDAC_RANGE_POS  (31U)
#define RF_ROSDAC_RANGE_LEN  (1U)
#define RF_ROSDAC_RANGE_MSK  (((1U << RF_ROSDAC_RANGE_LEN) - 1) << RF_ROSDAC_RANGE_POS)
#define RF_ROSDAC_RANGE_UMSK (~(((1U << RF_ROSDAC_RANGE_LEN) - 1) << RF_ROSDAC_RANGE_POS))

/* 0x80 : rbb2 */
#define RF_RBB2_OFFSET        (0x80)
#define RF_RBB_CAP2_FC_Q      RF_RBB_CAP2_FC_Q
#define RF_RBB_CAP2_FC_Q_POS  (0U)
#define RF_RBB_CAP2_FC_Q_LEN  (6U)
#define RF_RBB_CAP2_FC_Q_MSK  (((1U << RF_RBB_CAP2_FC_Q_LEN) - 1) << RF_RBB_CAP2_FC_Q_POS)
#define RF_RBB_CAP2_FC_Q_UMSK (~(((1U << RF_RBB_CAP2_FC_Q_LEN) - 1) << RF_RBB_CAP2_FC_Q_POS))
#define RF_RBB_CAP2_FC_I      RF_RBB_CAP2_FC_I
#define RF_RBB_CAP2_FC_I_POS  (8U)
#define RF_RBB_CAP2_FC_I_LEN  (6U)
#define RF_RBB_CAP2_FC_I_MSK  (((1U << RF_RBB_CAP2_FC_I_LEN) - 1) << RF_RBB_CAP2_FC_I_POS)
#define RF_RBB_CAP2_FC_I_UMSK (~(((1U << RF_RBB_CAP2_FC_I_LEN) - 1) << RF_RBB_CAP2_FC_I_POS))
#define RF_RBB_CAP1_FC_Q      RF_RBB_CAP1_FC_Q
#define RF_RBB_CAP1_FC_Q_POS  (16U)
#define RF_RBB_CAP1_FC_Q_LEN  (6U)
#define RF_RBB_CAP1_FC_Q_MSK  (((1U << RF_RBB_CAP1_FC_Q_LEN) - 1) << RF_RBB_CAP1_FC_Q_POS)
#define RF_RBB_CAP1_FC_Q_UMSK (~(((1U << RF_RBB_CAP1_FC_Q_LEN) - 1) << RF_RBB_CAP1_FC_Q_POS))
#define RF_RBB_CAP1_FC_I      RF_RBB_CAP1_FC_I
#define RF_RBB_CAP1_FC_I_POS  (24U)
#define RF_RBB_CAP1_FC_I_LEN  (6U)
#define RF_RBB_CAP1_FC_I_MSK  (((1U << RF_RBB_CAP1_FC_I_LEN) - 1) << RF_RBB_CAP1_FC_I_POS)
#define RF_RBB_CAP1_FC_I_UMSK (~(((1U << RF_RBB_CAP1_FC_I_LEN) - 1) << RF_RBB_CAP1_FC_I_POS))

/* 0x84 : rbb3 */
#define RF_RBB3_OFFSET               (0x84)
#define RF_RBB_BT_MODE_HW            RF_RBB_BT_MODE_HW
#define RF_RBB_BT_MODE_HW_POS        (0U)
#define RF_RBB_BT_MODE_HW_LEN        (1U)
#define RF_RBB_BT_MODE_HW_MSK        (((1U << RF_RBB_BT_MODE_HW_LEN) - 1) << RF_RBB_BT_MODE_HW_POS)
#define RF_RBB_BT_MODE_HW_UMSK       (~(((1U << RF_RBB_BT_MODE_HW_LEN) - 1) << RF_RBB_BT_MODE_HW_POS))
#define RF_RBB_BT_MODE               RF_RBB_BT_MODE
#define RF_RBB_BT_MODE_POS           (4U)
#define RF_RBB_BT_MODE_LEN           (1U)
#define RF_RBB_BT_MODE_MSK           (((1U << RF_RBB_BT_MODE_LEN) - 1) << RF_RBB_BT_MODE_POS)
#define RF_RBB_BT_MODE_UMSK          (~(((1U << RF_RBB_BT_MODE_LEN) - 1) << RF_RBB_BT_MODE_POS))
#define RF_RBB_BT_FIF_TUNE           RF_RBB_BT_FIF_TUNE
#define RF_RBB_BT_FIF_TUNE_POS       (5U)
#define RF_RBB_BT_FIF_TUNE_LEN       (2U)
#define RF_RBB_BT_FIF_TUNE_MSK       (((1U << RF_RBB_BT_FIF_TUNE_LEN) - 1) << RF_RBB_BT_FIF_TUNE_POS)
#define RF_RBB_BT_FIF_TUNE_UMSK      (~(((1U << RF_RBB_BT_FIF_TUNE_LEN) - 1) << RF_RBB_BT_FIF_TUNE_POS))
#define RF_RBB_DEQ                   RF_RBB_DEQ
#define RF_RBB_DEQ_POS               (8U)
#define RF_RBB_DEQ_LEN               (2U)
#define RF_RBB_DEQ_MSK               (((1U << RF_RBB_DEQ_LEN) - 1) << RF_RBB_DEQ_POS)
#define RF_RBB_DEQ_UMSK              (~(((1U << RF_RBB_DEQ_LEN) - 1) << RF_RBB_DEQ_POS))
#define RF_RBB_BM_OP                 RF_RBB_BM_OP
#define RF_RBB_BM_OP_POS             (12U)
#define RF_RBB_BM_OP_LEN             (3U)
#define RF_RBB_BM_OP_MSK             (((1U << RF_RBB_BM_OP_LEN) - 1) << RF_RBB_BM_OP_POS)
#define RF_RBB_BM_OP_UMSK            (~(((1U << RF_RBB_BM_OP_LEN) - 1) << RF_RBB_BM_OP_POS))
#define RF_RBB_VCM                   RF_RBB_VCM
#define RF_RBB_VCM_POS               (16U)
#define RF_RBB_VCM_LEN               (2U)
#define RF_RBB_VCM_MSK               (((1U << RF_RBB_VCM_LEN) - 1) << RF_RBB_VCM_POS)
#define RF_RBB_VCM_UMSK              (~(((1U << RF_RBB_VCM_LEN) - 1) << RF_RBB_VCM_POS))
#define RF_RBB_BQ_IQBIAS_SHORT       RF_RBB_BQ_IQBIAS_SHORT
#define RF_RBB_BQ_IQBIAS_SHORT_POS   (20U)
#define RF_RBB_BQ_IQBIAS_SHORT_LEN   (1U)
#define RF_RBB_BQ_IQBIAS_SHORT_MSK   (((1U << RF_RBB_BQ_IQBIAS_SHORT_LEN) - 1) << RF_RBB_BQ_IQBIAS_SHORT_POS)
#define RF_RBB_BQ_IQBIAS_SHORT_UMSK  (~(((1U << RF_RBB_BQ_IQBIAS_SHORT_LEN) - 1) << RF_RBB_BQ_IQBIAS_SHORT_POS))
#define RF_RBB_TIA_IQBIAS_SHORT      RF_RBB_TIA_IQBIAS_SHORT
#define RF_RBB_TIA_IQBIAS_SHORT_POS  (21U)
#define RF_RBB_TIA_IQBIAS_SHORT_LEN  (1U)
#define RF_RBB_TIA_IQBIAS_SHORT_MSK  (((1U << RF_RBB_TIA_IQBIAS_SHORT_LEN) - 1) << RF_RBB_TIA_IQBIAS_SHORT_POS)
#define RF_RBB_TIA_IQBIAS_SHORT_UMSK (~(((1U << RF_RBB_TIA_IQBIAS_SHORT_LEN) - 1) << RF_RBB_TIA_IQBIAS_SHORT_POS))
#define RF_RBB_BW                    RF_RBB_BW
#define RF_RBB_BW_POS                (24U)
#define RF_RBB_BW_LEN                (2U)
#define RF_RBB_BW_MSK                (((1U << RF_RBB_BW_LEN) - 1) << RF_RBB_BW_POS)
#define RF_RBB_BW_UMSK               (~(((1U << RF_RBB_BW_LEN) - 1) << RF_RBB_BW_POS))
#define RF_RXIQCAL_EN                RF_RXIQCAL_EN
#define RF_RXIQCAL_EN_POS            (28U)
#define RF_RXIQCAL_EN_LEN            (1U)
#define RF_RXIQCAL_EN_MSK            (((1U << RF_RXIQCAL_EN_LEN) - 1) << RF_RXIQCAL_EN_POS)
#define RF_RXIQCAL_EN_UMSK           (~(((1U << RF_RXIQCAL_EN_LEN) - 1) << RF_RXIQCAL_EN_POS))
#define RF_PWR_DET_EN                RF_PWR_DET_EN
#define RF_PWR_DET_EN_POS            (31U)
#define RF_PWR_DET_EN_LEN            (1U)
#define RF_PWR_DET_EN_MSK            (((1U << RF_PWR_DET_EN_LEN) - 1) << RF_PWR_DET_EN_POS)
#define RF_PWR_DET_EN_UMSK           (~(((1U << RF_PWR_DET_EN_LEN) - 1) << RF_PWR_DET_EN_POS))

