bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x88 : rbb4 */
#define RF_RBB4_OFFSET                (0x88)
#define RF_RBB_PKDET_VTH              RF_RBB_PKDET_VTH
#define RF_RBB_PKDET_VTH_POS          (0U)
#define RF_RBB_PKDET_VTH_LEN          (4U)
#define RF_RBB_PKDET_VTH_MSK          (((1U << RF_RBB_PKDET_VTH_LEN) - 1) << RF_RBB_PKDET_VTH_POS)
#define RF_RBB_PKDET_VTH_UMSK         (~(((1U << RF_RBB_PKDET_VTH_LEN) - 1) << RF_RBB_PKDET_VTH_POS))
#define RF_RBB_PKDET_OUT_RSTN         RF_RBB_PKDET_OUT_RSTN
#define RF_RBB_PKDET_OUT_RSTN_POS     (4U)
#define RF_RBB_PKDET_OUT_RSTN_LEN     (1U)
#define RF_RBB_PKDET_OUT_RSTN_MSK     (((1U << RF_RBB_PKDET_OUT_RSTN_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_POS)
#define RF_RBB_PKDET_OUT_RSTN_UMSK    (~(((1U << RF_RBB_PKDET_OUT_RSTN_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_POS))
#define RF_RBB_PKDET_EN               RF_RBB_PKDET_EN
#define RF_RBB_PKDET_EN_POS           (8U)
#define RF_RBB_PKDET_EN_LEN           (1U)
#define RF_RBB_PKDET_EN_MSK           (((1U << RF_RBB_PKDET_EN_LEN) - 1) << RF_RBB_PKDET_EN_POS)
#define RF_RBB_PKDET_EN_UMSK          (~(((1U << RF_RBB_PKDET_EN_LEN) - 1) << RF_RBB_PKDET_EN_POS))
#define RF_RBB_PKDET_OUT_RSTN_HW      RF_RBB_PKDET_OUT_RSTN_HW
#define RF_RBB_PKDET_OUT_RSTN_HW_POS  (12U)
#define RF_RBB_PKDET_OUT_RSTN_HW_LEN  (1U)
#define RF_RBB_PKDET_OUT_RSTN_HW_MSK  (((1U << RF_RBB_PKDET_OUT_RSTN_HW_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_HW_POS)
#define RF_RBB_PKDET_OUT_RSTN_HW_UMSK (~(((1U << RF_RBB_PKDET_OUT_RSTN_HW_LEN) - 1) << RF_RBB_PKDET_OUT_RSTN_HW_POS))
#define RF_RBB_PKDET_EN_HW            RF_RBB_PKDET_EN_HW
#define RF_RBB_PKDET_EN_HW_POS        (16U)
#define RF_RBB_PKDET_EN_HW_LEN        (1U)
#define RF_RBB_PKDET_EN_HW_MSK        (((1U << RF_RBB_PKDET_EN_HW_LEN) - 1) << RF_RBB_PKDET_EN_HW_POS)
#define RF_RBB_PKDET_EN_HW_UMSK       (~(((1U << RF_RBB_PKDET_EN_HW_LEN) - 1) << RF_RBB_PKDET_EN_HW_POS))
#define RF_PKDET_OUT_RAW              RF_PKDET_OUT_RAW
#define RF_PKDET_OUT_RAW_POS          (20U)
#define RF_PKDET_OUT_RAW_LEN          (1U)
#define RF_PKDET_OUT_RAW_MSK          (((1U << RF_PKDET_OUT_RAW_LEN) - 1) << RF_PKDET_OUT_RAW_POS)
#define RF_PKDET_OUT_RAW_UMSK         (~(((1U << RF_PKDET_OUT_RAW_LEN) - 1) << RF_PKDET_OUT_RAW_POS))
#define RF_PKDET_OUT_LATCH            RF_PKDET_OUT_LATCH
#define RF_PKDET_OUT_LATCH_POS        (24U)
#define RF_PKDET_OUT_LATCH_LEN        (1U)
#define RF_PKDET_OUT_LATCH_MSK        (((1U << RF_PKDET_OUT_LATCH_LEN) - 1) << RF_PKDET_OUT_LATCH_POS)
#define RF_PKDET_OUT_LATCH_UMSK       (~(((1U << RF_PKDET_OUT_LATCH_LEN) - 1) << RF_PKDET_OUT_LATCH_POS))

/* 0x8C : adda1 */
#define RF_ADDA1_OFFSET              (0x8C)
#define RF_DAC_DVDD_SEL              RF_DAC_DVDD_SEL
#define RF_DAC_DVDD_SEL_POS          (0U)
#define RF_DAC_DVDD_SEL_LEN          (2U)
#define RF_DAC_DVDD_SEL_MSK          (((1U << RF_DAC_DVDD_SEL_LEN) - 1) << RF_DAC_DVDD_SEL_POS)
#define RF_DAC_DVDD_SEL_UMSK         (~(((1U << RF_DAC_DVDD_SEL_LEN) - 1) << RF_DAC_DVDD_SEL_POS))
#define RF_DAC_BIAS_SEL              RF_DAC_BIAS_SEL
#define RF_DAC_BIAS_SEL_POS          (4U)
#define RF_DAC_BIAS_SEL_LEN          (2U)
#define RF_DAC_BIAS_SEL_MSK          (((1U << RF_DAC_BIAS_SEL_LEN) - 1) << RF_DAC_BIAS_SEL_POS)
#define RF_DAC_BIAS_SEL_UMSK         (~(((1U << RF_DAC_BIAS_SEL_LEN) - 1) << RF_DAC_BIAS_SEL_POS))
#define RF_DAC_CLK_SEL               RF_DAC_CLK_SEL
#define RF_DAC_CLK_SEL_POS           (8U)
#define RF_DAC_CLK_SEL_LEN           (2U)
#define RF_DAC_CLK_SEL_MSK           (((1U << RF_DAC_CLK_SEL_LEN) - 1) << RF_DAC_CLK_SEL_POS)
#define RF_DAC_CLK_SEL_UMSK          (~(((1U << RF_DAC_CLK_SEL_LEN) - 1) << RF_DAC_CLK_SEL_POS))
#define RF_DAC_RCCALSEL              RF_DAC_RCCALSEL
#define RF_DAC_RCCALSEL_POS          (12U)
#define RF_DAC_RCCALSEL_LEN          (1U)
#define RF_DAC_RCCALSEL_MSK          (((1U << RF_DAC_RCCALSEL_LEN) - 1) << RF_DAC_RCCALSEL_POS)
#define RF_DAC_RCCALSEL_UMSK         (~(((1U << RF_DAC_RCCALSEL_LEN) - 1) << RF_DAC_RCCALSEL_POS))
#define RF_DAC_CLK_SYNC_INV          RF_DAC_CLK_SYNC_INV
#define RF_DAC_CLK_SYNC_INV_POS      (13U)
#define RF_DAC_CLK_SYNC_INV_LEN      (1U)
#define RF_DAC_CLK_SYNC_INV_MSK      (((1U << RF_DAC_CLK_SYNC_INV_LEN) - 1) << RF_DAC_CLK_SYNC_INV_POS)
#define RF_DAC_CLK_SYNC_INV_UMSK     (~(((1U << RF_DAC_CLK_SYNC_INV_LEN) - 1) << RF_DAC_CLK_SYNC_INV_POS))
#define RF_ADDA_LDO_BYPS             RF_ADDA_LDO_BYPS
#define RF_ADDA_LDO_BYPS_POS         (16U)
#define RF_ADDA_LDO_BYPS_LEN         (1U)
#define RF_ADDA_LDO_BYPS_MSK         (((1U << RF_ADDA_LDO_BYPS_LEN) - 1) << RF_ADDA_LDO_BYPS_POS)
#define RF_ADDA_LDO_BYPS_UMSK        (~(((1U << RF_ADDA_LDO_BYPS_LEN) - 1) << RF_ADDA_LDO_BYPS_POS))
#define RF_ADDA_LDO_DVDD_SEL         RF_ADDA_LDO_DVDD_SEL
#define RF_ADDA_LDO_DVDD_SEL_POS     (20U)
#define RF_ADDA_LDO_DVDD_SEL_LEN     (3U)
#define RF_ADDA_LDO_DVDD_SEL_MSK     (((1U << RF_ADDA_LDO_DVDD_SEL_LEN) - 1) << RF_ADDA_LDO_DVDD_SEL_POS)
#define RF_ADDA_LDO_DVDD_SEL_UMSK    (~(((1U << RF_ADDA_LDO_DVDD_SEL_LEN) - 1) << RF_ADDA_LDO_DVDD_SEL_POS))
#define RF_ADDA_LDO_DVDD_SEL_HW      RF_ADDA_LDO_DVDD_SEL_HW
#define RF_ADDA_LDO_DVDD_SEL_HW_POS  (24U)
#define RF_ADDA_LDO_DVDD_SEL_HW_LEN  (3U)
#define RF_ADDA_LDO_DVDD_SEL_HW_MSK  (((1U << RF_ADDA_LDO_DVDD_SEL_HW_LEN) - 1) << RF_ADDA_LDO_DVDD_SEL_HW_POS)
#define RF_ADDA_LDO_DVDD_SEL_HW_UMSK (~(((1U << RF_ADDA_LDO_DVDD_SEL_HW_LEN) - 1) << RF_ADDA_LDO_DVDD_SEL_HW_POS))

/* 0x90 : adda2 */
#define RF_ADDA2_OFFSET          (0x90)
#define RF_ADC_VREF_SEL          RF_ADC_VREF_SEL
#define RF_ADC_VREF_SEL_POS      (0U)
#define RF_ADC_VREF_SEL_LEN      (2U)
#define RF_ADC_VREF_SEL_MSK      (((1U << RF_ADC_VREF_SEL_LEN) - 1) << RF_ADC_VREF_SEL_POS)
#define RF_ADC_VREF_SEL_UMSK     (~(((1U << RF_ADC_VREF_SEL_LEN) - 1) << RF_ADC_VREF_SEL_POS))
#define RF_ADC_DLY_CTL           RF_ADC_DLY_CTL
#define RF_ADC_DLY_CTL_POS       (4U)
#define RF_ADC_DLY_CTL_LEN       (2U)
#define RF_ADC_DLY_CTL_MSK       (((1U << RF_ADC_DLY_CTL_LEN) - 1) << RF_ADC_DLY_CTL_POS)
#define RF_ADC_DLY_CTL_UMSK      (~(((1U << RF_ADC_DLY_CTL_LEN) - 1) << RF_ADC_DLY_CTL_POS))
#define RF_ADC_DVDD_SEL          RF_ADC_DVDD_SEL
#define RF_ADC_DVDD_SEL_POS      (8U)
#define RF_ADC_DVDD_SEL_LEN      (2U)
#define RF_ADC_DVDD_SEL_MSK      (((1U << RF_ADC_DVDD_SEL_LEN) - 1) << RF_ADC_DVDD_SEL_POS)
#define RF_ADC_DVDD_SEL_UMSK     (~(((1U << RF_ADC_DVDD_SEL_LEN) - 1) << RF_ADC_DVDD_SEL_POS))
#define RF_ADC_SAR_ASCAL_EN      RF_ADC_SAR_ASCAL_EN
#define RF_ADC_SAR_ASCAL_EN_POS  (12U)
#define RF_ADC_SAR_ASCAL_EN_LEN  (1U)
#define RF_ADC_SAR_ASCAL_EN_MSK  (((1U << RF_ADC_SAR_ASCAL_EN_LEN) - 1) << RF_ADC_SAR_ASCAL_EN_POS)
#define RF_ADC_SAR_ASCAL_EN_UMSK (~(((1U << RF_ADC_SAR_ASCAL_EN_LEN) - 1) << RF_ADC_SAR_ASCAL_EN_POS))
#define RF_ADC_GT_RM             RF_ADC_GT_RM
#define RF_ADC_GT_RM_POS         (16U)
#define RF_ADC_GT_RM_LEN         (1U)
#define RF_ADC_GT_RM_MSK         (((1U << RF_ADC_GT_RM_LEN) - 1) << RF_ADC_GT_RM_POS)
#define RF_ADC_GT_RM_UMSK        (~(((1U << RF_ADC_GT_RM_LEN) - 1) << RF_ADC_GT_RM_POS))
#define RF_ADC_CLK_SYNC_INV      RF_ADC_CLK_SYNC_INV
#define RF_ADC_CLK_SYNC_INV_POS  (20U)
#define RF_ADC_CLK_SYNC_INV_LEN  (1U)
#define RF_ADC_CLK_SYNC_INV_MSK  (((1U << RF_ADC_CLK_SYNC_INV_LEN) - 1) << RF_ADC_CLK_SYNC_INV_POS)
#define RF_ADC_CLK_SYNC_INV_UMSK (~(((1U << RF_ADC_CLK_SYNC_INV_LEN) - 1) << RF_ADC_CLK_SYNC_INV_POS))
#define RF_ADC_CLK_INV           RF_ADC_CLK_INV
#define RF_ADC_CLK_INV_POS       (24U)
#define RF_ADC_CLK_INV_LEN       (1U)
#define RF_ADC_CLK_INV_MSK       (((1U << RF_ADC_CLK_INV_LEN) - 1) << RF_ADC_CLK_INV_POS)
#define RF_ADC_CLK_INV_UMSK      (~(((1U << RF_ADC_CLK_INV_LEN) - 1) << RF_ADC_CLK_INV_POS))
#define RF_ADC_CLK_DIV_SEL       RF_ADC_CLK_DIV_SEL
#define RF_ADC_CLK_DIV_SEL_POS   (28U)
#define RF_ADC_CLK_DIV_SEL_LEN   (1U)
#define RF_ADC_CLK_DIV_SEL_MSK   (((1U << RF_ADC_CLK_DIV_SEL_LEN) - 1) << RF_ADC_CLK_DIV_SEL_POS)
#define RF_ADC_CLK_DIV_SEL_UMSK  (~(((1U << RF_ADC_CLK_DIV_SEL_LEN) - 1) << RF_ADC_CLK_DIV_SEL_POS))

/* 0xA0 : vco1 */
#define RF_VCO1_OFFSET            (0xA0)
#define RF_LO_VCO_FREQ_CW         RF_LO_VCO_FREQ_CW
#define RF_LO_VCO_FREQ_CW_POS     (0U)
#define RF_LO_VCO_FREQ_CW_LEN     (8U)
#define RF_LO_VCO_FREQ_CW_MSK     (((1U << RF_LO_VCO_FREQ_CW_LEN) - 1) << RF_LO_VCO_FREQ_CW_POS)
#define RF_LO_VCO_FREQ_CW_UMSK    (~(((1U << RF_LO_VCO_FREQ_CW_LEN) - 1) << RF_LO_VCO_FREQ_CW_POS))
#define RF_LO_VCO_FREQ_CW_HW      RF_LO_VCO_FREQ_CW_HW
#define RF_LO_VCO_FREQ_CW_HW_POS  (8U)
#define RF_LO_VCO_FREQ_CW_HW_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_HW_MSK  (((1U << RF_LO_VCO_FREQ_CW_HW_LEN) - 1) << RF_LO_VCO_FREQ_CW_HW_POS)
#define RF_LO_VCO_FREQ_CW_HW_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_HW_LEN) - 1) << RF_LO_VCO_FREQ_CW_HW_POS))
#define RF_LO_VCO_IDAC_CW         RF_LO_VCO_IDAC_CW
#define RF_LO_VCO_IDAC_CW_POS     (16U)
#define RF_LO_VCO_IDAC_CW_LEN     (5U)
#define RF_LO_VCO_IDAC_CW_MSK     (((1U << RF_LO_VCO_IDAC_CW_LEN) - 1) << RF_LO_VCO_IDAC_CW_POS)
#define RF_LO_VCO_IDAC_CW_UMSK    (~(((1U << RF_LO_VCO_IDAC_CW_LEN) - 1) << RF_LO_VCO_IDAC_CW_POS))
#define RF_LO_VCO_IDAC_CW_HW      RF_LO_VCO_IDAC_CW_HW
#define RF_LO_VCO_IDAC_CW_HW_POS  (24U)
#define RF_LO_VCO_IDAC_CW_HW_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_HW_MSK  (((1U << RF_LO_VCO_IDAC_CW_HW_LEN) - 1) << RF_LO_VCO_IDAC_CW_HW_POS)
#define RF_LO_VCO_IDAC_CW_HW_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_HW_LEN) - 1) << RF_LO_VCO_IDAC_CW_HW_POS))

/* 0xA4 : vco2 */
#define RF_VCO2_OFFSET                    (0xA4)
#define RF_LO_VCO_VBIAS_CW                RF_LO_VCO_VBIAS_CW
#define RF_LO_VCO_VBIAS_CW_POS            (0U)
#define RF_LO_VCO_VBIAS_CW_LEN            (2U)
#define RF_LO_VCO_VBIAS_CW_MSK            (((1U << RF_LO_VCO_VBIAS_CW_LEN) - 1) << RF_LO_VCO_VBIAS_CW_POS)
#define RF_LO_VCO_VBIAS_CW_UMSK           (~(((1U << RF_LO_VCO_VBIAS_CW_LEN) - 1) << RF_LO_VCO_VBIAS_CW_POS))
#define RF_LO_VCO_IDAC_BOOT               RF_LO_VCO_IDAC_BOOT
#define RF_LO_VCO_IDAC_BOOT_POS           (4U)
#define RF_LO_VCO_IDAC_BOOT_LEN           (1U)
#define RF_LO_VCO_IDAC_BOOT_MSK           (((1U << RF_LO_VCO_IDAC_BOOT_LEN) - 1) << RF_LO_VCO_IDAC_BOOT_POS)
#define RF_LO_VCO_IDAC_BOOT_UMSK          (~(((1U << RF_LO_VCO_IDAC_BOOT_LEN) - 1) << RF_LO_VCO_IDAC_BOOT_POS))
#define RF_LO_VCO_SHORT_VBIAS_FILTER      RF_LO_VCO_SHORT_VBIAS_FILTER
#define RF_LO_VCO_SHORT_VBIAS_FILTER_POS  (5U)
#define RF_LO_VCO_SHORT_VBIAS_FILTER_LEN  (1U)
#define RF_LO_VCO_SHORT_VBIAS_FILTER_MSK  (((1U << RF_LO_VCO_SHORT_VBIAS_FILTER_LEN) - 1) << RF_LO_VCO_SHORT_VBIAS_FILTER_POS)
#define RF_LO_VCO_SHORT_VBIAS_FILTER_UMSK (~(((1U << RF_LO_VCO_SHORT_VBIAS_FILTER_LEN) - 1) << RF_LO_VCO_SHORT_VBIAS_FILTER_POS))
#define RF_LO_VCO_SHORT_IDAC_FILTER       RF_LO_VCO_SHORT_IDAC_FILTER
#define RF_LO_VCO_SHORT_IDAC_FILTER_POS   (6U)
#define RF_LO_VCO_SHORT_IDAC_FILTER_LEN   (1U)
#define RF_LO_VCO_SHORT_IDAC_FILTER_MSK   (((1U << RF_LO_VCO_SHORT_IDAC_FILTER_LEN) - 1) << RF_LO_VCO_SHORT_IDAC_FILTER_POS)
#define RF_LO_VCO_SHORT_IDAC_FILTER_UMSK  (~(((1U << RF_LO_VCO_SHORT_IDAC_FILTER_LEN) - 1) << RF_LO_VCO_SHORT_IDAC_FILTER_POS))
#define RF_ACAL_VREF_CW                   RF_ACAL_VREF_CW
#define RF_ACAL_VREF_CW_POS               (8U)
#define RF_ACAL_VREF_CW_LEN               (3U)
#define RF_ACAL_VREF_CW_MSK               (((1U << RF_ACAL_VREF_CW_LEN) - 1) << RF_ACAL_VREF_CW_POS)
#define RF_ACAL_VREF_CW_UMSK              (~(((1U << RF_ACAL_VREF_CW_LEN) - 1) << RF_ACAL_VREF_CW_POS))
#define RF_ACAL_VCO_UD                    RF_ACAL_VCO_UD
#define RF_ACAL_VCO_UD_POS                (12U)
#define RF_ACAL_VCO_UD_LEN                (1U)
#define RF_ACAL_VCO_UD_MSK                (((1U << RF_ACAL_VCO_UD_LEN) - 1) << RF_ACAL_VCO_UD_POS)
#define RF_ACAL_VCO_UD_UMSK               (~(((1U << RF_ACAL_VCO_UD_LEN) - 1) << RF_ACAL_VCO_UD_POS))
#define RF_ACAL_INC_EN_HW                 RF_ACAL_INC_EN_HW
#define RF_ACAL_INC_EN_HW_POS             (16U)
#define RF_ACAL_INC_EN_HW_LEN             (1U)
#define RF_ACAL_INC_EN_HW_MSK             (((1U << RF_ACAL_INC_EN_HW_LEN) - 1) << RF_ACAL_INC_EN_HW_POS)
#define RF_ACAL_INC_EN_HW_UMSK            (~(((1U << RF_ACAL_INC_EN_HW_LEN) - 1) << RF_ACAL_INC_EN_HW_POS))

/* 0xA8 : vco3 */
#define RF_VCO3_OFFSET      (0xA8)
#define RF_FCAL_DIV         RF_FCAL_DIV
#define RF_FCAL_DIV_POS     (0U)
#define RF_FCAL_DIV_LEN     (16U)
#define RF_FCAL_DIV_MSK     (((1U << RF_FCAL_DIV_LEN) - 1) << RF_FCAL_DIV_POS)
#define RF_FCAL_DIV_UMSK    (~(((1U << RF_FCAL_DIV_LEN) - 1) << RF_FCAL_DIV_POS))
#define RF_FCAL_CNT_OP      RF_FCAL_CNT_OP
#define RF_FCAL_CNT_OP_POS  (16U)
#define RF_FCAL_CNT_OP_LEN  (16U)
#define RF_FCAL_CNT_OP_MSK  (((1U << RF_FCAL_CNT_OP_LEN) - 1) << RF_FCAL_CNT_OP_POS)
#define RF_FCAL_CNT_OP_UMSK (~(((1U << RF_FCAL_CNT_OP_LEN) - 1) << RF_FCAL_CNT_OP_POS))

/* 0xAC : vco4 */
#define RF_VCO4_OFFSET               (0xAC)
#define RF_FCAL_CNT_START            RF_FCAL_CNT_START
#define RF_FCAL_CNT_START_POS        (4U)
#define RF_FCAL_CNT_START_LEN        (1U)
#define RF_FCAL_CNT_START_MSK        (((1U << RF_FCAL_CNT_START_LEN) - 1) << RF_FCAL_CNT_START_POS)
#define RF_FCAL_CNT_START_UMSK       (~(((1U << RF_FCAL_CNT_START_LEN) - 1) << RF_FCAL_CNT_START_POS))
#define RF_FCAL_INC_EN_HW            RF_FCAL_INC_EN_HW
#define RF_FCAL_INC_EN_HW_POS        (8U)
#define RF_FCAL_INC_EN_HW_LEN        (1U)
#define RF_FCAL_INC_EN_HW_MSK        (((1U << RF_FCAL_INC_EN_HW_LEN) - 1) << RF_FCAL_INC_EN_HW_POS)
#define RF_FCAL_INC_EN_HW_UMSK       (~(((1U << RF_FCAL_INC_EN_HW_LEN) - 1) << RF_FCAL_INC_EN_HW_POS))
#define RF_FCAL_INC_LARGE_RANGE      RF_FCAL_INC_LARGE_RANGE
#define RF_FCAL_INC_LARGE_RANGE_POS  (16U)
#define RF_FCAL_INC_LARGE_RANGE_LEN  (1U)
#define RF_FCAL_INC_LARGE_RANGE_MSK  (((1U << RF_FCAL_INC_LARGE_RANGE_LEN) - 1) << RF_FCAL_INC_LARGE_RANGE_POS)
#define RF_FCAL_INC_LARGE_RANGE_UMSK (~(((1U << RF_FCAL_INC_LARGE_RANGE_LEN) - 1) << RF_FCAL_INC_LARGE_RANGE_POS))
#define RF_FCAL_CNT_RDY              RF_FCAL_CNT_RDY
#define RF_FCAL_CNT_RDY_POS          (20U)
#define RF_FCAL_CNT_RDY_LEN          (1U)
#define RF_FCAL_CNT_RDY_MSK          (((1U << RF_FCAL_CNT_RDY_LEN) - 1) << RF_FCAL_CNT_RDY_POS)
#define RF_FCAL_CNT_RDY_UMSK         (~(((1U << RF_FCAL_CNT_RDY_LEN) - 1) << RF_FCAL_CNT_RDY_POS))
#define RF_FCAL_INC_VCTRL_UD         RF_FCAL_INC_VCTRL_UD
#define RF_FCAL_INC_VCTRL_UD_POS     (24U)
#define RF_FCAL_INC_VCTRL_UD_LEN     (2U)
#define RF_FCAL_INC_VCTRL_UD_MSK     (((1U << RF_FCAL_INC_VCTRL_UD_LEN) - 1) << RF_FCAL_INC_VCTRL_UD_POS)
#define RF_FCAL_INC_VCTRL_UD_UMSK    (~(((1U << RF_FCAL_INC_VCTRL_UD_LEN) - 1) << RF_FCAL_INC_VCTRL_UD_POS))

/* 0xB0 : pfdcp */
#define RF_PFDCP_OFFSET           (0xB0)
#define RF_LO_CP_SEL              RF_LO_CP_SEL
#define RF_LO_CP_SEL_POS          (0U)
#define RF_LO_CP_SEL_LEN          (1U)
#define RF_LO_CP_SEL_MSK          (((1U << RF_LO_CP_SEL_LEN) - 1) << RF_LO_CP_SEL_POS)
#define RF_LO_CP_SEL_UMSK         (~(((1U << RF_LO_CP_SEL_LEN) - 1) << RF_LO_CP_SEL_POS))
#define RF_LO_CP_SEL_HW           RF_LO_CP_SEL_HW
#define RF_LO_CP_SEL_HW_POS       (4U)
#define RF_LO_CP_SEL_HW_LEN       (1U)
#define RF_LO_CP_SEL_HW_MSK       (((1U << RF_LO_CP_SEL_HW_LEN) - 1) << RF_LO_CP_SEL_HW_POS)
#define RF_LO_CP_SEL_HW_UMSK      (~(((1U << RF_LO_CP_SEL_HW_LEN) - 1) << RF_LO_CP_SEL_HW_POS))
#define RF_LO_CP_STARTUP_EN       RF_LO_CP_STARTUP_EN
#define RF_LO_CP_STARTUP_EN_POS   (8U)
#define RF_LO_CP_STARTUP_EN_LEN   (1U)
#define RF_LO_CP_STARTUP_EN_MSK   (((1U << RF_LO_CP_STARTUP_EN_LEN) - 1) << RF_LO_CP_STARTUP_EN_POS)
#define RF_LO_CP_STARTUP_EN_UMSK  (~(((1U << RF_LO_CP_STARTUP_EN_LEN) - 1) << RF_LO_CP_STARTUP_EN_POS))
#define RF_LO_CP_OTA_EN           RF_LO_CP_OTA_EN
#define RF_LO_CP_OTA_EN_POS       (12U)
#define RF_LO_CP_OTA_EN_LEN       (1U)
#define RF_LO_CP_OTA_EN_MSK       (((1U << RF_LO_CP_OTA_EN_LEN) - 1) << RF_LO_CP_OTA_EN_POS)
#define RF_LO_CP_OTA_EN_UMSK      (~(((1U << RF_LO_CP_OTA_EN_LEN) - 1) << RF_LO_CP_OTA_EN_POS))
#define RF_LO_CP_OPAMP_EN         RF_LO_CP_OPAMP_EN
#define RF_LO_CP_OPAMP_EN_POS     (16U)
#define RF_LO_CP_OPAMP_EN_LEN     (1U)
#define RF_LO_CP_OPAMP_EN_MSK     (((1U << RF_LO_CP_OPAMP_EN_LEN) - 1) << RF_LO_CP_OPAMP_EN_POS)
#define RF_LO_CP_OPAMP_EN_UMSK    (~(((1U << RF_LO_CP_OPAMP_EN_LEN) - 1) << RF_LO_CP_OPAMP_EN_POS))
#define RF_LO_CP_HIZ              RF_LO_CP_HIZ
#define RF_LO_CP_HIZ_POS          (20U)
#define RF_LO_CP_HIZ_LEN          (1U)
#define RF_LO_CP_HIZ_MSK          (((1U << RF_LO_CP_HIZ_LEN) - 1) << RF_LO_CP_HIZ_POS)
#define RF_LO_CP_HIZ_UMSK         (~(((1U << RF_LO_CP_HIZ_LEN) - 1) << RF_LO_CP_HIZ_POS))
#define RF_LO_PFD_RVDD_BOOST      RF_LO_PFD_RVDD_BOOST
#define RF_LO_PFD_RVDD_BOOST_POS  (24U)
#define RF_LO_PFD_RVDD_BOOST_LEN  (1U)
#define RF_LO_PFD_RVDD_BOOST_MSK  (((1U << RF_LO_PFD_RVDD_BOOST_LEN) - 1) << RF_LO_PFD_RVDD_BOOST_POS)
#define RF_LO_PFD_RVDD_BOOST_UMSK (~(((1U << RF_LO_PFD_RVDD_BOOST_LEN) - 1) << RF_LO_PFD_RVDD_BOOST_POS))
#define RF_LO_PFD_RST_CSD         RF_LO_PFD_RST_CSD
#define RF_LO_PFD_RST_CSD_POS     (28U)
#define RF_LO_PFD_RST_CSD_LEN     (1U)
#define RF_LO_PFD_RST_CSD_MSK     (((1U << RF_LO_PFD_RST_CSD_LEN) - 1) << RF_LO_PFD_RST_CSD_POS)
#define RF_LO_PFD_RST_CSD_UMSK    (~(((1U << RF_LO_PFD_RST_CSD_LEN) - 1) << RF_LO_PFD_RST_CSD_POS))
#define RF_LO_PFD_RST_CSD_HW      RF_LO_PFD_RST_CSD_HW
#define RF_LO_PFD_RST_CSD_HW_POS  (29U)
#define RF_LO_PFD_RST_CSD_HW_LEN  (1U)
#define RF_LO_PFD_RST_CSD_HW_MSK  (((1U << RF_LO_PFD_RST_CSD_HW_LEN) - 1) << RF_LO_PFD_RST_CSD_HW_POS)
#define RF_LO_PFD_RST_CSD_HW_UMSK (~(((1U << RF_LO_PFD_RST_CSD_HW_LEN) - 1) << RF_LO_PFD_RST_CSD_HW_POS))

/* 0xB4 : lo */
#define RF_LO_OFFSET           (0xB4)
#define RF_LO_LF_RZ_HW         RF_LO_LF_RZ_HW
#define RF_LO_LF_RZ_HW_POS     (0U)
#define RF_LO_LF_RZ_HW_LEN     (2U)
#define RF_LO_LF_RZ_HW_MSK     (((1U << RF_LO_LF_RZ_HW_LEN) - 1) << RF_LO_LF_RZ_HW_POS)
#define RF_LO_LF_RZ_HW_UMSK    (~(((1U << RF_LO_LF_RZ_HW_LEN) - 1) << RF_LO_LF_RZ_HW_POS))
#define RF_LO_LF_R4_HW         RF_LO_LF_R4_HW
#define RF_LO_LF_R4_HW_POS     (4U)
#define RF_LO_LF_R4_HW_LEN     (2U)
#define RF_LO_LF_R4_HW_MSK     (((1U << RF_LO_LF_R4_HW_LEN) - 1) << RF_LO_LF_R4_HW_POS)
#define RF_LO_LF_R4_HW_UMSK    (~(((1U << RF_LO_LF_R4_HW_LEN) - 1) << RF_LO_LF_R4_HW_POS))
#define RF_LO_LF_CZ_HW         RF_LO_LF_CZ_HW
#define RF_LO_LF_CZ_HW_POS     (8U)
#define RF_LO_LF_CZ_HW_LEN     (2U)
#define RF_LO_LF_CZ_HW_MSK     (((1U << RF_LO_LF_CZ_HW_LEN) - 1) << RF_LO_LF_CZ_HW_POS)
#define RF_LO_LF_CZ_HW_UMSK    (~(((1U << RF_LO_LF_CZ_HW_LEN) - 1) << RF_LO_LF_CZ_HW_POS))
#define RF_LO_LF_RZ            RF_LO_LF_RZ
#define RF_LO_LF_RZ_POS        (12U)
#define RF_LO_LF_RZ_LEN        (2U)
#define RF_LO_LF_RZ_MSK        (((1U << RF_LO_LF_RZ_LEN) - 1) << RF_LO_LF_RZ_POS)
#define RF_LO_LF_RZ_UMSK       (~(((1U << RF_LO_LF_RZ_LEN) - 1) << RF_LO_LF_RZ_POS))
#define RF_LO_LF_CZ            RF_LO_LF_CZ
#define RF_LO_LF_CZ_POS        (14U)
#define RF_LO_LF_CZ_LEN        (2U)
#define RF_LO_LF_CZ_MSK        (((1U << RF_LO_LF_CZ_LEN) - 1) << RF_LO_LF_CZ_POS)
#define RF_LO_LF_CZ_UMSK       (~(((1U << RF_LO_LF_CZ_LEN) - 1) << RF_LO_LF_CZ_POS))
#define RF_LO_LF_R4            RF_LO_LF_R4
#define RF_LO_LF_R4_POS        (16U)
#define RF_LO_LF_R4_LEN        (2U)
#define RF_LO_LF_R4_MSK        (((1U << RF_LO_LF_R4_LEN) - 1) << RF_LO_LF_R4_POS)
#define RF_LO_LF_R4_UMSK       (~(((1U << RF_LO_LF_R4_LEN) - 1) << RF_LO_LF_R4_POS))
#define RF_LO_LF_R4_SHORT      RF_LO_LF_R4_SHORT
#define RF_LO_LF_R4_SHORT_POS  (18U)
#define RF_LO_LF_R4_SHORT_LEN  (1U)
#define RF_LO_LF_R4_SHORT_MSK  (((1U << RF_LO_LF_R4_SHORT_LEN) - 1) << RF_LO_LF_R4_SHORT_POS)
#define RF_LO_LF_R4_SHORT_UMSK (~(((1U << RF_LO_LF_R4_SHORT_LEN) - 1) << RF_LO_LF_R4_SHORT_POS))
#define RF_LO_SLIPPED_DN       RF_LO_SLIPPED_DN
#define RF_LO_SLIPPED_DN_POS   (20U)
#define RF_LO_SLIPPED_DN_LEN   (1U)
#define RF_LO_SLIPPED_DN_MSK   (((1U << RF_LO_SLIPPED_DN_LEN) - 1) << RF_LO_SLIPPED_DN_POS)
#define RF_LO_SLIPPED_DN_UMSK  (~(((1U << RF_LO_SLIPPED_DN_LEN) - 1) << RF_LO_SLIPPED_DN_POS))
#define RF_LO_SLIPPED_UP       RF_LO_SLIPPED_UP
#define RF_LO_SLIPPED_UP_POS   (24U)
#define RF_LO_SLIPPED_UP_LEN   (1U)
#define RF_LO_SLIPPED_UP_MSK   (((1U << RF_LO_SLIPPED_UP_LEN) - 1) << RF_LO_SLIPPED_UP_POS)
#define RF_LO_SLIPPED_UP_UMSK  (~(((1U << RF_LO_SLIPPED_UP_LEN) - 1) << RF_LO_SLIPPED_UP_POS))

/* 0xB8 : fbdv */
#define RF_FBDV_OFFSET                 (0xB8)
#define RF_LO_FBDV_HALFSTEP_EN_HW      RF_LO_FBDV_HALFSTEP_EN_HW
#define RF_LO_FBDV_HALFSTEP_EN_HW_POS  (0U)
#define RF_LO_FBDV_HALFSTEP_EN_HW_LEN  (1U)
#define RF_LO_FBDV_HALFSTEP_EN_HW_MSK  (((1U << RF_LO_FBDV_HALFSTEP_EN_HW_LEN) - 1) << RF_LO_FBDV_HALFSTEP_EN_HW_POS)
#define RF_LO_FBDV_HALFSTEP_EN_HW_UMSK (~(((1U << RF_LO_FBDV_HALFSTEP_EN_HW_LEN) - 1) << RF_LO_FBDV_HALFSTEP_EN_HW_POS))
#define RF_LO_FBDV_HALFSTEP_EN         RF_LO_FBDV_HALFSTEP_EN
#define RF_LO_FBDV_HALFSTEP_EN_POS     (4U)
#define RF_LO_FBDV_HALFSTEP_EN_LEN     (1U)
#define RF_LO_FBDV_HALFSTEP_EN_MSK     (((1U << RF_LO_FBDV_HALFSTEP_EN_LEN) - 1) << RF_LO_FBDV_HALFSTEP_EN_POS)
#define RF_LO_FBDV_HALFSTEP_EN_UMSK    (~(((1U << RF_LO_FBDV_HALFSTEP_EN_LEN) - 1) << RF_LO_FBDV_HALFSTEP_EN_POS))
#define RF_LO_FBDV_SEL_SAMPLE_CLK      RF_LO_FBDV_SEL_SAMPLE_CLK
#define RF_LO_FBDV_SEL_SAMPLE_CLK_POS  (8U)
#define RF_LO_FBDV_SEL_SAMPLE_CLK_LEN  (2U)
#define RF_LO_FBDV_SEL_SAMPLE_CLK_MSK  (((1U << RF_LO_FBDV_SEL_SAMPLE_CLK_LEN) - 1) << RF_LO_FBDV_SEL_SAMPLE_CLK_POS)
#define RF_LO_FBDV_SEL_SAMPLE_CLK_UMSK (~(((1U << RF_LO_FBDV_SEL_SAMPLE_CLK_LEN) - 1) << RF_LO_FBDV_SEL_SAMPLE_CLK_POS))
#define RF_LO_FBDV_SEL_FB_CLK          RF_LO_FBDV_SEL_FB_CLK
#define RF_LO_FBDV_SEL_FB_CLK_POS      (12U)
#define RF_LO_FBDV_SEL_FB_CLK_LEN      (2U)
#define RF_LO_FBDV_SEL_FB_CLK_MSK      (((1U << RF_LO_FBDV_SEL_FB_CLK_LEN) - 1) << RF_LO_FBDV_SEL_FB_CLK_POS)
#define RF_LO_FBDV_SEL_FB_CLK_UMSK     (~(((1U << RF_LO_FBDV_SEL_FB_CLK_LEN) - 1) << RF_LO_FBDV_SEL_FB_CLK_POS))
#define RF_LO_FBDV_RST                 RF_LO_FBDV_RST
#define RF_LO_FBDV_RST_POS             (16U)
#define RF_LO_FBDV_RST_LEN             (1U)
#define RF_LO_FBDV_RST_MSK             (((1U << RF_LO_FBDV_RST_LEN) - 1) << RF_LO_FBDV_RST_POS)
#define RF_LO_FBDV_RST_UMSK            (~(((1U << RF_LO_FBDV_RST_LEN) - 1) << RF_LO_FBDV_RST_POS))
#define RF_LO_FBDV_RST_HW              RF_LO_FBDV_RST_HW
#define RF_LO_FBDV_RST_HW_POS          (20U)
#define RF_LO_FBDV_RST_HW_LEN          (1U)
#define RF_LO_FBDV_RST_HW_MSK          (((1U << RF_LO_FBDV_RST_HW_LEN) - 1) << RF_LO_FBDV_RST_HW_POS)
#define RF_LO_FBDV_RST_HW_UMSK         (~(((1U << RF_LO_FBDV_RST_HW_LEN) - 1) << RF_LO_FBDV_RST_HW_POS))

