bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0xBC : lodist */
#define RF_LODIST_OFFSET             (0xBC)
#define RF_LO_OSMX_XGM_BOOST         RF_LO_OSMX_XGM_BOOST
#define RF_LO_OSMX_XGM_BOOST_POS     (0U)
#define RF_LO_OSMX_XGM_BOOST_LEN     (1U)
#define RF_LO_OSMX_XGM_BOOST_MSK     (((1U << RF_LO_OSMX_XGM_BOOST_LEN) - 1) << RF_LO_OSMX_XGM_BOOST_POS)
#define RF_LO_OSMX_XGM_BOOST_UMSK    (~(((1U << RF_LO_OSMX_XGM_BOOST_LEN) - 1) << RF_LO_OSMX_XGM_BOOST_POS))
#define RF_LO_OSMX_EN_XGM            RF_LO_OSMX_EN_XGM
#define RF_LO_OSMX_EN_XGM_POS        (4U)
#define RF_LO_OSMX_EN_XGM_LEN        (1U)
#define RF_LO_OSMX_EN_XGM_MSK        (((1U << RF_LO_OSMX_EN_XGM_LEN) - 1) << RF_LO_OSMX_EN_XGM_POS)
#define RF_LO_OSMX_EN_XGM_UMSK       (~(((1U << RF_LO_OSMX_EN_XGM_LEN) - 1) << RF_LO_OSMX_EN_XGM_POS))
#define RF_LO_OSMX_FIX_CAP           RF_LO_OSMX_FIX_CAP
#define RF_LO_OSMX_FIX_CAP_POS       (8U)
#define RF_LO_OSMX_FIX_CAP_LEN       (1U)
#define RF_LO_OSMX_FIX_CAP_MSK       (((1U << RF_LO_OSMX_FIX_CAP_LEN) - 1) << RF_LO_OSMX_FIX_CAP_POS)
#define RF_LO_OSMX_FIX_CAP_UMSK      (~(((1U << RF_LO_OSMX_FIX_CAP_LEN) - 1) << RF_LO_OSMX_FIX_CAP_POS))
#define RF_LO_OSMX_VBUF_STRE         RF_LO_OSMX_VBUF_STRE
#define RF_LO_OSMX_VBUF_STRE_POS     (12U)
#define RF_LO_OSMX_VBUF_STRE_LEN     (1U)
#define RF_LO_OSMX_VBUF_STRE_MSK     (((1U << RF_LO_OSMX_VBUF_STRE_LEN) - 1) << RF_LO_OSMX_VBUF_STRE_POS)
#define RF_LO_OSMX_VBUF_STRE_UMSK    (~(((1U << RF_LO_OSMX_VBUF_STRE_LEN) - 1) << RF_LO_OSMX_VBUF_STRE_POS))
#define RF_LO_OSMX_CAPBANK_BIAS      RF_LO_OSMX_CAPBANK_BIAS
#define RF_LO_OSMX_CAPBANK_BIAS_POS  (16U)
#define RF_LO_OSMX_CAPBANK_BIAS_LEN  (2U)
#define RF_LO_OSMX_CAPBANK_BIAS_MSK  (((1U << RF_LO_OSMX_CAPBANK_BIAS_LEN) - 1) << RF_LO_OSMX_CAPBANK_BIAS_POS)
#define RF_LO_OSMX_CAPBANK_BIAS_UMSK (~(((1U << RF_LO_OSMX_CAPBANK_BIAS_LEN) - 1) << RF_LO_OSMX_CAPBANK_BIAS_POS))
#define RF_LO_OSMX_CAP               RF_LO_OSMX_CAP
#define RF_LO_OSMX_CAP_POS           (20U)
#define RF_LO_OSMX_CAP_LEN           (4U)
#define RF_LO_OSMX_CAP_MSK           (((1U << RF_LO_OSMX_CAP_LEN) - 1) << RF_LO_OSMX_CAP_POS)
#define RF_LO_OSMX_CAP_UMSK          (~(((1U << RF_LO_OSMX_CAP_LEN) - 1) << RF_LO_OSMX_CAP_POS))
#define RF_LO_LODIST_TXBUF_STRE      RF_LO_LODIST_TXBUF_STRE
#define RF_LO_LODIST_TXBUF_STRE_POS  (24U)
#define RF_LO_LODIST_TXBUF_STRE_LEN  (1U)
#define RF_LO_LODIST_TXBUF_STRE_MSK  (((1U << RF_LO_LODIST_TXBUF_STRE_LEN) - 1) << RF_LO_LODIST_TXBUF_STRE_POS)
#define RF_LO_LODIST_TXBUF_STRE_UMSK (~(((1U << RF_LO_LODIST_TXBUF_STRE_LEN) - 1) << RF_LO_LODIST_TXBUF_STRE_POS))
#define RF_LO_LODIST_RXBUF_STRE      RF_LO_LODIST_RXBUF_STRE
#define RF_LO_LODIST_RXBUF_STRE_POS  (28U)
#define RF_LO_LODIST_RXBUF_STRE_LEN  (1U)
#define RF_LO_LODIST_RXBUF_STRE_MSK  (((1U << RF_LO_LODIST_RXBUF_STRE_LEN) - 1) << RF_LO_LODIST_RXBUF_STRE_POS)
#define RF_LO_LODIST_RXBUF_STRE_UMSK (~(((1U << RF_LO_LODIST_RXBUF_STRE_LEN) - 1) << RF_LO_LODIST_RXBUF_STRE_POS))

/* 0xC0 : sdm1 */
#define RF_SDM1_OFFSET               (0xC0)
#define RF_LO_SDM_DITHER_SEL_HW      RF_LO_SDM_DITHER_SEL_HW
#define RF_LO_SDM_DITHER_SEL_HW_POS  (0U)
#define RF_LO_SDM_DITHER_SEL_HW_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_HW_MSK  (((1U << RF_LO_SDM_DITHER_SEL_HW_LEN) - 1) << RF_LO_SDM_DITHER_SEL_HW_POS)
#define RF_LO_SDM_DITHER_SEL_HW_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_HW_LEN) - 1) << RF_LO_SDM_DITHER_SEL_HW_POS))
#define RF_LO_SDM_BYPASS_HW          RF_LO_SDM_BYPASS_HW
#define RF_LO_SDM_BYPASS_HW_POS      (4U)
#define RF_LO_SDM_BYPASS_HW_LEN      (1U)
#define RF_LO_SDM_BYPASS_HW_MSK      (((1U << RF_LO_SDM_BYPASS_HW_LEN) - 1) << RF_LO_SDM_BYPASS_HW_POS)
#define RF_LO_SDM_BYPASS_HW_UMSK     (~(((1U << RF_LO_SDM_BYPASS_HW_LEN) - 1) << RF_LO_SDM_BYPASS_HW_POS))
#define RF_LO_SDM_DITHER_SEL         RF_LO_SDM_DITHER_SEL
#define RF_LO_SDM_DITHER_SEL_POS     (8U)
#define RF_LO_SDM_DITHER_SEL_LEN     (2U)
#define RF_LO_SDM_DITHER_SEL_MSK     (((1U << RF_LO_SDM_DITHER_SEL_LEN) - 1) << RF_LO_SDM_DITHER_SEL_POS)
#define RF_LO_SDM_DITHER_SEL_UMSK    (~(((1U << RF_LO_SDM_DITHER_SEL_LEN) - 1) << RF_LO_SDM_DITHER_SEL_POS))
#define RF_LO_SDM_BYPASS             RF_LO_SDM_BYPASS
#define RF_LO_SDM_BYPASS_POS         (12U)
#define RF_LO_SDM_BYPASS_LEN         (1U)
#define RF_LO_SDM_BYPASS_MSK         (((1U << RF_LO_SDM_BYPASS_LEN) - 1) << RF_LO_SDM_BYPASS_POS)
#define RF_LO_SDM_BYPASS_UMSK        (~(((1U << RF_LO_SDM_BYPASS_LEN) - 1) << RF_LO_SDM_BYPASS_POS))
#define RF_LO_SDM_RSTB               RF_LO_SDM_RSTB
#define RF_LO_SDM_RSTB_POS           (16U)
#define RF_LO_SDM_RSTB_LEN           (1U)
#define RF_LO_SDM_RSTB_MSK           (((1U << RF_LO_SDM_RSTB_LEN) - 1) << RF_LO_SDM_RSTB_POS)
#define RF_LO_SDM_RSTB_UMSK          (~(((1U << RF_LO_SDM_RSTB_LEN) - 1) << RF_LO_SDM_RSTB_POS))
#define RF_LO_SDM_RSTB_HW            RF_LO_SDM_RSTB_HW
#define RF_LO_SDM_RSTB_HW_POS        (17U)
#define RF_LO_SDM_RSTB_HW_LEN        (1U)
#define RF_LO_SDM_RSTB_HW_MSK        (((1U << RF_LO_SDM_RSTB_HW_LEN) - 1) << RF_LO_SDM_RSTB_HW_POS)
#define RF_LO_SDM_RSTB_HW_UMSK       (~(((1U << RF_LO_SDM_RSTB_HW_LEN) - 1) << RF_LO_SDM_RSTB_HW_POS))
#define RF_LO_SDM_FLAG               RF_LO_SDM_FLAG
#define RF_LO_SDM_FLAG_POS           (20U)
#define RF_LO_SDM_FLAG_LEN           (1U)
#define RF_LO_SDM_FLAG_MSK           (((1U << RF_LO_SDM_FLAG_LEN) - 1) << RF_LO_SDM_FLAG_POS)
#define RF_LO_SDM_FLAG_UMSK          (~(((1U << RF_LO_SDM_FLAG_LEN) - 1) << RF_LO_SDM_FLAG_POS))

/* 0xC4 : sdm2 */
#define RF_SDM2_OFFSET   (0xC4)
#define RF_LO_SDMIN      RF_LO_SDMIN
#define RF_LO_SDMIN_POS  (0U)
#define RF_LO_SDMIN_LEN  (30U)
#define RF_LO_SDMIN_MSK  (((1U << RF_LO_SDMIN_LEN) - 1) << RF_LO_SDMIN_POS)
#define RF_LO_SDMIN_UMSK (~(((1U << RF_LO_SDMIN_LEN) - 1) << RF_LO_SDMIN_POS))

/* 0xC8 : sdm3 */
#define RF_SDM3_OFFSET      (0xC8)
#define RF_LO_SDMIN_HW      RF_LO_SDMIN_HW
#define RF_LO_SDMIN_HW_POS  (0U)
#define RF_LO_SDMIN_HW_LEN  (30U)
#define RF_LO_SDMIN_HW_MSK  (((1U << RF_LO_SDMIN_HW_LEN) - 1) << RF_LO_SDMIN_HW_POS)
#define RF_LO_SDMIN_HW_UMSK (~(((1U << RF_LO_SDMIN_HW_LEN) - 1) << RF_LO_SDMIN_HW_POS))

/* 0xEC : rf_resv_reg_0 */
#define RF_RESV_REG_0_OFFSET (0xEC)
#define RF_RESERVED0         RF_RESERVED0
#define RF_RESERVED0_POS     (0U)
#define RF_RESERVED0_LEN     (32U)
#define RF_RESERVED0_MSK     (((1U << RF_RESERVED0_LEN) - 1) << RF_RESERVED0_POS)
#define RF_RESERVED0_UMSK    (~(((1U << RF_RESERVED0_LEN) - 1) << RF_RESERVED0_POS))

/* 0xF0 : rf_resv_reg_1 */
#define RF_RESV_REG_1_OFFSET (0xF0)
#define RF_RESERVED1         RF_RESERVED1
#define RF_RESERVED1_POS     (0U)
#define RF_RESERVED1_LEN     (32U)
#define RF_RESERVED1_MSK     (((1U << RF_RESERVED1_LEN) - 1) << RF_RESERVED1_POS)
#define RF_RESERVED1_UMSK    (~(((1U << RF_RESERVED1_LEN) - 1) << RF_RESERVED1_POS))

