bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0xF4 : rf_resv_reg_2 */
#define RF_RESV_REG_2_OFFSET (0xF4)
#define RF_RESERVED2         RF_RESERVED2
#define RF_RESERVED2_POS     (0U)
#define RF_RESERVED2_LEN     (32U)
#define RF_RESERVED2_MSK     (((1U << RF_RESERVED2_LEN) - 1) << RF_RESERVED2_POS)
#define RF_RESERVED2_UMSK    (~(((1U << RF_RESERVED2_LEN) - 1) << RF_RESERVED2_POS))

/* 0xF8 : rrf_gain_index1 */
#define RF_RRF_GAIN_INDEX1_OFFSET   (0xF8)
#define RF_GAIN_CTRL0_GC_RMXGM      RF_GAIN_CTRL0_GC_RMXGM
#define RF_GAIN_CTRL0_GC_RMXGM_POS  (0U)
#define RF_GAIN_CTRL0_GC_RMXGM_LEN  (2U)
#define RF_GAIN_CTRL0_GC_RMXGM_MSK  (((1U << RF_GAIN_CTRL0_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL0_GC_RMXGM_POS)
#define RF_GAIN_CTRL0_GC_RMXGM_UMSK (~(((1U << RF_GAIN_CTRL0_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL0_GC_RMXGM_POS))
#define RF_GAIN_CTRL0_GC_LNA        RF_GAIN_CTRL0_GC_LNA
#define RF_GAIN_CTRL0_GC_LNA_POS    (2U)
#define RF_GAIN_CTRL0_GC_LNA_LEN    (3U)
#define RF_GAIN_CTRL0_GC_LNA_MSK    (((1U << RF_GAIN_CTRL0_GC_LNA_LEN) - 1) << RF_GAIN_CTRL0_GC_LNA_POS)
#define RF_GAIN_CTRL0_GC_LNA_UMSK   (~(((1U << RF_GAIN_CTRL0_GC_LNA_LEN) - 1) << RF_GAIN_CTRL0_GC_LNA_POS))
#define RF_GAIN_CTRL1_GC_RMXGM      RF_GAIN_CTRL1_GC_RMXGM
#define RF_GAIN_CTRL1_GC_RMXGM_POS  (5U)
#define RF_GAIN_CTRL1_GC_RMXGM_LEN  (2U)
#define RF_GAIN_CTRL1_GC_RMXGM_MSK  (((1U << RF_GAIN_CTRL1_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL1_GC_RMXGM_POS)
#define RF_GAIN_CTRL1_GC_RMXGM_UMSK (~(((1U << RF_GAIN_CTRL1_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL1_GC_RMXGM_POS))
#define RF_GAIN_CTRL1_GC_LNA        RF_GAIN_CTRL1_GC_LNA
#define RF_GAIN_CTRL1_GC_LNA_POS    (7U)
#define RF_GAIN_CTRL1_GC_LNA_LEN    (3U)
#define RF_GAIN_CTRL1_GC_LNA_MSK    (((1U << RF_GAIN_CTRL1_GC_LNA_LEN) - 1) << RF_GAIN_CTRL1_GC_LNA_POS)
#define RF_GAIN_CTRL1_GC_LNA_UMSK   (~(((1U << RF_GAIN_CTRL1_GC_LNA_LEN) - 1) << RF_GAIN_CTRL1_GC_LNA_POS))
#define RF_GAIN_CTRL2_GC_RMXGM      RF_GAIN_CTRL2_GC_RMXGM
#define RF_GAIN_CTRL2_GC_RMXGM_POS  (10U)
#define RF_GAIN_CTRL2_GC_RMXGM_LEN  (2U)
#define RF_GAIN_CTRL2_GC_RMXGM_MSK  (((1U << RF_GAIN_CTRL2_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL2_GC_RMXGM_POS)
#define RF_GAIN_CTRL2_GC_RMXGM_UMSK (~(((1U << RF_GAIN_CTRL2_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL2_GC_RMXGM_POS))
#define RF_GAIN_CTRL2_GC_LNA        RF_GAIN_CTRL2_GC_LNA
#define RF_GAIN_CTRL2_GC_LNA_POS    (12U)
#define RF_GAIN_CTRL2_GC_LNA_LEN    (3U)
#define RF_GAIN_CTRL2_GC_LNA_MSK    (((1U << RF_GAIN_CTRL2_GC_LNA_LEN) - 1) << RF_GAIN_CTRL2_GC_LNA_POS)
#define RF_GAIN_CTRL2_GC_LNA_UMSK   (~(((1U << RF_GAIN_CTRL2_GC_LNA_LEN) - 1) << RF_GAIN_CTRL2_GC_LNA_POS))
#define RF_GAIN_CTRL3_GC_RMXGM      RF_GAIN_CTRL3_GC_RMXGM
#define RF_GAIN_CTRL3_GC_RMXGM_POS  (15U)
#define RF_GAIN_CTRL3_GC_RMXGM_LEN  (2U)
#define RF_GAIN_CTRL3_GC_RMXGM_MSK  (((1U << RF_GAIN_CTRL3_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL3_GC_RMXGM_POS)
#define RF_GAIN_CTRL3_GC_RMXGM_UMSK (~(((1U << RF_GAIN_CTRL3_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL3_GC_RMXGM_POS))
#define RF_GAIN_CTRL3_GC_LNA        RF_GAIN_CTRL3_GC_LNA
#define RF_GAIN_CTRL3_GC_LNA_POS    (17U)
#define RF_GAIN_CTRL3_GC_LNA_LEN    (3U)
#define RF_GAIN_CTRL3_GC_LNA_MSK    (((1U << RF_GAIN_CTRL3_GC_LNA_LEN) - 1) << RF_GAIN_CTRL3_GC_LNA_POS)
#define RF_GAIN_CTRL3_GC_LNA_UMSK   (~(((1U << RF_GAIN_CTRL3_GC_LNA_LEN) - 1) << RF_GAIN_CTRL3_GC_LNA_POS))
#define RF_GAIN_CTRL4_GC_RMXGM      RF_GAIN_CTRL4_GC_RMXGM
#define RF_GAIN_CTRL4_GC_RMXGM_POS  (20U)
#define RF_GAIN_CTRL4_GC_RMXGM_LEN  (2U)
#define RF_GAIN_CTRL4_GC_RMXGM_MSK  (((1U << RF_GAIN_CTRL4_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL4_GC_RMXGM_POS)
#define RF_GAIN_CTRL4_GC_RMXGM_UMSK (~(((1U << RF_GAIN_CTRL4_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL4_GC_RMXGM_POS))
#define RF_GAIN_CTRL4_GC_LNA        RF_GAIN_CTRL4_GC_LNA
#define RF_GAIN_CTRL4_GC_LNA_POS    (22U)
#define RF_GAIN_CTRL4_GC_LNA_LEN    (3U)
#define RF_GAIN_CTRL4_GC_LNA_MSK    (((1U << RF_GAIN_CTRL4_GC_LNA_LEN) - 1) << RF_GAIN_CTRL4_GC_LNA_POS)
#define RF_GAIN_CTRL4_GC_LNA_UMSK   (~(((1U << RF_GAIN_CTRL4_GC_LNA_LEN) - 1) << RF_GAIN_CTRL4_GC_LNA_POS))
#define RF_GAIN_CTRL5_GC_RMXGM      RF_GAIN_CTRL5_GC_RMXGM
#define RF_GAIN_CTRL5_GC_RMXGM_POS  (25U)
#define RF_GAIN_CTRL5_GC_RMXGM_LEN  (2U)
#define RF_GAIN_CTRL5_GC_RMXGM_MSK  (((1U << RF_GAIN_CTRL5_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL5_GC_RMXGM_POS)
#define RF_GAIN_CTRL5_GC_RMXGM_UMSK (~(((1U << RF_GAIN_CTRL5_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL5_GC_RMXGM_POS))
#define RF_GAIN_CTRL5_GC_LNA        RF_GAIN_CTRL5_GC_LNA
#define RF_GAIN_CTRL5_GC_LNA_POS    (27U)
#define RF_GAIN_CTRL5_GC_LNA_LEN    (3U)
#define RF_GAIN_CTRL5_GC_LNA_MSK    (((1U << RF_GAIN_CTRL5_GC_LNA_LEN) - 1) << RF_GAIN_CTRL5_GC_LNA_POS)
#define RF_GAIN_CTRL5_GC_LNA_UMSK   (~(((1U << RF_GAIN_CTRL5_GC_LNA_LEN) - 1) << RF_GAIN_CTRL5_GC_LNA_POS))

/* 0xFC : rrf_gain_index2 */
#define RF_RRF_GAIN_INDEX2_OFFSET   (0xFC)
#define RF_GAIN_CTRL8_GC_RMXGM      RF_GAIN_CTRL8_GC_RMXGM
#define RF_GAIN_CTRL8_GC_RMXGM_POS  (0U)
#define RF_GAIN_CTRL8_GC_RMXGM_LEN  (2U)
#define RF_GAIN_CTRL8_GC_RMXGM_MSK  (((1U << RF_GAIN_CTRL8_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL8_GC_RMXGM_POS)
#define RF_GAIN_CTRL8_GC_RMXGM_UMSK (~(((1U << RF_GAIN_CTRL8_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL8_GC_RMXGM_POS))
#define RF_GAIN_CTRL8_GC_LNA        RF_GAIN_CTRL8_GC_LNA
#define RF_GAIN_CTRL8_GC_LNA_POS    (2U)
#define RF_GAIN_CTRL8_GC_LNA_LEN    (3U)
#define RF_GAIN_CTRL8_GC_LNA_MSK    (((1U << RF_GAIN_CTRL8_GC_LNA_LEN) - 1) << RF_GAIN_CTRL8_GC_LNA_POS)
#define RF_GAIN_CTRL8_GC_LNA_UMSK   (~(((1U << RF_GAIN_CTRL8_GC_LNA_LEN) - 1) << RF_GAIN_CTRL8_GC_LNA_POS))
#define RF_GAIN_CTRL7_GC_RMXGM      RF_GAIN_CTRL7_GC_RMXGM
#define RF_GAIN_CTRL7_GC_RMXGM_POS  (5U)
#define RF_GAIN_CTRL7_GC_RMXGM_LEN  (2U)
#define RF_GAIN_CTRL7_GC_RMXGM_MSK  (((1U << RF_GAIN_CTRL7_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL7_GC_RMXGM_POS)
#define RF_GAIN_CTRL7_GC_RMXGM_UMSK (~(((1U << RF_GAIN_CTRL7_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL7_GC_RMXGM_POS))
#define RF_GAIN_CTRL7_GC_LNA        RF_GAIN_CTRL7_GC_LNA
#define RF_GAIN_CTRL7_GC_LNA_POS    (7U)
#define RF_GAIN_CTRL7_GC_LNA_LEN    (3U)
#define RF_GAIN_CTRL7_GC_LNA_MSK    (((1U << RF_GAIN_CTRL7_GC_LNA_LEN) - 1) << RF_GAIN_CTRL7_GC_LNA_POS)
#define RF_GAIN_CTRL7_GC_LNA_UMSK   (~(((1U << RF_GAIN_CTRL7_GC_LNA_LEN) - 1) << RF_GAIN_CTRL7_GC_LNA_POS))
#define RF_GAIN_CTRL6_GC_RMXGM      RF_GAIN_CTRL6_GC_RMXGM
#define RF_GAIN_CTRL6_GC_RMXGM_POS  (10U)
#define RF_GAIN_CTRL6_GC_RMXGM_LEN  (2U)
#define RF_GAIN_CTRL6_GC_RMXGM_MSK  (((1U << RF_GAIN_CTRL6_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL6_GC_RMXGM_POS)
#define RF_GAIN_CTRL6_GC_RMXGM_UMSK (~(((1U << RF_GAIN_CTRL6_GC_RMXGM_LEN) - 1) << RF_GAIN_CTRL6_GC_RMXGM_POS))
#define RF_GAIN_CTRL6_GC_LNA        RF_GAIN_CTRL6_GC_LNA
#define RF_GAIN_CTRL6_GC_LNA_POS    (12U)
#define RF_GAIN_CTRL6_GC_LNA_LEN    (3U)
#define RF_GAIN_CTRL6_GC_LNA_MSK    (((1U << RF_GAIN_CTRL6_GC_LNA_LEN) - 1) << RF_GAIN_CTRL6_GC_LNA_POS)
#define RF_GAIN_CTRL6_GC_LNA_UMSK   (~(((1U << RF_GAIN_CTRL6_GC_LNA_LEN) - 1) << RF_GAIN_CTRL6_GC_LNA_POS))

/* 0x100 : lna_ctrl_hw_mux */
#define RF_LNA_CTRL_HW_MUX_OFFSET (0x100)
#define RF_LNA_BM_HG              RF_LNA_BM_HG
#define RF_LNA_BM_HG_POS          (0U)
#define RF_LNA_BM_HG_LEN          (4U)
#define RF_LNA_BM_HG_MSK          (((1U << RF_LNA_BM_HG_LEN) - 1) << RF_LNA_BM_HG_POS)
#define RF_LNA_BM_HG_UMSK         (~(((1U << RF_LNA_BM_HG_LEN) - 1) << RF_LNA_BM_HG_POS))
#define RF_LNA_BM_LG              RF_LNA_BM_LG
#define RF_LNA_BM_LG_POS          (4U)
#define RF_LNA_BM_LG_LEN          (4U)
#define RF_LNA_BM_LG_MSK          (((1U << RF_LNA_BM_LG_LEN) - 1) << RF_LNA_BM_LG_POS)
#define RF_LNA_BM_LG_UMSK         (~(((1U << RF_LNA_BM_LG_LEN) - 1) << RF_LNA_BM_LG_POS))
#define RF_LNA_LOAD_CSW_HG        RF_LNA_LOAD_CSW_HG
#define RF_LNA_LOAD_CSW_HG_POS    (8U)
#define RF_LNA_LOAD_CSW_HG_LEN    (4U)
#define RF_LNA_LOAD_CSW_HG_MSK    (((1U << RF_LNA_LOAD_CSW_HG_LEN) - 1) << RF_LNA_LOAD_CSW_HG_POS)
#define RF_LNA_LOAD_CSW_HG_UMSK   (~(((1U << RF_LNA_LOAD_CSW_HG_LEN) - 1) << RF_LNA_LOAD_CSW_HG_POS))
#define RF_LNA_LOAD_CSW_LG        RF_LNA_LOAD_CSW_LG
#define RF_LNA_LOAD_CSW_LG_POS    (12U)
#define RF_LNA_LOAD_CSW_LG_LEN    (4U)
#define RF_LNA_LOAD_CSW_LG_MSK    (((1U << RF_LNA_LOAD_CSW_LG_LEN) - 1) << RF_LNA_LOAD_CSW_LG_POS)
#define RF_LNA_LOAD_CSW_LG_UMSK   (~(((1U << RF_LNA_LOAD_CSW_LG_LEN) - 1) << RF_LNA_LOAD_CSW_LG_POS))

/* 0x104 : rbb_gain_index1 */
#define RF_RBB_GAIN_INDEX1_OFFSET  (0x104)
#define RF_GAIN_CTRL0_GC_RBB1      RF_GAIN_CTRL0_GC_RBB1
#define RF_GAIN_CTRL0_GC_RBB1_POS  (0U)
#define RF_GAIN_CTRL0_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL0_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL0_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL0_GC_RBB1_POS)
#define RF_GAIN_CTRL0_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL0_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL0_GC_RBB1_POS))
#define RF_GAIN_CTRL0_GC_RBB2      RF_GAIN_CTRL0_GC_RBB2
#define RF_GAIN_CTRL0_GC_RBB2_POS  (4U)
#define RF_GAIN_CTRL0_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL0_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL0_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL0_GC_RBB2_POS)
#define RF_GAIN_CTRL0_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL0_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL0_GC_RBB2_POS))
#define RF_GAIN_CTRL1_GC_RBB1      RF_GAIN_CTRL1_GC_RBB1
#define RF_GAIN_CTRL1_GC_RBB1_POS  (8U)
#define RF_GAIN_CTRL1_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL1_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL1_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL1_GC_RBB1_POS)
#define RF_GAIN_CTRL1_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL1_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL1_GC_RBB1_POS))
#define RF_GAIN_CTRL1_GC_RBB2      RF_GAIN_CTRL1_GC_RBB2
#define RF_GAIN_CTRL1_GC_RBB2_POS  (12U)
#define RF_GAIN_CTRL1_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL1_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL1_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL1_GC_RBB2_POS)
#define RF_GAIN_CTRL1_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL1_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL1_GC_RBB2_POS))
#define RF_GAIN_CTRL2_GC_RBB1      RF_GAIN_CTRL2_GC_RBB1
#define RF_GAIN_CTRL2_GC_RBB1_POS  (16U)
#define RF_GAIN_CTRL2_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL2_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL2_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL2_GC_RBB1_POS)
#define RF_GAIN_CTRL2_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL2_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL2_GC_RBB1_POS))
#define RF_GAIN_CTRL2_GC_RBB2      RF_GAIN_CTRL2_GC_RBB2
#define RF_GAIN_CTRL2_GC_RBB2_POS  (20U)
#define RF_GAIN_CTRL2_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL2_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL2_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL2_GC_RBB2_POS)
#define RF_GAIN_CTRL2_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL2_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL2_GC_RBB2_POS))
#define RF_GAIN_CTRL3_GC_RBB1      RF_GAIN_CTRL3_GC_RBB1
#define RF_GAIN_CTRL3_GC_RBB1_POS  (24U)
#define RF_GAIN_CTRL3_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL3_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL3_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL3_GC_RBB1_POS)
#define RF_GAIN_CTRL3_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL3_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL3_GC_RBB1_POS))
#define RF_GAIN_CTRL3_GC_RBB2      RF_GAIN_CTRL3_GC_RBB2
#define RF_GAIN_CTRL3_GC_RBB2_POS  (28U)
#define RF_GAIN_CTRL3_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL3_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL3_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL3_GC_RBB2_POS)
#define RF_GAIN_CTRL3_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL3_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL3_GC_RBB2_POS))

