bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x108 : rbb_gain_index2 */
#define RF_RBB_GAIN_INDEX2_OFFSET  (0x108)
#define RF_GAIN_CTRL4_GC_RBB1      RF_GAIN_CTRL4_GC_RBB1
#define RF_GAIN_CTRL4_GC_RBB1_POS  (0U)
#define RF_GAIN_CTRL4_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL4_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL4_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL4_GC_RBB1_POS)
#define RF_GAIN_CTRL4_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL4_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL4_GC_RBB1_POS))
#define RF_GAIN_CTRL4_GC_RBB2      RF_GAIN_CTRL4_GC_RBB2
#define RF_GAIN_CTRL4_GC_RBB2_POS  (4U)
#define RF_GAIN_CTRL4_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL4_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL4_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL4_GC_RBB2_POS)
#define RF_GAIN_CTRL4_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL4_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL4_GC_RBB2_POS))
#define RF_GAIN_CTRL5_GC_RBB1      RF_GAIN_CTRL5_GC_RBB1
#define RF_GAIN_CTRL5_GC_RBB1_POS  (8U)
#define RF_GAIN_CTRL5_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL5_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL5_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL5_GC_RBB1_POS)
#define RF_GAIN_CTRL5_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL5_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL5_GC_RBB1_POS))
#define RF_GAIN_CTRL5_GC_RBB2      RF_GAIN_CTRL5_GC_RBB2
#define RF_GAIN_CTRL5_GC_RBB2_POS  (12U)
#define RF_GAIN_CTRL5_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL5_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL5_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL5_GC_RBB2_POS)
#define RF_GAIN_CTRL5_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL5_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL5_GC_RBB2_POS))
#define RF_GAIN_CTRL6_GC_RBB1      RF_GAIN_CTRL6_GC_RBB1
#define RF_GAIN_CTRL6_GC_RBB1_POS  (16U)
#define RF_GAIN_CTRL6_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL6_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL6_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL6_GC_RBB1_POS)
#define RF_GAIN_CTRL6_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL6_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL6_GC_RBB1_POS))
#define RF_GAIN_CTRL6_GC_RBB2      RF_GAIN_CTRL6_GC_RBB2
#define RF_GAIN_CTRL6_GC_RBB2_POS  (20U)
#define RF_GAIN_CTRL6_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL6_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL6_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL6_GC_RBB2_POS)
#define RF_GAIN_CTRL6_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL6_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL6_GC_RBB2_POS))
#define RF_GAIN_CTRL7_GC_RBB1      RF_GAIN_CTRL7_GC_RBB1
#define RF_GAIN_CTRL7_GC_RBB1_POS  (24U)
#define RF_GAIN_CTRL7_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL7_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL7_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL7_GC_RBB1_POS)
#define RF_GAIN_CTRL7_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL7_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL7_GC_RBB1_POS))
#define RF_GAIN_CTRL7_GC_RBB2      RF_GAIN_CTRL7_GC_RBB2
#define RF_GAIN_CTRL7_GC_RBB2_POS  (28U)
#define RF_GAIN_CTRL7_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL7_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL7_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL7_GC_RBB2_POS)
#define RF_GAIN_CTRL7_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL7_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL7_GC_RBB2_POS))

/* 0x10C : rbb_gain_index3 */
#define RF_RBB_GAIN_INDEX3_OFFSET   (0x10C)
#define RF_GAIN_CTRL8_GC_RBB1       RF_GAIN_CTRL8_GC_RBB1
#define RF_GAIN_CTRL8_GC_RBB1_POS   (0U)
#define RF_GAIN_CTRL8_GC_RBB1_LEN   (2U)
#define RF_GAIN_CTRL8_GC_RBB1_MSK   (((1U << RF_GAIN_CTRL8_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL8_GC_RBB1_POS)
#define RF_GAIN_CTRL8_GC_RBB1_UMSK  (~(((1U << RF_GAIN_CTRL8_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL8_GC_RBB1_POS))
#define RF_GAIN_CTRL8_GC_RBB2       RF_GAIN_CTRL8_GC_RBB2
#define RF_GAIN_CTRL8_GC_RBB2_POS   (4U)
#define RF_GAIN_CTRL8_GC_RBB2_LEN   (3U)
#define RF_GAIN_CTRL8_GC_RBB2_MSK   (((1U << RF_GAIN_CTRL8_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL8_GC_RBB2_POS)
#define RF_GAIN_CTRL8_GC_RBB2_UMSK  (~(((1U << RF_GAIN_CTRL8_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL8_GC_RBB2_POS))
#define RF_GAIN_CTRL9_GC_RBB1       RF_GAIN_CTRL9_GC_RBB1
#define RF_GAIN_CTRL9_GC_RBB1_POS   (8U)
#define RF_GAIN_CTRL9_GC_RBB1_LEN   (2U)
#define RF_GAIN_CTRL9_GC_RBB1_MSK   (((1U << RF_GAIN_CTRL9_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL9_GC_RBB1_POS)
#define RF_GAIN_CTRL9_GC_RBB1_UMSK  (~(((1U << RF_GAIN_CTRL9_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL9_GC_RBB1_POS))
#define RF_GAIN_CTRL9_GC_RBB2       RF_GAIN_CTRL9_GC_RBB2
#define RF_GAIN_CTRL9_GC_RBB2_POS   (12U)
#define RF_GAIN_CTRL9_GC_RBB2_LEN   (3U)
#define RF_GAIN_CTRL9_GC_RBB2_MSK   (((1U << RF_GAIN_CTRL9_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL9_GC_RBB2_POS)
#define RF_GAIN_CTRL9_GC_RBB2_UMSK  (~(((1U << RF_GAIN_CTRL9_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL9_GC_RBB2_POS))
#define RF_GAIN_CTRL10_GC_RBB1      RF_GAIN_CTRL10_GC_RBB1
#define RF_GAIN_CTRL10_GC_RBB1_POS  (16U)
#define RF_GAIN_CTRL10_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL10_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL10_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL10_GC_RBB1_POS)
#define RF_GAIN_CTRL10_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL10_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL10_GC_RBB1_POS))
#define RF_GAIN_CTRL10_GC_RBB2      RF_GAIN_CTRL10_GC_RBB2
#define RF_GAIN_CTRL10_GC_RBB2_POS  (20U)
#define RF_GAIN_CTRL10_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL10_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL10_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL10_GC_RBB2_POS)
#define RF_GAIN_CTRL10_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL10_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL10_GC_RBB2_POS))
#define RF_GAIN_CTRL11_GC_RBB1      RF_GAIN_CTRL11_GC_RBB1
#define RF_GAIN_CTRL11_GC_RBB1_POS  (24U)
#define RF_GAIN_CTRL11_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL11_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL11_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL11_GC_RBB1_POS)
#define RF_GAIN_CTRL11_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL11_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL11_GC_RBB1_POS))
#define RF_GAIN_CTRL11_GC_RBB2      RF_GAIN_CTRL11_GC_RBB2
#define RF_GAIN_CTRL11_GC_RBB2_POS  (28U)
#define RF_GAIN_CTRL11_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL11_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL11_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL11_GC_RBB2_POS)
#define RF_GAIN_CTRL11_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL11_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL11_GC_RBB2_POS))

/* 0x110 : rbb_gain_index4 */
#define RF_RBB_GAIN_INDEX4_OFFSET   (0x110)
#define RF_GAIN_CTRL12_GC_RBB1      RF_GAIN_CTRL12_GC_RBB1
#define RF_GAIN_CTRL12_GC_RBB1_POS  (0U)
#define RF_GAIN_CTRL12_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL12_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL12_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL12_GC_RBB1_POS)
#define RF_GAIN_CTRL12_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL12_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL12_GC_RBB1_POS))
#define RF_GAIN_CTRL12_GC_RBB2      RF_GAIN_CTRL12_GC_RBB2
#define RF_GAIN_CTRL12_GC_RBB2_POS  (4U)
#define RF_GAIN_CTRL12_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL12_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL12_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL12_GC_RBB2_POS)
#define RF_GAIN_CTRL12_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL12_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL12_GC_RBB2_POS))
#define RF_GAIN_CTRL13_GC_RBB1      RF_GAIN_CTRL13_GC_RBB1
#define RF_GAIN_CTRL13_GC_RBB1_POS  (8U)
#define RF_GAIN_CTRL13_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL13_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL13_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL13_GC_RBB1_POS)
#define RF_GAIN_CTRL13_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL13_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL13_GC_RBB1_POS))
#define RF_GAIN_CTRL13_GC_RBB2      RF_GAIN_CTRL13_GC_RBB2
#define RF_GAIN_CTRL13_GC_RBB2_POS  (12U)
#define RF_GAIN_CTRL13_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL13_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL13_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL13_GC_RBB2_POS)
#define RF_GAIN_CTRL13_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL13_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL13_GC_RBB2_POS))
#define RF_GAIN_CTRL14_GC_RBB1      RF_GAIN_CTRL14_GC_RBB1
#define RF_GAIN_CTRL14_GC_RBB1_POS  (16U)
#define RF_GAIN_CTRL14_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL14_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL14_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL14_GC_RBB1_POS)
#define RF_GAIN_CTRL14_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL14_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL14_GC_RBB1_POS))
#define RF_GAIN_CTRL14_GC_RBB2      RF_GAIN_CTRL14_GC_RBB2
#define RF_GAIN_CTRL14_GC_RBB2_POS  (20U)
#define RF_GAIN_CTRL14_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL14_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL14_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL14_GC_RBB2_POS)
#define RF_GAIN_CTRL14_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL14_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL14_GC_RBB2_POS))
#define RF_GAIN_CTRL15_GC_RBB1      RF_GAIN_CTRL15_GC_RBB1
#define RF_GAIN_CTRL15_GC_RBB1_POS  (24U)
#define RF_GAIN_CTRL15_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL15_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL15_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL15_GC_RBB1_POS)
#define RF_GAIN_CTRL15_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL15_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL15_GC_RBB1_POS))
#define RF_GAIN_CTRL15_GC_RBB2      RF_GAIN_CTRL15_GC_RBB2
#define RF_GAIN_CTRL15_GC_RBB2_POS  (28U)
#define RF_GAIN_CTRL15_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL15_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL15_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL15_GC_RBB2_POS)
#define RF_GAIN_CTRL15_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL15_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL15_GC_RBB2_POS))

/* 0x114 : rbb_gain_index5 */
#define RF_RBB_GAIN_INDEX5_OFFSET   (0x114)
#define RF_GAIN_CTRL16_GC_RBB1      RF_GAIN_CTRL16_GC_RBB1
#define RF_GAIN_CTRL16_GC_RBB1_POS  (0U)
#define RF_GAIN_CTRL16_GC_RBB1_LEN  (2U)
#define RF_GAIN_CTRL16_GC_RBB1_MSK  (((1U << RF_GAIN_CTRL16_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL16_GC_RBB1_POS)
#define RF_GAIN_CTRL16_GC_RBB1_UMSK (~(((1U << RF_GAIN_CTRL16_GC_RBB1_LEN) - 1) << RF_GAIN_CTRL16_GC_RBB1_POS))
#define RF_GAIN_CTRL16_GC_RBB2      RF_GAIN_CTRL16_GC_RBB2
#define RF_GAIN_CTRL16_GC_RBB2_POS  (4U)
#define RF_GAIN_CTRL16_GC_RBB2_LEN  (3U)
#define RF_GAIN_CTRL16_GC_RBB2_MSK  (((1U << RF_GAIN_CTRL16_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL16_GC_RBB2_POS)
#define RF_GAIN_CTRL16_GC_RBB2_UMSK (~(((1U << RF_GAIN_CTRL16_GC_RBB2_LEN) - 1) << RF_GAIN_CTRL16_GC_RBB2_POS))

/* 0x118 : tbb_gain_index1 */
#define RF_TBB_GAIN_INDEX1_OFFSET       (0x118)
#define RF_GAIN_CTRL0_GC_TBB            RF_GAIN_CTRL0_GC_TBB
#define RF_GAIN_CTRL0_GC_TBB_POS        (0U)
#define RF_GAIN_CTRL0_GC_TBB_LEN        (5U)
#define RF_GAIN_CTRL0_GC_TBB_MSK        (((1U << RF_GAIN_CTRL0_GC_TBB_LEN) - 1) << RF_GAIN_CTRL0_GC_TBB_POS)
#define RF_GAIN_CTRL0_GC_TBB_UMSK       (~(((1U << RF_GAIN_CTRL0_GC_TBB_LEN) - 1) << RF_GAIN_CTRL0_GC_TBB_POS))
#define RF_GAIN_CTRL0_GC_TMX            RF_GAIN_CTRL0_GC_TMX
#define RF_GAIN_CTRL0_GC_TMX_POS        (8U)
#define RF_GAIN_CTRL0_GC_TMX_LEN        (3U)
#define RF_GAIN_CTRL0_GC_TMX_MSK        (((1U << RF_GAIN_CTRL0_GC_TMX_LEN) - 1) << RF_GAIN_CTRL0_GC_TMX_POS)
#define RF_GAIN_CTRL0_GC_TMX_UMSK       (~(((1U << RF_GAIN_CTRL0_GC_TMX_LEN) - 1) << RF_GAIN_CTRL0_GC_TMX_POS))
#define RF_GAIN_CTRL0_DAC_BIAS_SEL      RF_GAIN_CTRL0_DAC_BIAS_SEL
#define RF_GAIN_CTRL0_DAC_BIAS_SEL_POS  (12U)
#define RF_GAIN_CTRL0_DAC_BIAS_SEL_LEN  (2U)
#define RF_GAIN_CTRL0_DAC_BIAS_SEL_MSK  (((1U << RF_GAIN_CTRL0_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL0_DAC_BIAS_SEL_POS)
#define RF_GAIN_CTRL0_DAC_BIAS_SEL_UMSK (~(((1U << RF_GAIN_CTRL0_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL0_DAC_BIAS_SEL_POS))
#define RF_GAIN_CTRL0_GC_TBB_BOOST      RF_GAIN_CTRL0_GC_TBB_BOOST
#define RF_GAIN_CTRL0_GC_TBB_BOOST_POS  (14U)
#define RF_GAIN_CTRL0_GC_TBB_BOOST_LEN  (2U)
#define RF_GAIN_CTRL0_GC_TBB_BOOST_MSK  (((1U << RF_GAIN_CTRL0_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL0_GC_TBB_BOOST_POS)
#define RF_GAIN_CTRL0_GC_TBB_BOOST_UMSK (~(((1U << RF_GAIN_CTRL0_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL0_GC_TBB_BOOST_POS))
#define RF_GAIN_CTRL1_GC_TBB            RF_GAIN_CTRL1_GC_TBB
#define RF_GAIN_CTRL1_GC_TBB_POS        (16U)
#define RF_GAIN_CTRL1_GC_TBB_LEN        (5U)
#define RF_GAIN_CTRL1_GC_TBB_MSK        (((1U << RF_GAIN_CTRL1_GC_TBB_LEN) - 1) << RF_GAIN_CTRL1_GC_TBB_POS)
#define RF_GAIN_CTRL1_GC_TBB_UMSK       (~(((1U << RF_GAIN_CTRL1_GC_TBB_LEN) - 1) << RF_GAIN_CTRL1_GC_TBB_POS))
#define RF_GAIN_CTRL1_GC_TMX            RF_GAIN_CTRL1_GC_TMX
#define RF_GAIN_CTRL1_GC_TMX_POS        (24U)
#define RF_GAIN_CTRL1_GC_TMX_LEN        (3U)
#define RF_GAIN_CTRL1_GC_TMX_MSK        (((1U << RF_GAIN_CTRL1_GC_TMX_LEN) - 1) << RF_GAIN_CTRL1_GC_TMX_POS)
#define RF_GAIN_CTRL1_GC_TMX_UMSK       (~(((1U << RF_GAIN_CTRL1_GC_TMX_LEN) - 1) << RF_GAIN_CTRL1_GC_TMX_POS))
#define RF_GAIN_CTRL1_DAC_BIAS_SEL      RF_GAIN_CTRL1_DAC_BIAS_SEL
#define RF_GAIN_CTRL1_DAC_BIAS_SEL_POS  (28U)
#define RF_GAIN_CTRL1_DAC_BIAS_SEL_LEN  (2U)
#define RF_GAIN_CTRL1_DAC_BIAS_SEL_MSK  (((1U << RF_GAIN_CTRL1_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL1_DAC_BIAS_SEL_POS)
#define RF_GAIN_CTRL1_DAC_BIAS_SEL_UMSK (~(((1U << RF_GAIN_CTRL1_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL1_DAC_BIAS_SEL_POS))
#define RF_GAIN_CTRL1_GC_TBB_BOOST      RF_GAIN_CTRL1_GC_TBB_BOOST
#define RF_GAIN_CTRL1_GC_TBB_BOOST_POS  (30U)
#define RF_GAIN_CTRL1_GC_TBB_BOOST_LEN  (2U)
#define RF_GAIN_CTRL1_GC_TBB_BOOST_MSK  (((1U << RF_GAIN_CTRL1_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL1_GC_TBB_BOOST_POS)
#define RF_GAIN_CTRL1_GC_TBB_BOOST_UMSK (~(((1U << RF_GAIN_CTRL1_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL1_GC_TBB_BOOST_POS))

