bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x11C : tbb_gain_index2 */
#define RF_TBB_GAIN_INDEX2_OFFSET       (0x11C)
#define RF_GAIN_CTRL2_GC_TBB            RF_GAIN_CTRL2_GC_TBB
#define RF_GAIN_CTRL2_GC_TBB_POS        (0U)
#define RF_GAIN_CTRL2_GC_TBB_LEN        (5U)
#define RF_GAIN_CTRL2_GC_TBB_MSK        (((1U << RF_GAIN_CTRL2_GC_TBB_LEN) - 1) << RF_GAIN_CTRL2_GC_TBB_POS)
#define RF_GAIN_CTRL2_GC_TBB_UMSK       (~(((1U << RF_GAIN_CTRL2_GC_TBB_LEN) - 1) << RF_GAIN_CTRL2_GC_TBB_POS))
#define RF_GAIN_CTRL2_GC_TMX            RF_GAIN_CTRL2_GC_TMX
#define RF_GAIN_CTRL2_GC_TMX_POS        (8U)
#define RF_GAIN_CTRL2_GC_TMX_LEN        (3U)
#define RF_GAIN_CTRL2_GC_TMX_MSK        (((1U << RF_GAIN_CTRL2_GC_TMX_LEN) - 1) << RF_GAIN_CTRL2_GC_TMX_POS)
#define RF_GAIN_CTRL2_GC_TMX_UMSK       (~(((1U << RF_GAIN_CTRL2_GC_TMX_LEN) - 1) << RF_GAIN_CTRL2_GC_TMX_POS))
#define RF_GAIN_CTRL2_DAC_BIAS_SEL      RF_GAIN_CTRL2_DAC_BIAS_SEL
#define RF_GAIN_CTRL2_DAC_BIAS_SEL_POS  (12U)
#define RF_GAIN_CTRL2_DAC_BIAS_SEL_LEN  (2U)
#define RF_GAIN_CTRL2_DAC_BIAS_SEL_MSK  (((1U << RF_GAIN_CTRL2_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL2_DAC_BIAS_SEL_POS)
#define RF_GAIN_CTRL2_DAC_BIAS_SEL_UMSK (~(((1U << RF_GAIN_CTRL2_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL2_DAC_BIAS_SEL_POS))
#define RF_GAIN_CTRL2_GC_TBB_BOOST      RF_GAIN_CTRL2_GC_TBB_BOOST
#define RF_GAIN_CTRL2_GC_TBB_BOOST_POS  (14U)
#define RF_GAIN_CTRL2_GC_TBB_BOOST_LEN  (2U)
#define RF_GAIN_CTRL2_GC_TBB_BOOST_MSK  (((1U << RF_GAIN_CTRL2_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL2_GC_TBB_BOOST_POS)
#define RF_GAIN_CTRL2_GC_TBB_BOOST_UMSK (~(((1U << RF_GAIN_CTRL2_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL2_GC_TBB_BOOST_POS))
#define RF_GAIN_CTRL3_GC_TBB            RF_GAIN_CTRL3_GC_TBB
#define RF_GAIN_CTRL3_GC_TBB_POS        (16U)
#define RF_GAIN_CTRL3_GC_TBB_LEN        (5U)
#define RF_GAIN_CTRL3_GC_TBB_MSK        (((1U << RF_GAIN_CTRL3_GC_TBB_LEN) - 1) << RF_GAIN_CTRL3_GC_TBB_POS)
#define RF_GAIN_CTRL3_GC_TBB_UMSK       (~(((1U << RF_GAIN_CTRL3_GC_TBB_LEN) - 1) << RF_GAIN_CTRL3_GC_TBB_POS))
#define RF_GAIN_CTRL3_GC_TMX            RF_GAIN_CTRL3_GC_TMX
#define RF_GAIN_CTRL3_GC_TMX_POS        (24U)
#define RF_GAIN_CTRL3_GC_TMX_LEN        (3U)
#define RF_GAIN_CTRL3_GC_TMX_MSK        (((1U << RF_GAIN_CTRL3_GC_TMX_LEN) - 1) << RF_GAIN_CTRL3_GC_TMX_POS)
#define RF_GAIN_CTRL3_GC_TMX_UMSK       (~(((1U << RF_GAIN_CTRL3_GC_TMX_LEN) - 1) << RF_GAIN_CTRL3_GC_TMX_POS))
#define RF_GAIN_CTRL3_DAC_BIAS_SEL      RF_GAIN_CTRL3_DAC_BIAS_SEL
#define RF_GAIN_CTRL3_DAC_BIAS_SEL_POS  (28U)
#define RF_GAIN_CTRL3_DAC_BIAS_SEL_LEN  (2U)
#define RF_GAIN_CTRL3_DAC_BIAS_SEL_MSK  (((1U << RF_GAIN_CTRL3_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL3_DAC_BIAS_SEL_POS)
#define RF_GAIN_CTRL3_DAC_BIAS_SEL_UMSK (~(((1U << RF_GAIN_CTRL3_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL3_DAC_BIAS_SEL_POS))
#define RF_GAIN_CTRL3_GC_TBB_BOOST      RF_GAIN_CTRL3_GC_TBB_BOOST
#define RF_GAIN_CTRL3_GC_TBB_BOOST_POS  (30U)
#define RF_GAIN_CTRL3_GC_TBB_BOOST_LEN  (2U)
#define RF_GAIN_CTRL3_GC_TBB_BOOST_MSK  (((1U << RF_GAIN_CTRL3_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL3_GC_TBB_BOOST_POS)
#define RF_GAIN_CTRL3_GC_TBB_BOOST_UMSK (~(((1U << RF_GAIN_CTRL3_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL3_GC_TBB_BOOST_POS))

/* 0x120 : tbb_gain_index3 */
#define RF_TBB_GAIN_INDEX3_OFFSET       (0x120)
#define RF_GAIN_CTRL4_GC_TBB            RF_GAIN_CTRL4_GC_TBB
#define RF_GAIN_CTRL4_GC_TBB_POS        (0U)
#define RF_GAIN_CTRL4_GC_TBB_LEN        (5U)
#define RF_GAIN_CTRL4_GC_TBB_MSK        (((1U << RF_GAIN_CTRL4_GC_TBB_LEN) - 1) << RF_GAIN_CTRL4_GC_TBB_POS)
#define RF_GAIN_CTRL4_GC_TBB_UMSK       (~(((1U << RF_GAIN_CTRL4_GC_TBB_LEN) - 1) << RF_GAIN_CTRL4_GC_TBB_POS))
#define RF_GAIN_CTRL4_GC_TMX            RF_GAIN_CTRL4_GC_TMX
#define RF_GAIN_CTRL4_GC_TMX_POS        (8U)
#define RF_GAIN_CTRL4_GC_TMX_LEN        (3U)
#define RF_GAIN_CTRL4_GC_TMX_MSK        (((1U << RF_GAIN_CTRL4_GC_TMX_LEN) - 1) << RF_GAIN_CTRL4_GC_TMX_POS)
#define RF_GAIN_CTRL4_GC_TMX_UMSK       (~(((1U << RF_GAIN_CTRL4_GC_TMX_LEN) - 1) << RF_GAIN_CTRL4_GC_TMX_POS))
#define RF_GAIN_CTRL4_DAC_BIAS_SEL      RF_GAIN_CTRL4_DAC_BIAS_SEL
#define RF_GAIN_CTRL4_DAC_BIAS_SEL_POS  (12U)
#define RF_GAIN_CTRL4_DAC_BIAS_SEL_LEN  (2U)
#define RF_GAIN_CTRL4_DAC_BIAS_SEL_MSK  (((1U << RF_GAIN_CTRL4_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL4_DAC_BIAS_SEL_POS)
#define RF_GAIN_CTRL4_DAC_BIAS_SEL_UMSK (~(((1U << RF_GAIN_CTRL4_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL4_DAC_BIAS_SEL_POS))
#define RF_GAIN_CTRL4_GC_TBB_BOOST      RF_GAIN_CTRL4_GC_TBB_BOOST
#define RF_GAIN_CTRL4_GC_TBB_BOOST_POS  (14U)
#define RF_GAIN_CTRL4_GC_TBB_BOOST_LEN  (2U)
#define RF_GAIN_CTRL4_GC_TBB_BOOST_MSK  (((1U << RF_GAIN_CTRL4_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL4_GC_TBB_BOOST_POS)
#define RF_GAIN_CTRL4_GC_TBB_BOOST_UMSK (~(((1U << RF_GAIN_CTRL4_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL4_GC_TBB_BOOST_POS))
#define RF_GAIN_CTRL5_GC_TBB            RF_GAIN_CTRL5_GC_TBB
#define RF_GAIN_CTRL5_GC_TBB_POS        (16U)
#define RF_GAIN_CTRL5_GC_TBB_LEN        (5U)
#define RF_GAIN_CTRL5_GC_TBB_MSK        (((1U << RF_GAIN_CTRL5_GC_TBB_LEN) - 1) << RF_GAIN_CTRL5_GC_TBB_POS)
#define RF_GAIN_CTRL5_GC_TBB_UMSK       (~(((1U << RF_GAIN_CTRL5_GC_TBB_LEN) - 1) << RF_GAIN_CTRL5_GC_TBB_POS))
#define RF_GAIN_CTRL5_GC_TMX            RF_GAIN_CTRL5_GC_TMX
#define RF_GAIN_CTRL5_GC_TMX_POS        (24U)
#define RF_GAIN_CTRL5_GC_TMX_LEN        (3U)
#define RF_GAIN_CTRL5_GC_TMX_MSK        (((1U << RF_GAIN_CTRL5_GC_TMX_LEN) - 1) << RF_GAIN_CTRL5_GC_TMX_POS)
#define RF_GAIN_CTRL5_GC_TMX_UMSK       (~(((1U << RF_GAIN_CTRL5_GC_TMX_LEN) - 1) << RF_GAIN_CTRL5_GC_TMX_POS))
#define RF_GAIN_CTRL5_DAC_BIAS_SEL      RF_GAIN_CTRL5_DAC_BIAS_SEL
#define RF_GAIN_CTRL5_DAC_BIAS_SEL_POS  (28U)
#define RF_GAIN_CTRL5_DAC_BIAS_SEL_LEN  (2U)
#define RF_GAIN_CTRL5_DAC_BIAS_SEL_MSK  (((1U << RF_GAIN_CTRL5_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL5_DAC_BIAS_SEL_POS)
#define RF_GAIN_CTRL5_DAC_BIAS_SEL_UMSK (~(((1U << RF_GAIN_CTRL5_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL5_DAC_BIAS_SEL_POS))
#define RF_GAIN_CTRL5_GC_TBB_BOOST      RF_GAIN_CTRL5_GC_TBB_BOOST
#define RF_GAIN_CTRL5_GC_TBB_BOOST_POS  (30U)
#define RF_GAIN_CTRL5_GC_TBB_BOOST_LEN  (2U)
#define RF_GAIN_CTRL5_GC_TBB_BOOST_MSK  (((1U << RF_GAIN_CTRL5_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL5_GC_TBB_BOOST_POS)
#define RF_GAIN_CTRL5_GC_TBB_BOOST_UMSK (~(((1U << RF_GAIN_CTRL5_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL5_GC_TBB_BOOST_POS))

