bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x124 : tbb_gain_index4 */
#define RF_TBB_GAIN_INDEX4_OFFSET       (0x124)
#define RF_GAIN_CTRL6_GC_TBB            RF_GAIN_CTRL6_GC_TBB
#define RF_GAIN_CTRL6_GC_TBB_POS        (0U)
#define RF_GAIN_CTRL6_GC_TBB_LEN        (5U)
#define RF_GAIN_CTRL6_GC_TBB_MSK        (((1U << RF_GAIN_CTRL6_GC_TBB_LEN) - 1) << RF_GAIN_CTRL6_GC_TBB_POS)
#define RF_GAIN_CTRL6_GC_TBB_UMSK       (~(((1U << RF_GAIN_CTRL6_GC_TBB_LEN) - 1) << RF_GAIN_CTRL6_GC_TBB_POS))
#define RF_GAIN_CTRL6_GC_TMX            RF_GAIN_CTRL6_GC_TMX
#define RF_GAIN_CTRL6_GC_TMX_POS        (8U)
#define RF_GAIN_CTRL6_GC_TMX_LEN        (3U)
#define RF_GAIN_CTRL6_GC_TMX_MSK        (((1U << RF_GAIN_CTRL6_GC_TMX_LEN) - 1) << RF_GAIN_CTRL6_GC_TMX_POS)
#define RF_GAIN_CTRL6_GC_TMX_UMSK       (~(((1U << RF_GAIN_CTRL6_GC_TMX_LEN) - 1) << RF_GAIN_CTRL6_GC_TMX_POS))
#define RF_GAIN_CTRL6_DAC_BIAS_SEL      RF_GAIN_CTRL6_DAC_BIAS_SEL
#define RF_GAIN_CTRL6_DAC_BIAS_SEL_POS  (12U)
#define RF_GAIN_CTRL6_DAC_BIAS_SEL_LEN  (2U)
#define RF_GAIN_CTRL6_DAC_BIAS_SEL_MSK  (((1U << RF_GAIN_CTRL6_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL6_DAC_BIAS_SEL_POS)
#define RF_GAIN_CTRL6_DAC_BIAS_SEL_UMSK (~(((1U << RF_GAIN_CTRL6_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL6_DAC_BIAS_SEL_POS))
#define RF_GAIN_CTRL6_GC_TBB_BOOST      RF_GAIN_CTRL6_GC_TBB_BOOST
#define RF_GAIN_CTRL6_GC_TBB_BOOST_POS  (14U)
#define RF_GAIN_CTRL6_GC_TBB_BOOST_LEN  (2U)
#define RF_GAIN_CTRL6_GC_TBB_BOOST_MSK  (((1U << RF_GAIN_CTRL6_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL6_GC_TBB_BOOST_POS)
#define RF_GAIN_CTRL6_GC_TBB_BOOST_UMSK (~(((1U << RF_GAIN_CTRL6_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL6_GC_TBB_BOOST_POS))
#define RF_GAIN_CTRL7_GC_TBB            RF_GAIN_CTRL7_GC_TBB
#define RF_GAIN_CTRL7_GC_TBB_POS        (16U)
#define RF_GAIN_CTRL7_GC_TBB_LEN        (5U)
#define RF_GAIN_CTRL7_GC_TBB_MSK        (((1U << RF_GAIN_CTRL7_GC_TBB_LEN) - 1) << RF_GAIN_CTRL7_GC_TBB_POS)
#define RF_GAIN_CTRL7_GC_TBB_UMSK       (~(((1U << RF_GAIN_CTRL7_GC_TBB_LEN) - 1) << RF_GAIN_CTRL7_GC_TBB_POS))
#define RF_GAIN_CTRL7_GC_TMX            RF_GAIN_CTRL7_GC_TMX
#define RF_GAIN_CTRL7_GC_TMX_POS        (24U)
#define RF_GAIN_CTRL7_GC_TMX_LEN        (3U)
#define RF_GAIN_CTRL7_GC_TMX_MSK        (((1U << RF_GAIN_CTRL7_GC_TMX_LEN) - 1) << RF_GAIN_CTRL7_GC_TMX_POS)
#define RF_GAIN_CTRL7_GC_TMX_UMSK       (~(((1U << RF_GAIN_CTRL7_GC_TMX_LEN) - 1) << RF_GAIN_CTRL7_GC_TMX_POS))
#define RF_GAIN_CTRL7_DAC_BIAS_SEL      RF_GAIN_CTRL7_DAC_BIAS_SEL
#define RF_GAIN_CTRL7_DAC_BIAS_SEL_POS  (28U)
#define RF_GAIN_CTRL7_DAC_BIAS_SEL_LEN  (2U)
#define RF_GAIN_CTRL7_DAC_BIAS_SEL_MSK  (((1U << RF_GAIN_CTRL7_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL7_DAC_BIAS_SEL_POS)
#define RF_GAIN_CTRL7_DAC_BIAS_SEL_UMSK (~(((1U << RF_GAIN_CTRL7_DAC_BIAS_SEL_LEN) - 1) << RF_GAIN_CTRL7_DAC_BIAS_SEL_POS))
#define RF_GAIN_CTRL7_GC_TBB_BOOST      RF_GAIN_CTRL7_GC_TBB_BOOST
#define RF_GAIN_CTRL7_GC_TBB_BOOST_POS  (30U)
#define RF_GAIN_CTRL7_GC_TBB_BOOST_LEN  (2U)
#define RF_GAIN_CTRL7_GC_TBB_BOOST_MSK  (((1U << RF_GAIN_CTRL7_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL7_GC_TBB_BOOST_POS)
#define RF_GAIN_CTRL7_GC_TBB_BOOST_UMSK (~(((1U << RF_GAIN_CTRL7_GC_TBB_BOOST_LEN) - 1) << RF_GAIN_CTRL7_GC_TBB_BOOST_POS))

/* 0x128 : pa_reg_ctrl_hw1 */
#define RF_PA_REG_CTRL_HW1_OFFSET (0x128)
#define RF_PA_IET_11N             RF_PA_IET_11N
#define RF_PA_IET_11N_POS         (12U)
#define RF_PA_IET_11N_LEN         (4U)
#define RF_PA_IET_11N_MSK         (((1U << RF_PA_IET_11N_LEN) - 1) << RF_PA_IET_11N_POS)
#define RF_PA_IET_11N_UMSK        (~(((1U << RF_PA_IET_11N_LEN) - 1) << RF_PA_IET_11N_POS))
#define RF_PA_VBCORE_11N          RF_PA_VBCORE_11N
#define RF_PA_VBCORE_11N_POS      (16U)
#define RF_PA_VBCORE_11N_LEN      (4U)
#define RF_PA_VBCORE_11N_MSK      (((1U << RF_PA_VBCORE_11N_LEN) - 1) << RF_PA_VBCORE_11N_POS)
#define RF_PA_VBCORE_11N_UMSK     (~(((1U << RF_PA_VBCORE_11N_LEN) - 1) << RF_PA_VBCORE_11N_POS))
#define RF_PA_VBCAS_11N           RF_PA_VBCAS_11N
#define RF_PA_VBCAS_11N_POS       (20U)
#define RF_PA_VBCAS_11N_LEN       (3U)
#define RF_PA_VBCAS_11N_MSK       (((1U << RF_PA_VBCAS_11N_LEN) - 1) << RF_PA_VBCAS_11N_POS)
#define RF_PA_VBCAS_11N_UMSK      (~(((1U << RF_PA_VBCAS_11N_LEN) - 1) << RF_PA_VBCAS_11N_POS))

/* 0x12C : pa_reg_ctrl_hw2 */
#define RF_PA_REG_CTRL_HW2_OFFSET (0x12C)
#define RF_PA_IET_11G             RF_PA_IET_11G
#define RF_PA_IET_11G_POS         (0U)
#define RF_PA_IET_11G_LEN         (4U)
#define RF_PA_IET_11G_MSK         (((1U << RF_PA_IET_11G_LEN) - 1) << RF_PA_IET_11G_POS)
#define RF_PA_IET_11G_UMSK        (~(((1U << RF_PA_IET_11G_LEN) - 1) << RF_PA_IET_11G_POS))
#define RF_PA_VBCORE_11G          RF_PA_VBCORE_11G
#define RF_PA_VBCORE_11G_POS      (4U)
#define RF_PA_VBCORE_11G_LEN      (4U)
#define RF_PA_VBCORE_11G_MSK      (((1U << RF_PA_VBCORE_11G_LEN) - 1) << RF_PA_VBCORE_11G_POS)
#define RF_PA_VBCORE_11G_UMSK     (~(((1U << RF_PA_VBCORE_11G_LEN) - 1) << RF_PA_VBCORE_11G_POS))
#define RF_PA_VBCAS_11G           RF_PA_VBCAS_11G
#define RF_PA_VBCAS_11G_POS       (8U)
#define RF_PA_VBCAS_11G_LEN       (3U)
#define RF_PA_VBCAS_11G_MSK       (((1U << RF_PA_VBCAS_11G_LEN) - 1) << RF_PA_VBCAS_11G_POS)
#define RF_PA_VBCAS_11G_UMSK      (~(((1U << RF_PA_VBCAS_11G_LEN) - 1) << RF_PA_VBCAS_11G_POS))
#define RF_PA_IET_11B             RF_PA_IET_11B
#define RF_PA_IET_11B_POS         (12U)
#define RF_PA_IET_11B_LEN         (4U)
#define RF_PA_IET_11B_MSK         (((1U << RF_PA_IET_11B_LEN) - 1) << RF_PA_IET_11B_POS)
#define RF_PA_IET_11B_UMSK        (~(((1U << RF_PA_IET_11B_LEN) - 1) << RF_PA_IET_11B_POS))
#define RF_PA_VBCORE_11B          RF_PA_VBCORE_11B
#define RF_PA_VBCORE_11B_POS      (16U)
#define RF_PA_VBCORE_11B_LEN      (4U)
#define RF_PA_VBCORE_11B_MSK      (((1U << RF_PA_VBCORE_11B_LEN) - 1) << RF_PA_VBCORE_11B_POS)
#define RF_PA_VBCORE_11B_UMSK     (~(((1U << RF_PA_VBCORE_11B_LEN) - 1) << RF_PA_VBCORE_11B_POS))
#define RF_PA_VBCAS_11B           RF_PA_VBCAS_11B
#define RF_PA_VBCAS_11B_POS       (20U)
#define RF_PA_VBCAS_11B_LEN       (3U)
#define RF_PA_VBCAS_11B_MSK       (((1U << RF_PA_VBCAS_11B_LEN) - 1) << RF_PA_VBCAS_11B_POS)
#define RF_PA_VBCAS_11B_UMSK      (~(((1U << RF_PA_VBCAS_11B_LEN) - 1) << RF_PA_VBCAS_11B_POS))

/* 0x130 : pa_reg_wifi_ctrl_hw */
#define RF_PA_REG_WIFI_CTRL_HW_OFFSET (0x130)
#define RF_PA_HALF_ON_WIFI            RF_PA_HALF_ON_WIFI
#define RF_PA_HALF_ON_WIFI_POS        (0U)
#define RF_PA_HALF_ON_WIFI_LEN        (1U)
#define RF_PA_HALF_ON_WIFI_MSK        (((1U << RF_PA_HALF_ON_WIFI_LEN) - 1) << RF_PA_HALF_ON_WIFI_POS)
#define RF_PA_HALF_ON_WIFI_UMSK       (~(((1U << RF_PA_HALF_ON_WIFI_LEN) - 1) << RF_PA_HALF_ON_WIFI_POS))
#define RF_PA_ETB_EN_WIFI             RF_PA_ETB_EN_WIFI
#define RF_PA_ETB_EN_WIFI_POS         (8U)
#define RF_PA_ETB_EN_WIFI_LEN         (1U)
#define RF_PA_ETB_EN_WIFI_MSK         (((1U << RF_PA_ETB_EN_WIFI_LEN) - 1) << RF_PA_ETB_EN_WIFI_POS)
#define RF_PA_ETB_EN_WIFI_UMSK        (~(((1U << RF_PA_ETB_EN_WIFI_LEN) - 1) << RF_PA_ETB_EN_WIFI_POS))
#define RF_PA_IB_FIX_WIFI             RF_PA_IB_FIX_WIFI
#define RF_PA_IB_FIX_WIFI_POS         (16U)
#define RF_PA_IB_FIX_WIFI_LEN         (1U)
#define RF_PA_IB_FIX_WIFI_MSK         (((1U << RF_PA_IB_FIX_WIFI_LEN) - 1) << RF_PA_IB_FIX_WIFI_POS)
#define RF_PA_IB_FIX_WIFI_UMSK        (~(((1U << RF_PA_IB_FIX_WIFI_LEN) - 1) << RF_PA_IB_FIX_WIFI_POS))

/* 0x134 : adda_reg_ctrl_hw */
#define RF_ADDA_REG_CTRL_HW_OFFSET   (0x134)
#define RF_ADDA_LDO_DVDD_SEL_RX      RF_ADDA_LDO_DVDD_SEL_RX
#define RF_ADDA_LDO_DVDD_SEL_RX_POS  (0U)
#define RF_ADDA_LDO_DVDD_SEL_RX_LEN  (3U)
#define RF_ADDA_LDO_DVDD_SEL_RX_MSK  (((1U << RF_ADDA_LDO_DVDD_SEL_RX_LEN) - 1) << RF_ADDA_LDO_DVDD_SEL_RX_POS)
#define RF_ADDA_LDO_DVDD_SEL_RX_UMSK (~(((1U << RF_ADDA_LDO_DVDD_SEL_RX_LEN) - 1) << RF_ADDA_LDO_DVDD_SEL_RX_POS))
#define RF_ADDA_LDO_DVDD_SEL_TX      RF_ADDA_LDO_DVDD_SEL_TX
#define RF_ADDA_LDO_DVDD_SEL_TX_POS  (4U)
#define RF_ADDA_LDO_DVDD_SEL_TX_LEN  (3U)
#define RF_ADDA_LDO_DVDD_SEL_TX_MSK  (((1U << RF_ADDA_LDO_DVDD_SEL_TX_LEN) - 1) << RF_ADDA_LDO_DVDD_SEL_TX_POS)
#define RF_ADDA_LDO_DVDD_SEL_TX_UMSK (~(((1U << RF_ADDA_LDO_DVDD_SEL_TX_LEN) - 1) << RF_ADDA_LDO_DVDD_SEL_TX_POS))

/* 0x138 : lo_reg_ctrl_hw1 */
#define RF_LO_REG_CTRL_HW1_OFFSET      (0x138)
#define RF_LO_FBDV_HALFSTEP_EN_RX      RF_LO_FBDV_HALFSTEP_EN_RX
#define RF_LO_FBDV_HALFSTEP_EN_RX_POS  (0U)
#define RF_LO_FBDV_HALFSTEP_EN_RX_LEN  (1U)
#define RF_LO_FBDV_HALFSTEP_EN_RX_MSK  (((1U << RF_LO_FBDV_HALFSTEP_EN_RX_LEN) - 1) << RF_LO_FBDV_HALFSTEP_EN_RX_POS)
#define RF_LO_FBDV_HALFSTEP_EN_RX_UMSK (~(((1U << RF_LO_FBDV_HALFSTEP_EN_RX_LEN) - 1) << RF_LO_FBDV_HALFSTEP_EN_RX_POS))
#define RF_LO_FBDV_HALFSTEP_EN_TX      RF_LO_FBDV_HALFSTEP_EN_TX
#define RF_LO_FBDV_HALFSTEP_EN_TX_POS  (1U)
#define RF_LO_FBDV_HALFSTEP_EN_TX_LEN  (1U)
#define RF_LO_FBDV_HALFSTEP_EN_TX_MSK  (((1U << RF_LO_FBDV_HALFSTEP_EN_TX_LEN) - 1) << RF_LO_FBDV_HALFSTEP_EN_TX_POS)
#define RF_LO_FBDV_HALFSTEP_EN_TX_UMSK (~(((1U << RF_LO_FBDV_HALFSTEP_EN_TX_LEN) - 1) << RF_LO_FBDV_HALFSTEP_EN_TX_POS))
#define RF_LO_CP_SEL_RX                RF_LO_CP_SEL_RX
#define RF_LO_CP_SEL_RX_POS            (2U)
#define RF_LO_CP_SEL_RX_LEN            (1U)
#define RF_LO_CP_SEL_RX_MSK            (((1U << RF_LO_CP_SEL_RX_LEN) - 1) << RF_LO_CP_SEL_RX_POS)
#define RF_LO_CP_SEL_RX_UMSK           (~(((1U << RF_LO_CP_SEL_RX_LEN) - 1) << RF_LO_CP_SEL_RX_POS))
#define RF_LO_CP_SEL_TX                RF_LO_CP_SEL_TX
#define RF_LO_CP_SEL_TX_POS            (3U)
#define RF_LO_CP_SEL_TX_LEN            (1U)
#define RF_LO_CP_SEL_TX_MSK            (((1U << RF_LO_CP_SEL_TX_LEN) - 1) << RF_LO_CP_SEL_TX_POS)
#define RF_LO_CP_SEL_TX_UMSK           (~(((1U << RF_LO_CP_SEL_TX_LEN) - 1) << RF_LO_CP_SEL_TX_POS))
#define RF_LO_LF_CZ_RX                 RF_LO_LF_CZ_RX
#define RF_LO_LF_CZ_RX_POS             (4U)
#define RF_LO_LF_CZ_RX_LEN             (2U)
#define RF_LO_LF_CZ_RX_MSK             (((1U << RF_LO_LF_CZ_RX_LEN) - 1) << RF_LO_LF_CZ_RX_POS)
#define RF_LO_LF_CZ_RX_UMSK            (~(((1U << RF_LO_LF_CZ_RX_LEN) - 1) << RF_LO_LF_CZ_RX_POS))
#define RF_LO_LF_CZ_TX                 RF_LO_LF_CZ_TX
#define RF_LO_LF_CZ_TX_POS             (8U)
#define RF_LO_LF_CZ_TX_LEN             (2U)
#define RF_LO_LF_CZ_TX_MSK             (((1U << RF_LO_LF_CZ_TX_LEN) - 1) << RF_LO_LF_CZ_TX_POS)
#define RF_LO_LF_CZ_TX_UMSK            (~(((1U << RF_LO_LF_CZ_TX_LEN) - 1) << RF_LO_LF_CZ_TX_POS))
#define RF_LO_LF_RZ_RX                 RF_LO_LF_RZ_RX
#define RF_LO_LF_RZ_RX_POS             (12U)
#define RF_LO_LF_RZ_RX_LEN             (2U)
#define RF_LO_LF_RZ_RX_MSK             (((1U << RF_LO_LF_RZ_RX_LEN) - 1) << RF_LO_LF_RZ_RX_POS)
#define RF_LO_LF_RZ_RX_UMSK            (~(((1U << RF_LO_LF_RZ_RX_LEN) - 1) << RF_LO_LF_RZ_RX_POS))
#define RF_LO_LF_RZ_TX                 RF_LO_LF_RZ_TX
#define RF_LO_LF_RZ_TX_POS             (16U)
#define RF_LO_LF_RZ_TX_LEN             (2U)
#define RF_LO_LF_RZ_TX_MSK             (((1U << RF_LO_LF_RZ_TX_LEN) - 1) << RF_LO_LF_RZ_TX_POS)
#define RF_LO_LF_RZ_TX_UMSK            (~(((1U << RF_LO_LF_RZ_TX_LEN) - 1) << RF_LO_LF_RZ_TX_POS))
#define RF_LO_LF_R4_RX                 RF_LO_LF_R4_RX
#define RF_LO_LF_R4_RX_POS             (20U)
#define RF_LO_LF_R4_RX_LEN             (2U)
#define RF_LO_LF_R4_RX_MSK             (((1U << RF_LO_LF_R4_RX_LEN) - 1) << RF_LO_LF_R4_RX_POS)
#define RF_LO_LF_R4_RX_UMSK            (~(((1U << RF_LO_LF_R4_RX_LEN) - 1) << RF_LO_LF_R4_RX_POS))
#define RF_LO_LF_R4_TX                 RF_LO_LF_R4_TX
#define RF_LO_LF_R4_TX_POS             (24U)
#define RF_LO_LF_R4_TX_LEN             (2U)
#define RF_LO_LF_R4_TX_MSK             (((1U << RF_LO_LF_R4_TX_LEN) - 1) << RF_LO_LF_R4_TX_POS)
#define RF_LO_LF_R4_TX_UMSK            (~(((1U << RF_LO_LF_R4_TX_LEN) - 1) << RF_LO_LF_R4_TX_POS))

