bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x13C : lo_cal_ctrl_hw1 */
#define RF_LO_CAL_CTRL_HW1_OFFSET   (0x13C)
#define RF_LO_VCO_IDAC_CW_2404      RF_LO_VCO_IDAC_CW_2404
#define RF_LO_VCO_IDAC_CW_2404_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2404_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2404_MSK  (((1U << RF_LO_VCO_IDAC_CW_2404_LEN) - 1) << RF_LO_VCO_IDAC_CW_2404_POS)
#define RF_LO_VCO_IDAC_CW_2404_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2404_LEN) - 1) << RF_LO_VCO_IDAC_CW_2404_POS))
#define RF_LO_VCO_FREQ_CW_2404      RF_LO_VCO_FREQ_CW_2404
#define RF_LO_VCO_FREQ_CW_2404_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2404_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2404_MSK  (((1U << RF_LO_VCO_FREQ_CW_2404_LEN) - 1) << RF_LO_VCO_FREQ_CW_2404_POS)
#define RF_LO_VCO_FREQ_CW_2404_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2404_LEN) - 1) << RF_LO_VCO_FREQ_CW_2404_POS))
#define RF_LO_VCO_IDAC_CW_2408      RF_LO_VCO_IDAC_CW_2408
#define RF_LO_VCO_IDAC_CW_2408_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2408_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2408_MSK  (((1U << RF_LO_VCO_IDAC_CW_2408_LEN) - 1) << RF_LO_VCO_IDAC_CW_2408_POS)
#define RF_LO_VCO_IDAC_CW_2408_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2408_LEN) - 1) << RF_LO_VCO_IDAC_CW_2408_POS))
#define RF_LO_VCO_FREQ_CW_2408      RF_LO_VCO_FREQ_CW_2408
#define RF_LO_VCO_FREQ_CW_2408_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2408_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2408_MSK  (((1U << RF_LO_VCO_FREQ_CW_2408_LEN) - 1) << RF_LO_VCO_FREQ_CW_2408_POS)
#define RF_LO_VCO_FREQ_CW_2408_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2408_LEN) - 1) << RF_LO_VCO_FREQ_CW_2408_POS))

/* 0x140 : lo_cal_ctrl_hw2 */
#define RF_LO_CAL_CTRL_HW2_OFFSET   (0x140)
#define RF_LO_VCO_IDAC_CW_2412      RF_LO_VCO_IDAC_CW_2412
#define RF_LO_VCO_IDAC_CW_2412_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2412_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2412_MSK  (((1U << RF_LO_VCO_IDAC_CW_2412_LEN) - 1) << RF_LO_VCO_IDAC_CW_2412_POS)
#define RF_LO_VCO_IDAC_CW_2412_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2412_LEN) - 1) << RF_LO_VCO_IDAC_CW_2412_POS))
#define RF_LO_VCO_FREQ_CW_2412      RF_LO_VCO_FREQ_CW_2412
#define RF_LO_VCO_FREQ_CW_2412_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2412_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2412_MSK  (((1U << RF_LO_VCO_FREQ_CW_2412_LEN) - 1) << RF_LO_VCO_FREQ_CW_2412_POS)
#define RF_LO_VCO_FREQ_CW_2412_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2412_LEN) - 1) << RF_LO_VCO_FREQ_CW_2412_POS))
#define RF_LO_VCO_IDAC_CW_2416      RF_LO_VCO_IDAC_CW_2416
#define RF_LO_VCO_IDAC_CW_2416_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2416_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2416_MSK  (((1U << RF_LO_VCO_IDAC_CW_2416_LEN) - 1) << RF_LO_VCO_IDAC_CW_2416_POS)
#define RF_LO_VCO_IDAC_CW_2416_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2416_LEN) - 1) << RF_LO_VCO_IDAC_CW_2416_POS))
#define RF_LO_VCO_FREQ_CW_2416      RF_LO_VCO_FREQ_CW_2416
#define RF_LO_VCO_FREQ_CW_2416_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2416_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2416_MSK  (((1U << RF_LO_VCO_FREQ_CW_2416_LEN) - 1) << RF_LO_VCO_FREQ_CW_2416_POS)
#define RF_LO_VCO_FREQ_CW_2416_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2416_LEN) - 1) << RF_LO_VCO_FREQ_CW_2416_POS))

/* 0x144 : lo_cal_ctrl_hw3 */
#define RF_LO_CAL_CTRL_HW3_OFFSET   (0x144)
#define RF_LO_VCO_IDAC_CW_2420      RF_LO_VCO_IDAC_CW_2420
#define RF_LO_VCO_IDAC_CW_2420_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2420_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2420_MSK  (((1U << RF_LO_VCO_IDAC_CW_2420_LEN) - 1) << RF_LO_VCO_IDAC_CW_2420_POS)
#define RF_LO_VCO_IDAC_CW_2420_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2420_LEN) - 1) << RF_LO_VCO_IDAC_CW_2420_POS))
#define RF_LO_VCO_FREQ_CW_2420      RF_LO_VCO_FREQ_CW_2420
#define RF_LO_VCO_FREQ_CW_2420_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2420_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2420_MSK  (((1U << RF_LO_VCO_FREQ_CW_2420_LEN) - 1) << RF_LO_VCO_FREQ_CW_2420_POS)
#define RF_LO_VCO_FREQ_CW_2420_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2420_LEN) - 1) << RF_LO_VCO_FREQ_CW_2420_POS))
#define RF_LO_VCO_IDAC_CW_2424      RF_LO_VCO_IDAC_CW_2424
#define RF_LO_VCO_IDAC_CW_2424_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2424_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2424_MSK  (((1U << RF_LO_VCO_IDAC_CW_2424_LEN) - 1) << RF_LO_VCO_IDAC_CW_2424_POS)
#define RF_LO_VCO_IDAC_CW_2424_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2424_LEN) - 1) << RF_LO_VCO_IDAC_CW_2424_POS))
#define RF_LO_VCO_FREQ_CW_2424      RF_LO_VCO_FREQ_CW_2424
#define RF_LO_VCO_FREQ_CW_2424_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2424_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2424_MSK  (((1U << RF_LO_VCO_FREQ_CW_2424_LEN) - 1) << RF_LO_VCO_FREQ_CW_2424_POS)
#define RF_LO_VCO_FREQ_CW_2424_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2424_LEN) - 1) << RF_LO_VCO_FREQ_CW_2424_POS))

/* 0x148 : lo_cal_ctrl_hw4 */
#define RF_LO_CAL_CTRL_HW4_OFFSET   (0x148)
#define RF_LO_VCO_IDAC_CW_2428      RF_LO_VCO_IDAC_CW_2428
#define RF_LO_VCO_IDAC_CW_2428_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2428_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2428_MSK  (((1U << RF_LO_VCO_IDAC_CW_2428_LEN) - 1) << RF_LO_VCO_IDAC_CW_2428_POS)
#define RF_LO_VCO_IDAC_CW_2428_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2428_LEN) - 1) << RF_LO_VCO_IDAC_CW_2428_POS))
#define RF_LO_VCO_FREQ_CW_2428      RF_LO_VCO_FREQ_CW_2428
#define RF_LO_VCO_FREQ_CW_2428_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2428_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2428_MSK  (((1U << RF_LO_VCO_FREQ_CW_2428_LEN) - 1) << RF_LO_VCO_FREQ_CW_2428_POS)
#define RF_LO_VCO_FREQ_CW_2428_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2428_LEN) - 1) << RF_LO_VCO_FREQ_CW_2428_POS))
#define RF_LO_VCO_IDAC_CW_2432      RF_LO_VCO_IDAC_CW_2432
#define RF_LO_VCO_IDAC_CW_2432_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2432_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2432_MSK  (((1U << RF_LO_VCO_IDAC_CW_2432_LEN) - 1) << RF_LO_VCO_IDAC_CW_2432_POS)
#define RF_LO_VCO_IDAC_CW_2432_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2432_LEN) - 1) << RF_LO_VCO_IDAC_CW_2432_POS))
#define RF_LO_VCO_FREQ_CW_2432      RF_LO_VCO_FREQ_CW_2432
#define RF_LO_VCO_FREQ_CW_2432_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2432_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2432_MSK  (((1U << RF_LO_VCO_FREQ_CW_2432_LEN) - 1) << RF_LO_VCO_FREQ_CW_2432_POS)
#define RF_LO_VCO_FREQ_CW_2432_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2432_LEN) - 1) << RF_LO_VCO_FREQ_CW_2432_POS))

/* 0x14C : lo_cal_ctrl_hw5 */
#define RF_LO_CAL_CTRL_HW5_OFFSET   (0x14C)
#define RF_LO_VCO_IDAC_CW_2436      RF_LO_VCO_IDAC_CW_2436
#define RF_LO_VCO_IDAC_CW_2436_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2436_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2436_MSK  (((1U << RF_LO_VCO_IDAC_CW_2436_LEN) - 1) << RF_LO_VCO_IDAC_CW_2436_POS)
#define RF_LO_VCO_IDAC_CW_2436_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2436_LEN) - 1) << RF_LO_VCO_IDAC_CW_2436_POS))
#define RF_LO_VCO_FREQ_CW_2436      RF_LO_VCO_FREQ_CW_2436
#define RF_LO_VCO_FREQ_CW_2436_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2436_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2436_MSK  (((1U << RF_LO_VCO_FREQ_CW_2436_LEN) - 1) << RF_LO_VCO_FREQ_CW_2436_POS)
#define RF_LO_VCO_FREQ_CW_2436_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2436_LEN) - 1) << RF_LO_VCO_FREQ_CW_2436_POS))
#define RF_LO_VCO_IDAC_CW_2440      RF_LO_VCO_IDAC_CW_2440
#define RF_LO_VCO_IDAC_CW_2440_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2440_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2440_MSK  (((1U << RF_LO_VCO_IDAC_CW_2440_LEN) - 1) << RF_LO_VCO_IDAC_CW_2440_POS)
#define RF_LO_VCO_IDAC_CW_2440_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2440_LEN) - 1) << RF_LO_VCO_IDAC_CW_2440_POS))
#define RF_LO_VCO_FREQ_CW_2440      RF_LO_VCO_FREQ_CW_2440
#define RF_LO_VCO_FREQ_CW_2440_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2440_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2440_MSK  (((1U << RF_LO_VCO_FREQ_CW_2440_LEN) - 1) << RF_LO_VCO_FREQ_CW_2440_POS)
#define RF_LO_VCO_FREQ_CW_2440_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2440_LEN) - 1) << RF_LO_VCO_FREQ_CW_2440_POS))

/* 0x150 : lo_cal_ctrl_hw6 */
#define RF_LO_CAL_CTRL_HW6_OFFSET   (0x150)
#define RF_LO_VCO_IDAC_CW_2444      RF_LO_VCO_IDAC_CW_2444
#define RF_LO_VCO_IDAC_CW_2444_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2444_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2444_MSK  (((1U << RF_LO_VCO_IDAC_CW_2444_LEN) - 1) << RF_LO_VCO_IDAC_CW_2444_POS)
#define RF_LO_VCO_IDAC_CW_2444_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2444_LEN) - 1) << RF_LO_VCO_IDAC_CW_2444_POS))
#define RF_LO_VCO_FREQ_CW_2444      RF_LO_VCO_FREQ_CW_2444
#define RF_LO_VCO_FREQ_CW_2444_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2444_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2444_MSK  (((1U << RF_LO_VCO_FREQ_CW_2444_LEN) - 1) << RF_LO_VCO_FREQ_CW_2444_POS)
#define RF_LO_VCO_FREQ_CW_2444_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2444_LEN) - 1) << RF_LO_VCO_FREQ_CW_2444_POS))
#define RF_LO_VCO_IDAC_CW_2448      RF_LO_VCO_IDAC_CW_2448
#define RF_LO_VCO_IDAC_CW_2448_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2448_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2448_MSK  (((1U << RF_LO_VCO_IDAC_CW_2448_LEN) - 1) << RF_LO_VCO_IDAC_CW_2448_POS)
#define RF_LO_VCO_IDAC_CW_2448_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2448_LEN) - 1) << RF_LO_VCO_IDAC_CW_2448_POS))
#define RF_LO_VCO_FREQ_CW_2448      RF_LO_VCO_FREQ_CW_2448
#define RF_LO_VCO_FREQ_CW_2448_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2448_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2448_MSK  (((1U << RF_LO_VCO_FREQ_CW_2448_LEN) - 1) << RF_LO_VCO_FREQ_CW_2448_POS)
#define RF_LO_VCO_FREQ_CW_2448_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2448_LEN) - 1) << RF_LO_VCO_FREQ_CW_2448_POS))

/* 0x154 : lo_cal_ctrl_hw7 */
#define RF_LO_CAL_CTRL_HW7_OFFSET   (0x154)
#define RF_LO_VCO_IDAC_CW_2452      RF_LO_VCO_IDAC_CW_2452
#define RF_LO_VCO_IDAC_CW_2452_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2452_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2452_MSK  (((1U << RF_LO_VCO_IDAC_CW_2452_LEN) - 1) << RF_LO_VCO_IDAC_CW_2452_POS)
#define RF_LO_VCO_IDAC_CW_2452_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2452_LEN) - 1) << RF_LO_VCO_IDAC_CW_2452_POS))
#define RF_LO_VCO_FREQ_CW_2452      RF_LO_VCO_FREQ_CW_2452
#define RF_LO_VCO_FREQ_CW_2452_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2452_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2452_MSK  (((1U << RF_LO_VCO_FREQ_CW_2452_LEN) - 1) << RF_LO_VCO_FREQ_CW_2452_POS)
#define RF_LO_VCO_FREQ_CW_2452_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2452_LEN) - 1) << RF_LO_VCO_FREQ_CW_2452_POS))
#define RF_LO_VCO_IDAC_CW_2456      RF_LO_VCO_IDAC_CW_2456
#define RF_LO_VCO_IDAC_CW_2456_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2456_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2456_MSK  (((1U << RF_LO_VCO_IDAC_CW_2456_LEN) - 1) << RF_LO_VCO_IDAC_CW_2456_POS)
#define RF_LO_VCO_IDAC_CW_2456_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2456_LEN) - 1) << RF_LO_VCO_IDAC_CW_2456_POS))
#define RF_LO_VCO_FREQ_CW_2456      RF_LO_VCO_FREQ_CW_2456
#define RF_LO_VCO_FREQ_CW_2456_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2456_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2456_MSK  (((1U << RF_LO_VCO_FREQ_CW_2456_LEN) - 1) << RF_LO_VCO_FREQ_CW_2456_POS)
#define RF_LO_VCO_FREQ_CW_2456_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2456_LEN) - 1) << RF_LO_VCO_FREQ_CW_2456_POS))

/* 0x158 : lo_cal_ctrl_hw8 */
#define RF_LO_CAL_CTRL_HW8_OFFSET   (0x158)
#define RF_LO_VCO_IDAC_CW_2460      RF_LO_VCO_IDAC_CW_2460
#define RF_LO_VCO_IDAC_CW_2460_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2460_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2460_MSK  (((1U << RF_LO_VCO_IDAC_CW_2460_LEN) - 1) << RF_LO_VCO_IDAC_CW_2460_POS)
#define RF_LO_VCO_IDAC_CW_2460_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2460_LEN) - 1) << RF_LO_VCO_IDAC_CW_2460_POS))
#define RF_LO_VCO_FREQ_CW_2460      RF_LO_VCO_FREQ_CW_2460
#define RF_LO_VCO_FREQ_CW_2460_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2460_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2460_MSK  (((1U << RF_LO_VCO_FREQ_CW_2460_LEN) - 1) << RF_LO_VCO_FREQ_CW_2460_POS)
#define RF_LO_VCO_FREQ_CW_2460_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2460_LEN) - 1) << RF_LO_VCO_FREQ_CW_2460_POS))
#define RF_LO_VCO_IDAC_CW_2464      RF_LO_VCO_IDAC_CW_2464
#define RF_LO_VCO_IDAC_CW_2464_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2464_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2464_MSK  (((1U << RF_LO_VCO_IDAC_CW_2464_LEN) - 1) << RF_LO_VCO_IDAC_CW_2464_POS)
#define RF_LO_VCO_IDAC_CW_2464_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2464_LEN) - 1) << RF_LO_VCO_IDAC_CW_2464_POS))
#define RF_LO_VCO_FREQ_CW_2464      RF_LO_VCO_FREQ_CW_2464
#define RF_LO_VCO_FREQ_CW_2464_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2464_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2464_MSK  (((1U << RF_LO_VCO_FREQ_CW_2464_LEN) - 1) << RF_LO_VCO_FREQ_CW_2464_POS)
#define RF_LO_VCO_FREQ_CW_2464_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2464_LEN) - 1) << RF_LO_VCO_FREQ_CW_2464_POS))

/* 0x15C : lo_cal_ctrl_hw9 */
#define RF_LO_CAL_CTRL_HW9_OFFSET   (0x15C)
#define RF_LO_VCO_IDAC_CW_2468      RF_LO_VCO_IDAC_CW_2468
#define RF_LO_VCO_IDAC_CW_2468_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2468_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2468_MSK  (((1U << RF_LO_VCO_IDAC_CW_2468_LEN) - 1) << RF_LO_VCO_IDAC_CW_2468_POS)
#define RF_LO_VCO_IDAC_CW_2468_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2468_LEN) - 1) << RF_LO_VCO_IDAC_CW_2468_POS))
#define RF_LO_VCO_FREQ_CW_2468      RF_LO_VCO_FREQ_CW_2468
#define RF_LO_VCO_FREQ_CW_2468_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2468_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2468_MSK  (((1U << RF_LO_VCO_FREQ_CW_2468_LEN) - 1) << RF_LO_VCO_FREQ_CW_2468_POS)
#define RF_LO_VCO_FREQ_CW_2468_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2468_LEN) - 1) << RF_LO_VCO_FREQ_CW_2468_POS))
#define RF_LO_VCO_IDAC_CW_2472      RF_LO_VCO_IDAC_CW_2472
#define RF_LO_VCO_IDAC_CW_2472_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2472_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2472_MSK  (((1U << RF_LO_VCO_IDAC_CW_2472_LEN) - 1) << RF_LO_VCO_IDAC_CW_2472_POS)
#define RF_LO_VCO_IDAC_CW_2472_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2472_LEN) - 1) << RF_LO_VCO_IDAC_CW_2472_POS))
#define RF_LO_VCO_FREQ_CW_2472      RF_LO_VCO_FREQ_CW_2472
#define RF_LO_VCO_FREQ_CW_2472_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2472_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2472_MSK  (((1U << RF_LO_VCO_FREQ_CW_2472_LEN) - 1) << RF_LO_VCO_FREQ_CW_2472_POS)
#define RF_LO_VCO_FREQ_CW_2472_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2472_LEN) - 1) << RF_LO_VCO_FREQ_CW_2472_POS))

/* 0x160 : lo_cal_ctrl_hw10 */
#define RF_LO_CAL_CTRL_HW10_OFFSET  (0x160)
#define RF_LO_VCO_IDAC_CW_2476      RF_LO_VCO_IDAC_CW_2476
#define RF_LO_VCO_IDAC_CW_2476_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2476_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2476_MSK  (((1U << RF_LO_VCO_IDAC_CW_2476_LEN) - 1) << RF_LO_VCO_IDAC_CW_2476_POS)
#define RF_LO_VCO_IDAC_CW_2476_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2476_LEN) - 1) << RF_LO_VCO_IDAC_CW_2476_POS))
#define RF_LO_VCO_FREQ_CW_2476      RF_LO_VCO_FREQ_CW_2476
#define RF_LO_VCO_FREQ_CW_2476_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2476_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2476_MSK  (((1U << RF_LO_VCO_FREQ_CW_2476_LEN) - 1) << RF_LO_VCO_FREQ_CW_2476_POS)
#define RF_LO_VCO_FREQ_CW_2476_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2476_LEN) - 1) << RF_LO_VCO_FREQ_CW_2476_POS))
#define RF_LO_VCO_IDAC_CW_2480      RF_LO_VCO_IDAC_CW_2480
#define RF_LO_VCO_IDAC_CW_2480_POS  (16U)
#define RF_LO_VCO_IDAC_CW_2480_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2480_MSK  (((1U << RF_LO_VCO_IDAC_CW_2480_LEN) - 1) << RF_LO_VCO_IDAC_CW_2480_POS)
#define RF_LO_VCO_IDAC_CW_2480_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2480_LEN) - 1) << RF_LO_VCO_IDAC_CW_2480_POS))
#define RF_LO_VCO_FREQ_CW_2480      RF_LO_VCO_FREQ_CW_2480
#define RF_LO_VCO_FREQ_CW_2480_POS  (24U)
#define RF_LO_VCO_FREQ_CW_2480_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2480_MSK  (((1U << RF_LO_VCO_FREQ_CW_2480_LEN) - 1) << RF_LO_VCO_FREQ_CW_2480_POS)
#define RF_LO_VCO_FREQ_CW_2480_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2480_LEN) - 1) << RF_LO_VCO_FREQ_CW_2480_POS))

