bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x164 : lo_cal_ctrl_hw11 */
#define RF_LO_CAL_CTRL_HW11_OFFSET  (0x164)
#define RF_LO_VCO_IDAC_CW_2484      RF_LO_VCO_IDAC_CW_2484
#define RF_LO_VCO_IDAC_CW_2484_POS  (0U)
#define RF_LO_VCO_IDAC_CW_2484_LEN  (5U)
#define RF_LO_VCO_IDAC_CW_2484_MSK  (((1U << RF_LO_VCO_IDAC_CW_2484_LEN) - 1) << RF_LO_VCO_IDAC_CW_2484_POS)
#define RF_LO_VCO_IDAC_CW_2484_UMSK (~(((1U << RF_LO_VCO_IDAC_CW_2484_LEN) - 1) << RF_LO_VCO_IDAC_CW_2484_POS))
#define RF_LO_VCO_FREQ_CW_2484      RF_LO_VCO_FREQ_CW_2484
#define RF_LO_VCO_FREQ_CW_2484_POS  (8U)
#define RF_LO_VCO_FREQ_CW_2484_LEN  (8U)
#define RF_LO_VCO_FREQ_CW_2484_MSK  (((1U << RF_LO_VCO_FREQ_CW_2484_LEN) - 1) << RF_LO_VCO_FREQ_CW_2484_POS)
#define RF_LO_VCO_FREQ_CW_2484_UMSK (~(((1U << RF_LO_VCO_FREQ_CW_2484_LEN) - 1) << RF_LO_VCO_FREQ_CW_2484_POS))

/* 0x168 : rosdac_ctrl_hw1 */
#define RF_ROSDAC_CTRL_HW1_OFFSET (0x168)
#define RF_ROSDAC_I_GC0           RF_ROSDAC_I_GC0
#define RF_ROSDAC_I_GC0_POS       (0U)
#define RF_ROSDAC_I_GC0_LEN       (6U)
#define RF_ROSDAC_I_GC0_MSK       (((1U << RF_ROSDAC_I_GC0_LEN) - 1) << RF_ROSDAC_I_GC0_POS)
#define RF_ROSDAC_I_GC0_UMSK      (~(((1U << RF_ROSDAC_I_GC0_LEN) - 1) << RF_ROSDAC_I_GC0_POS))
#define RF_ROSDAC_Q_GC0           RF_ROSDAC_Q_GC0
#define RF_ROSDAC_Q_GC0_POS       (8U)
#define RF_ROSDAC_Q_GC0_LEN       (6U)
#define RF_ROSDAC_Q_GC0_MSK       (((1U << RF_ROSDAC_Q_GC0_LEN) - 1) << RF_ROSDAC_Q_GC0_POS)
#define RF_ROSDAC_Q_GC0_UMSK      (~(((1U << RF_ROSDAC_Q_GC0_LEN) - 1) << RF_ROSDAC_Q_GC0_POS))
#define RF_ROSDAC_I_GC1           RF_ROSDAC_I_GC1
#define RF_ROSDAC_I_GC1_POS       (16U)
#define RF_ROSDAC_I_GC1_LEN       (6U)
#define RF_ROSDAC_I_GC1_MSK       (((1U << RF_ROSDAC_I_GC1_LEN) - 1) << RF_ROSDAC_I_GC1_POS)
#define RF_ROSDAC_I_GC1_UMSK      (~(((1U << RF_ROSDAC_I_GC1_LEN) - 1) << RF_ROSDAC_I_GC1_POS))
#define RF_ROSDAC_Q_GC1           RF_ROSDAC_Q_GC1
#define RF_ROSDAC_Q_GC1_POS       (24U)
#define RF_ROSDAC_Q_GC1_LEN       (6U)
#define RF_ROSDAC_Q_GC1_MSK       (((1U << RF_ROSDAC_Q_GC1_LEN) - 1) << RF_ROSDAC_Q_GC1_POS)
#define RF_ROSDAC_Q_GC1_UMSK      (~(((1U << RF_ROSDAC_Q_GC1_LEN) - 1) << RF_ROSDAC_Q_GC1_POS))

/* 0x16C : rosdac_ctrl_hw2 */
#define RF_ROSDAC_CTRL_HW2_OFFSET (0x16C)
#define RF_ROSDAC_I_GC2           RF_ROSDAC_I_GC2
#define RF_ROSDAC_I_GC2_POS       (0U)
#define RF_ROSDAC_I_GC2_LEN       (6U)
#define RF_ROSDAC_I_GC2_MSK       (((1U << RF_ROSDAC_I_GC2_LEN) - 1) << RF_ROSDAC_I_GC2_POS)
#define RF_ROSDAC_I_GC2_UMSK      (~(((1U << RF_ROSDAC_I_GC2_LEN) - 1) << RF_ROSDAC_I_GC2_POS))
#define RF_ROSDAC_Q_GC2           RF_ROSDAC_Q_GC2
#define RF_ROSDAC_Q_GC2_POS       (8U)
#define RF_ROSDAC_Q_GC2_LEN       (6U)
#define RF_ROSDAC_Q_GC2_MSK       (((1U << RF_ROSDAC_Q_GC2_LEN) - 1) << RF_ROSDAC_Q_GC2_POS)
#define RF_ROSDAC_Q_GC2_UMSK      (~(((1U << RF_ROSDAC_Q_GC2_LEN) - 1) << RF_ROSDAC_Q_GC2_POS))
#define RF_ROSDAC_I_GC3           RF_ROSDAC_I_GC3
#define RF_ROSDAC_I_GC3_POS       (16U)
#define RF_ROSDAC_I_GC3_LEN       (6U)
#define RF_ROSDAC_I_GC3_MSK       (((1U << RF_ROSDAC_I_GC3_LEN) - 1) << RF_ROSDAC_I_GC3_POS)
#define RF_ROSDAC_I_GC3_UMSK      (~(((1U << RF_ROSDAC_I_GC3_LEN) - 1) << RF_ROSDAC_I_GC3_POS))
#define RF_ROSDAC_Q_GC3           RF_ROSDAC_Q_GC3
#define RF_ROSDAC_Q_GC3_POS       (24U)
#define RF_ROSDAC_Q_GC3_LEN       (6U)
#define RF_ROSDAC_Q_GC3_MSK       (((1U << RF_ROSDAC_Q_GC3_LEN) - 1) << RF_ROSDAC_Q_GC3_POS)
#define RF_ROSDAC_Q_GC3_UMSK      (~(((1U << RF_ROSDAC_Q_GC3_LEN) - 1) << RF_ROSDAC_Q_GC3_POS))

/* 0x170 : rxiq_ctrl_hw1 */
#define RF_RXIQ_CTRL_HW1_OFFSET      (0x170)
#define RF_RX_IQ_PHASE_COMP_GC0      RF_RX_IQ_PHASE_COMP_GC0
#define RF_RX_IQ_PHASE_COMP_GC0_POS  (0U)
#define RF_RX_IQ_PHASE_COMP_GC0_LEN  (10U)
#define RF_RX_IQ_PHASE_COMP_GC0_MSK  (((1U << RF_RX_IQ_PHASE_COMP_GC0_LEN) - 1) << RF_RX_IQ_PHASE_COMP_GC0_POS)
#define RF_RX_IQ_PHASE_COMP_GC0_UMSK (~(((1U << RF_RX_IQ_PHASE_COMP_GC0_LEN) - 1) << RF_RX_IQ_PHASE_COMP_GC0_POS))
#define RF_RX_IQ_GAIN_COMP_GC0       RF_RX_IQ_GAIN_COMP_GC0
#define RF_RX_IQ_GAIN_COMP_GC0_POS   (16U)
#define RF_RX_IQ_GAIN_COMP_GC0_LEN   (11U)
#define RF_RX_IQ_GAIN_COMP_GC0_MSK   (((1U << RF_RX_IQ_GAIN_COMP_GC0_LEN) - 1) << RF_RX_IQ_GAIN_COMP_GC0_POS)
#define RF_RX_IQ_GAIN_COMP_GC0_UMSK  (~(((1U << RF_RX_IQ_GAIN_COMP_GC0_LEN) - 1) << RF_RX_IQ_GAIN_COMP_GC0_POS))

/* 0x174 : rxiq_ctrl_hw2 */
#define RF_RXIQ_CTRL_HW2_OFFSET      (0x174)
#define RF_RX_IQ_PHASE_COMP_GC1      RF_RX_IQ_PHASE_COMP_GC1
#define RF_RX_IQ_PHASE_COMP_GC1_POS  (0U)
#define RF_RX_IQ_PHASE_COMP_GC1_LEN  (10U)
#define RF_RX_IQ_PHASE_COMP_GC1_MSK  (((1U << RF_RX_IQ_PHASE_COMP_GC1_LEN) - 1) << RF_RX_IQ_PHASE_COMP_GC1_POS)
#define RF_RX_IQ_PHASE_COMP_GC1_UMSK (~(((1U << RF_RX_IQ_PHASE_COMP_GC1_LEN) - 1) << RF_RX_IQ_PHASE_COMP_GC1_POS))
#define RF_RX_IQ_GAIN_COMP_GC1       RF_RX_IQ_GAIN_COMP_GC1
#define RF_RX_IQ_GAIN_COMP_GC1_POS   (16U)
#define RF_RX_IQ_GAIN_COMP_GC1_LEN   (11U)
#define RF_RX_IQ_GAIN_COMP_GC1_MSK   (((1U << RF_RX_IQ_GAIN_COMP_GC1_LEN) - 1) << RF_RX_IQ_GAIN_COMP_GC1_POS)
#define RF_RX_IQ_GAIN_COMP_GC1_UMSK  (~(((1U << RF_RX_IQ_GAIN_COMP_GC1_LEN) - 1) << RF_RX_IQ_GAIN_COMP_GC1_POS))

/* 0x178 : rxiq_ctrl_hw3 */
#define RF_RXIQ_CTRL_HW3_OFFSET      (0x178)
#define RF_RX_IQ_PHASE_COMP_GC2      RF_RX_IQ_PHASE_COMP_GC2
#define RF_RX_IQ_PHASE_COMP_GC2_POS  (0U)
#define RF_RX_IQ_PHASE_COMP_GC2_LEN  (10U)
#define RF_RX_IQ_PHASE_COMP_GC2_MSK  (((1U << RF_RX_IQ_PHASE_COMP_GC2_LEN) - 1) << RF_RX_IQ_PHASE_COMP_GC2_POS)
#define RF_RX_IQ_PHASE_COMP_GC2_UMSK (~(((1U << RF_RX_IQ_PHASE_COMP_GC2_LEN) - 1) << RF_RX_IQ_PHASE_COMP_GC2_POS))
#define RF_RX_IQ_GAIN_COMP_GC2       RF_RX_IQ_GAIN_COMP_GC2
#define RF_RX_IQ_GAIN_COMP_GC2_POS   (16U)
#define RF_RX_IQ_GAIN_COMP_GC2_LEN   (11U)
#define RF_RX_IQ_GAIN_COMP_GC2_MSK   (((1U << RF_RX_IQ_GAIN_COMP_GC2_LEN) - 1) << RF_RX_IQ_GAIN_COMP_GC2_POS)
#define RF_RX_IQ_GAIN_COMP_GC2_UMSK  (~(((1U << RF_RX_IQ_GAIN_COMP_GC2_LEN) - 1) << RF_RX_IQ_GAIN_COMP_GC2_POS))

