bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x17C : rxiq_ctrl_hw4 */
#define RF_RXIQ_CTRL_HW4_OFFSET      (0x17C)
#define RF_RX_IQ_PHASE_COMP_GC3      RF_RX_IQ_PHASE_COMP_GC3
#define RF_RX_IQ_PHASE_COMP_GC3_POS  (0U)
#define RF_RX_IQ_PHASE_COMP_GC3_LEN  (10U)
#define RF_RX_IQ_PHASE_COMP_GC3_MSK  (((1U << RF_RX_IQ_PHASE_COMP_GC3_LEN) - 1) << RF_RX_IQ_PHASE_COMP_GC3_POS)
#define RF_RX_IQ_PHASE_COMP_GC3_UMSK (~(((1U << RF_RX_IQ_PHASE_COMP_GC3_LEN) - 1) << RF_RX_IQ_PHASE_COMP_GC3_POS))
#define RF_RX_IQ_GAIN_COMP_GC3       RF_RX_IQ_GAIN_COMP_GC3
#define RF_RX_IQ_GAIN_COMP_GC3_POS   (16U)
#define RF_RX_IQ_GAIN_COMP_GC3_LEN   (11U)
#define RF_RX_IQ_GAIN_COMP_GC3_MSK   (((1U << RF_RX_IQ_GAIN_COMP_GC3_LEN) - 1) << RF_RX_IQ_GAIN_COMP_GC3_POS)
#define RF_RX_IQ_GAIN_COMP_GC3_UMSK  (~(((1U << RF_RX_IQ_GAIN_COMP_GC3_LEN) - 1) << RF_RX_IQ_GAIN_COMP_GC3_POS))

/* 0x180 : tosdac_ctrl_hw1 */
#define RF_TOSDAC_CTRL_HW1_OFFSET (0x180)
#define RF_TBB_TOSDAC_I_GC0       RF_TBB_TOSDAC_I_GC0
#define RF_TBB_TOSDAC_I_GC0_POS   (0U)
#define RF_TBB_TOSDAC_I_GC0_LEN   (6U)
#define RF_TBB_TOSDAC_I_GC0_MSK   (((1U << RF_TBB_TOSDAC_I_GC0_LEN) - 1) << RF_TBB_TOSDAC_I_GC0_POS)
#define RF_TBB_TOSDAC_I_GC0_UMSK  (~(((1U << RF_TBB_TOSDAC_I_GC0_LEN) - 1) << RF_TBB_TOSDAC_I_GC0_POS))
#define RF_TBB_TOSDAC_Q_GC0       RF_TBB_TOSDAC_Q_GC0
#define RF_TBB_TOSDAC_Q_GC0_POS   (8U)
#define RF_TBB_TOSDAC_Q_GC0_LEN   (6U)
#define RF_TBB_TOSDAC_Q_GC0_MSK   (((1U << RF_TBB_TOSDAC_Q_GC0_LEN) - 1) << RF_TBB_TOSDAC_Q_GC0_POS)
#define RF_TBB_TOSDAC_Q_GC0_UMSK  (~(((1U << RF_TBB_TOSDAC_Q_GC0_LEN) - 1) << RF_TBB_TOSDAC_Q_GC0_POS))
#define RF_TBB_TOSDAC_I_GC1       RF_TBB_TOSDAC_I_GC1
#define RF_TBB_TOSDAC_I_GC1_POS   (16U)
#define RF_TBB_TOSDAC_I_GC1_LEN   (6U)
#define RF_TBB_TOSDAC_I_GC1_MSK   (((1U << RF_TBB_TOSDAC_I_GC1_LEN) - 1) << RF_TBB_TOSDAC_I_GC1_POS)
#define RF_TBB_TOSDAC_I_GC1_UMSK  (~(((1U << RF_TBB_TOSDAC_I_GC1_LEN) - 1) << RF_TBB_TOSDAC_I_GC1_POS))
#define RF_TBB_TOSDAC_Q_GC1       RF_TBB_TOSDAC_Q_GC1
#define RF_TBB_TOSDAC_Q_GC1_POS   (24U)
#define RF_TBB_TOSDAC_Q_GC1_LEN   (6U)
#define RF_TBB_TOSDAC_Q_GC1_MSK   (((1U << RF_TBB_TOSDAC_Q_GC1_LEN) - 1) << RF_TBB_TOSDAC_Q_GC1_POS)
#define RF_TBB_TOSDAC_Q_GC1_UMSK  (~(((1U << RF_TBB_TOSDAC_Q_GC1_LEN) - 1) << RF_TBB_TOSDAC_Q_GC1_POS))

/* 0x184 : tosdac_ctrl_hw2 */
#define RF_TOSDAC_CTRL_HW2_OFFSET (0x184)
#define RF_TBB_TOSDAC_I_GC2       RF_TBB_TOSDAC_I_GC2
#define RF_TBB_TOSDAC_I_GC2_POS   (0U)
#define RF_TBB_TOSDAC_I_GC2_LEN   (6U)
#define RF_TBB_TOSDAC_I_GC2_MSK   (((1U << RF_TBB_TOSDAC_I_GC2_LEN) - 1) << RF_TBB_TOSDAC_I_GC2_POS)
#define RF_TBB_TOSDAC_I_GC2_UMSK  (~(((1U << RF_TBB_TOSDAC_I_GC2_LEN) - 1) << RF_TBB_TOSDAC_I_GC2_POS))
#define RF_TBB_TOSDAC_Q_GC2       RF_TBB_TOSDAC_Q_GC2
#define RF_TBB_TOSDAC_Q_GC2_POS   (8U)
#define RF_TBB_TOSDAC_Q_GC2_LEN   (6U)
#define RF_TBB_TOSDAC_Q_GC2_MSK   (((1U << RF_TBB_TOSDAC_Q_GC2_LEN) - 1) << RF_TBB_TOSDAC_Q_GC2_POS)
#define RF_TBB_TOSDAC_Q_GC2_UMSK  (~(((1U << RF_TBB_TOSDAC_Q_GC2_LEN) - 1) << RF_TBB_TOSDAC_Q_GC2_POS))
#define RF_TBB_TOSDAC_I_GC3       RF_TBB_TOSDAC_I_GC3
#define RF_TBB_TOSDAC_I_GC3_POS   (16U)
#define RF_TBB_TOSDAC_I_GC3_LEN   (6U)
#define RF_TBB_TOSDAC_I_GC3_MSK   (((1U << RF_TBB_TOSDAC_I_GC3_LEN) - 1) << RF_TBB_TOSDAC_I_GC3_POS)
#define RF_TBB_TOSDAC_I_GC3_UMSK  (~(((1U << RF_TBB_TOSDAC_I_GC3_LEN) - 1) << RF_TBB_TOSDAC_I_GC3_POS))
#define RF_TBB_TOSDAC_Q_GC3       RF_TBB_TOSDAC_Q_GC3
#define RF_TBB_TOSDAC_Q_GC3_POS   (24U)
#define RF_TBB_TOSDAC_Q_GC3_LEN   (6U)
#define RF_TBB_TOSDAC_Q_GC3_MSK   (((1U << RF_TBB_TOSDAC_Q_GC3_LEN) - 1) << RF_TBB_TOSDAC_Q_GC3_POS)
#define RF_TBB_TOSDAC_Q_GC3_UMSK  (~(((1U << RF_TBB_TOSDAC_Q_GC3_LEN) - 1) << RF_TBB_TOSDAC_Q_GC3_POS))

/* 0x188 : tosdac_ctrl_hw3 */
#define RF_TOSDAC_CTRL_HW3_OFFSET (0x188)
#define RF_TBB_TOSDAC_I_GC4       RF_TBB_TOSDAC_I_GC4
#define RF_TBB_TOSDAC_I_GC4_POS   (0U)
#define RF_TBB_TOSDAC_I_GC4_LEN   (6U)
#define RF_TBB_TOSDAC_I_GC4_MSK   (((1U << RF_TBB_TOSDAC_I_GC4_LEN) - 1) << RF_TBB_TOSDAC_I_GC4_POS)
#define RF_TBB_TOSDAC_I_GC4_UMSK  (~(((1U << RF_TBB_TOSDAC_I_GC4_LEN) - 1) << RF_TBB_TOSDAC_I_GC4_POS))
#define RF_TBB_TOSDAC_Q_GC4       RF_TBB_TOSDAC_Q_GC4
#define RF_TBB_TOSDAC_Q_GC4_POS   (8U)
#define RF_TBB_TOSDAC_Q_GC4_LEN   (6U)
#define RF_TBB_TOSDAC_Q_GC4_MSK   (((1U << RF_TBB_TOSDAC_Q_GC4_LEN) - 1) << RF_TBB_TOSDAC_Q_GC4_POS)
#define RF_TBB_TOSDAC_Q_GC4_UMSK  (~(((1U << RF_TBB_TOSDAC_Q_GC4_LEN) - 1) << RF_TBB_TOSDAC_Q_GC4_POS))
#define RF_TBB_TOSDAC_I_GC5       RF_TBB_TOSDAC_I_GC5
#define RF_TBB_TOSDAC_I_GC5_POS   (16U)
#define RF_TBB_TOSDAC_I_GC5_LEN   (6U)
#define RF_TBB_TOSDAC_I_GC5_MSK   (((1U << RF_TBB_TOSDAC_I_GC5_LEN) - 1) << RF_TBB_TOSDAC_I_GC5_POS)
#define RF_TBB_TOSDAC_I_GC5_UMSK  (~(((1U << RF_TBB_TOSDAC_I_GC5_LEN) - 1) << RF_TBB_TOSDAC_I_GC5_POS))
#define RF_TBB_TOSDAC_Q_GC5       RF_TBB_TOSDAC_Q_GC5
#define RF_TBB_TOSDAC_Q_GC5_POS   (24U)
#define RF_TBB_TOSDAC_Q_GC5_LEN   (6U)
#define RF_TBB_TOSDAC_Q_GC5_MSK   (((1U << RF_TBB_TOSDAC_Q_GC5_LEN) - 1) << RF_TBB_TOSDAC_Q_GC5_POS)
#define RF_TBB_TOSDAC_Q_GC5_UMSK  (~(((1U << RF_TBB_TOSDAC_Q_GC5_LEN) - 1) << RF_TBB_TOSDAC_Q_GC5_POS))

/* 0x18C : tosdac_ctrl_hw4 */
#define RF_TOSDAC_CTRL_HW4_OFFSET (0x18C)
#define RF_TBB_TOSDAC_I_GC6       RF_TBB_TOSDAC_I_GC6
#define RF_TBB_TOSDAC_I_GC6_POS   (0U)
#define RF_TBB_TOSDAC_I_GC6_LEN   (6U)
#define RF_TBB_TOSDAC_I_GC6_MSK   (((1U << RF_TBB_TOSDAC_I_GC6_LEN) - 1) << RF_TBB_TOSDAC_I_GC6_POS)
#define RF_TBB_TOSDAC_I_GC6_UMSK  (~(((1U << RF_TBB_TOSDAC_I_GC6_LEN) - 1) << RF_TBB_TOSDAC_I_GC6_POS))
#define RF_TBB_TOSDAC_Q_GC6       RF_TBB_TOSDAC_Q_GC6
#define RF_TBB_TOSDAC_Q_GC6_POS   (8U)
#define RF_TBB_TOSDAC_Q_GC6_LEN   (6U)
#define RF_TBB_TOSDAC_Q_GC6_MSK   (((1U << RF_TBB_TOSDAC_Q_GC6_LEN) - 1) << RF_TBB_TOSDAC_Q_GC6_POS)
#define RF_TBB_TOSDAC_Q_GC6_UMSK  (~(((1U << RF_TBB_TOSDAC_Q_GC6_LEN) - 1) << RF_TBB_TOSDAC_Q_GC6_POS))
#define RF_TBB_TOSDAC_I_GC7       RF_TBB_TOSDAC_I_GC7
#define RF_TBB_TOSDAC_I_GC7_POS   (16U)
#define RF_TBB_TOSDAC_I_GC7_LEN   (6U)
#define RF_TBB_TOSDAC_I_GC7_MSK   (((1U << RF_TBB_TOSDAC_I_GC7_LEN) - 1) << RF_TBB_TOSDAC_I_GC7_POS)
#define RF_TBB_TOSDAC_I_GC7_UMSK  (~(((1U << RF_TBB_TOSDAC_I_GC7_LEN) - 1) << RF_TBB_TOSDAC_I_GC7_POS))
#define RF_TBB_TOSDAC_Q_GC7       RF_TBB_TOSDAC_Q_GC7
#define RF_TBB_TOSDAC_Q_GC7_POS   (24U)
#define RF_TBB_TOSDAC_Q_GC7_LEN   (6U)
#define RF_TBB_TOSDAC_Q_GC7_MSK   (((1U << RF_TBB_TOSDAC_Q_GC7_LEN) - 1) << RF_TBB_TOSDAC_Q_GC7_POS)
#define RF_TBB_TOSDAC_Q_GC7_UMSK  (~(((1U << RF_TBB_TOSDAC_Q_GC7_LEN) - 1) << RF_TBB_TOSDAC_Q_GC7_POS))

/* 0x190 : tx_iq_gain_hw0 */
#define RF_TX_IQ_GAIN_HW0_OFFSET     (0x190)
#define RF_TX_IQ_PHASE_COMP_GC0      RF_TX_IQ_PHASE_COMP_GC0
#define RF_TX_IQ_PHASE_COMP_GC0_POS  (0U)
#define RF_TX_IQ_PHASE_COMP_GC0_LEN  (10U)
#define RF_TX_IQ_PHASE_COMP_GC0_MSK  (((1U << RF_TX_IQ_PHASE_COMP_GC0_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC0_POS)
#define RF_TX_IQ_PHASE_COMP_GC0_UMSK (~(((1U << RF_TX_IQ_PHASE_COMP_GC0_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC0_POS))
#define RF_TX_IQ_GAIN_COMP_GC0       RF_TX_IQ_GAIN_COMP_GC0
#define RF_TX_IQ_GAIN_COMP_GC0_POS   (16U)
#define RF_TX_IQ_GAIN_COMP_GC0_LEN   (11U)
#define RF_TX_IQ_GAIN_COMP_GC0_MSK   (((1U << RF_TX_IQ_GAIN_COMP_GC0_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC0_POS)
#define RF_TX_IQ_GAIN_COMP_GC0_UMSK  (~(((1U << RF_TX_IQ_GAIN_COMP_GC0_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC0_POS))

/* 0x194 : tx_iq_gain_hw1 */
#define RF_TX_IQ_GAIN_HW1_OFFSET     (0x194)
#define RF_TX_IQ_PHASE_COMP_GC1      RF_TX_IQ_PHASE_COMP_GC1
#define RF_TX_IQ_PHASE_COMP_GC1_POS  (0U)
#define RF_TX_IQ_PHASE_COMP_GC1_LEN  (10U)
#define RF_TX_IQ_PHASE_COMP_GC1_MSK  (((1U << RF_TX_IQ_PHASE_COMP_GC1_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC1_POS)
#define RF_TX_IQ_PHASE_COMP_GC1_UMSK (~(((1U << RF_TX_IQ_PHASE_COMP_GC1_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC1_POS))
#define RF_TX_IQ_GAIN_COMP_GC1       RF_TX_IQ_GAIN_COMP_GC1
#define RF_TX_IQ_GAIN_COMP_GC1_POS   (16U)
#define RF_TX_IQ_GAIN_COMP_GC1_LEN   (11U)
#define RF_TX_IQ_GAIN_COMP_GC1_MSK   (((1U << RF_TX_IQ_GAIN_COMP_GC1_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC1_POS)
#define RF_TX_IQ_GAIN_COMP_GC1_UMSK  (~(((1U << RF_TX_IQ_GAIN_COMP_GC1_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC1_POS))

