bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x198 : tx_iq_gain_hw2 */
#define RF_TX_IQ_GAIN_HW2_OFFSET     (0x198)
#define RF_TX_IQ_PHASE_COMP_GC2      RF_TX_IQ_PHASE_COMP_GC2
#define RF_TX_IQ_PHASE_COMP_GC2_POS  (0U)
#define RF_TX_IQ_PHASE_COMP_GC2_LEN  (10U)
#define RF_TX_IQ_PHASE_COMP_GC2_MSK  (((1U << RF_TX_IQ_PHASE_COMP_GC2_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC2_POS)
#define RF_TX_IQ_PHASE_COMP_GC2_UMSK (~(((1U << RF_TX_IQ_PHASE_COMP_GC2_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC2_POS))
#define RF_TX_IQ_GAIN_COMP_GC2       RF_TX_IQ_GAIN_COMP_GC2
#define RF_TX_IQ_GAIN_COMP_GC2_POS   (16U)
#define RF_TX_IQ_GAIN_COMP_GC2_LEN   (11U)
#define RF_TX_IQ_GAIN_COMP_GC2_MSK   (((1U << RF_TX_IQ_GAIN_COMP_GC2_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC2_POS)
#define RF_TX_IQ_GAIN_COMP_GC2_UMSK  (~(((1U << RF_TX_IQ_GAIN_COMP_GC2_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC2_POS))

/* 0x19C : tx_iq_gain_hw3 */
#define RF_TX_IQ_GAIN_HW3_OFFSET     (0x19C)
#define RF_TX_IQ_PHASE_COMP_GC3      RF_TX_IQ_PHASE_COMP_GC3
#define RF_TX_IQ_PHASE_COMP_GC3_POS  (0U)
#define RF_TX_IQ_PHASE_COMP_GC3_LEN  (10U)
#define RF_TX_IQ_PHASE_COMP_GC3_MSK  (((1U << RF_TX_IQ_PHASE_COMP_GC3_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC3_POS)
#define RF_TX_IQ_PHASE_COMP_GC3_UMSK (~(((1U << RF_TX_IQ_PHASE_COMP_GC3_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC3_POS))
#define RF_TX_IQ_GAIN_COMP_GC3       RF_TX_IQ_GAIN_COMP_GC3
#define RF_TX_IQ_GAIN_COMP_GC3_POS   (16U)
#define RF_TX_IQ_GAIN_COMP_GC3_LEN   (11U)
#define RF_TX_IQ_GAIN_COMP_GC3_MSK   (((1U << RF_TX_IQ_GAIN_COMP_GC3_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC3_POS)
#define RF_TX_IQ_GAIN_COMP_GC3_UMSK  (~(((1U << RF_TX_IQ_GAIN_COMP_GC3_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC3_POS))

/* 0x1A0 : tx_iq_gain_hw4 */
#define RF_TX_IQ_GAIN_HW4_OFFSET     (0x1A0)
#define RF_TX_IQ_PHASE_COMP_GC4      RF_TX_IQ_PHASE_COMP_GC4
#define RF_TX_IQ_PHASE_COMP_GC4_POS  (0U)
#define RF_TX_IQ_PHASE_COMP_GC4_LEN  (10U)
#define RF_TX_IQ_PHASE_COMP_GC4_MSK  (((1U << RF_TX_IQ_PHASE_COMP_GC4_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC4_POS)
#define RF_TX_IQ_PHASE_COMP_GC4_UMSK (~(((1U << RF_TX_IQ_PHASE_COMP_GC4_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC4_POS))
#define RF_TX_IQ_GAIN_COMP_GC4       RF_TX_IQ_GAIN_COMP_GC4
#define RF_TX_IQ_GAIN_COMP_GC4_POS   (16U)
#define RF_TX_IQ_GAIN_COMP_GC4_LEN   (11U)
#define RF_TX_IQ_GAIN_COMP_GC4_MSK   (((1U << RF_TX_IQ_GAIN_COMP_GC4_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC4_POS)
#define RF_TX_IQ_GAIN_COMP_GC4_UMSK  (~(((1U << RF_TX_IQ_GAIN_COMP_GC4_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC4_POS))

/* 0x1A4 : tx_iq_gain_hw5 */
#define RF_TX_IQ_GAIN_HW5_OFFSET     (0x1A4)
#define RF_TX_IQ_PHASE_COMP_GC5      RF_TX_IQ_PHASE_COMP_GC5
#define RF_TX_IQ_PHASE_COMP_GC5_POS  (0U)
#define RF_TX_IQ_PHASE_COMP_GC5_LEN  (10U)
#define RF_TX_IQ_PHASE_COMP_GC5_MSK  (((1U << RF_TX_IQ_PHASE_COMP_GC5_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC5_POS)
#define RF_TX_IQ_PHASE_COMP_GC5_UMSK (~(((1U << RF_TX_IQ_PHASE_COMP_GC5_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC5_POS))
#define RF_TX_IQ_GAIN_COMP_GC5       RF_TX_IQ_GAIN_COMP_GC5
#define RF_TX_IQ_GAIN_COMP_GC5_POS   (16U)
#define RF_TX_IQ_GAIN_COMP_GC5_LEN   (11U)
#define RF_TX_IQ_GAIN_COMP_GC5_MSK   (((1U << RF_TX_IQ_GAIN_COMP_GC5_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC5_POS)
#define RF_TX_IQ_GAIN_COMP_GC5_UMSK  (~(((1U << RF_TX_IQ_GAIN_COMP_GC5_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC5_POS))

/* 0x1A8 : tx_iq_gain_hw6 */
#define RF_TX_IQ_GAIN_HW6_OFFSET     (0x1A8)
#define RF_TX_IQ_PHASE_COMP_GC6      RF_TX_IQ_PHASE_COMP_GC6
#define RF_TX_IQ_PHASE_COMP_GC6_POS  (0U)
#define RF_TX_IQ_PHASE_COMP_GC6_LEN  (10U)
#define RF_TX_IQ_PHASE_COMP_GC6_MSK  (((1U << RF_TX_IQ_PHASE_COMP_GC6_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC6_POS)
#define RF_TX_IQ_PHASE_COMP_GC6_UMSK (~(((1U << RF_TX_IQ_PHASE_COMP_GC6_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC6_POS))
#define RF_TX_IQ_GAIN_COMP_GC6       RF_TX_IQ_GAIN_COMP_GC6
#define RF_TX_IQ_GAIN_COMP_GC6_POS   (16U)
#define RF_TX_IQ_GAIN_COMP_GC6_LEN   (11U)
#define RF_TX_IQ_GAIN_COMP_GC6_MSK   (((1U << RF_TX_IQ_GAIN_COMP_GC6_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC6_POS)
#define RF_TX_IQ_GAIN_COMP_GC6_UMSK  (~(((1U << RF_TX_IQ_GAIN_COMP_GC6_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC6_POS))

/* 0x1AC : tx_iq_gain_hw7 */
#define RF_TX_IQ_GAIN_HW7_OFFSET     (0x1AC)
#define RF_TX_IQ_PHASE_COMP_GC7      RF_TX_IQ_PHASE_COMP_GC7
#define RF_TX_IQ_PHASE_COMP_GC7_POS  (0U)
#define RF_TX_IQ_PHASE_COMP_GC7_LEN  (10U)
#define RF_TX_IQ_PHASE_COMP_GC7_MSK  (((1U << RF_TX_IQ_PHASE_COMP_GC7_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC7_POS)
#define RF_TX_IQ_PHASE_COMP_GC7_UMSK (~(((1U << RF_TX_IQ_PHASE_COMP_GC7_LEN) - 1) << RF_TX_IQ_PHASE_COMP_GC7_POS))
#define RF_TX_IQ_GAIN_COMP_GC7       RF_TX_IQ_GAIN_COMP_GC7
#define RF_TX_IQ_GAIN_COMP_GC7_POS   (16U)
#define RF_TX_IQ_GAIN_COMP_GC7_LEN   (11U)
#define RF_TX_IQ_GAIN_COMP_GC7_MSK   (((1U << RF_TX_IQ_GAIN_COMP_GC7_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC7_POS)
#define RF_TX_IQ_GAIN_COMP_GC7_UMSK  (~(((1U << RF_TX_IQ_GAIN_COMP_GC7_LEN) - 1) << RF_TX_IQ_GAIN_COMP_GC7_POS))

/* 0x1B0 : lo_sdm_ctrl_hw1 */
#define RF_LO_SDM_CTRL_HW1_OFFSET           (0x1B0)
#define RF_LO_SDM_DITHER_SEL_WLAN_2412      RF_LO_SDM_DITHER_SEL_WLAN_2412
#define RF_LO_SDM_DITHER_SEL_WLAN_2412_POS  (0U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2412_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2412_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2412_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2412_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2412_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2412_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2412_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2417      RF_LO_SDM_DITHER_SEL_WLAN_2417
#define RF_LO_SDM_DITHER_SEL_WLAN_2417_POS  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2417_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2417_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2417_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2417_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2417_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2417_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2417_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2422      RF_LO_SDM_DITHER_SEL_WLAN_2422
#define RF_LO_SDM_DITHER_SEL_WLAN_2422_POS  (4U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2422_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2422_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2422_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2422_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2422_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2422_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2422_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2427      RF_LO_SDM_DITHER_SEL_WLAN_2427
#define RF_LO_SDM_DITHER_SEL_WLAN_2427_POS  (6U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2427_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2427_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2427_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2427_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2427_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2427_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2427_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2432      RF_LO_SDM_DITHER_SEL_WLAN_2432
#define RF_LO_SDM_DITHER_SEL_WLAN_2432_POS  (8U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2432_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2432_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2432_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2432_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2432_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2432_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2432_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2437      RF_LO_SDM_DITHER_SEL_WLAN_2437
#define RF_LO_SDM_DITHER_SEL_WLAN_2437_POS  (10U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2437_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2437_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2437_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2437_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2437_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2437_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2437_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2442      RF_LO_SDM_DITHER_SEL_WLAN_2442
#define RF_LO_SDM_DITHER_SEL_WLAN_2442_POS  (12U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2442_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2442_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2442_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2442_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2442_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2442_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2442_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2447      RF_LO_SDM_DITHER_SEL_WLAN_2447
#define RF_LO_SDM_DITHER_SEL_WLAN_2447_POS  (14U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2447_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2447_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2447_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2447_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2447_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2447_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2447_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2452      RF_LO_SDM_DITHER_SEL_WLAN_2452
#define RF_LO_SDM_DITHER_SEL_WLAN_2452_POS  (16U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2452_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2452_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2452_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2452_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2452_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2452_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2452_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2457      RF_LO_SDM_DITHER_SEL_WLAN_2457
#define RF_LO_SDM_DITHER_SEL_WLAN_2457_POS  (18U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2457_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2457_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2457_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2457_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2457_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2457_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2457_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2462      RF_LO_SDM_DITHER_SEL_WLAN_2462
#define RF_LO_SDM_DITHER_SEL_WLAN_2462_POS  (20U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2462_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2462_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2462_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2462_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2462_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2462_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2462_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2467      RF_LO_SDM_DITHER_SEL_WLAN_2467
#define RF_LO_SDM_DITHER_SEL_WLAN_2467_POS  (22U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2467_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2467_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2467_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2467_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2467_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2467_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2467_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2472      RF_LO_SDM_DITHER_SEL_WLAN_2472
#define RF_LO_SDM_DITHER_SEL_WLAN_2472_POS  (24U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2472_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2472_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2472_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2472_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2472_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2472_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2472_POS))
#define RF_LO_SDM_DITHER_SEL_WLAN_2484      RF_LO_SDM_DITHER_SEL_WLAN_2484
#define RF_LO_SDM_DITHER_SEL_WLAN_2484_POS  (26U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2484_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_WLAN_2484_MSK  (((1U << RF_LO_SDM_DITHER_SEL_WLAN_2484_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2484_POS)
#define RF_LO_SDM_DITHER_SEL_WLAN_2484_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_WLAN_2484_LEN) - 1) << RF_LO_SDM_DITHER_SEL_WLAN_2484_POS))

