bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x1B4 : lo_sdm_ctrl_hw2 */
#define RF_LO_SDM_CTRL_HW2_OFFSET          (0x1B4)
#define RF_LO_SDM_DITHER_SEL_BLE_2402      RF_LO_SDM_DITHER_SEL_BLE_2402
#define RF_LO_SDM_DITHER_SEL_BLE_2402_POS  (0U)
#define RF_LO_SDM_DITHER_SEL_BLE_2402_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2402_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2402_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2402_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2402_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2402_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2402_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2404      RF_LO_SDM_DITHER_SEL_BLE_2404
#define RF_LO_SDM_DITHER_SEL_BLE_2404_POS  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2404_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2404_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2404_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2404_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2404_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2404_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2404_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2406      RF_LO_SDM_DITHER_SEL_BLE_2406
#define RF_LO_SDM_DITHER_SEL_BLE_2406_POS  (4U)
#define RF_LO_SDM_DITHER_SEL_BLE_2406_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2406_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2406_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2406_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2406_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2406_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2406_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2408      RF_LO_SDM_DITHER_SEL_BLE_2408
#define RF_LO_SDM_DITHER_SEL_BLE_2408_POS  (6U)
#define RF_LO_SDM_DITHER_SEL_BLE_2408_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2408_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2408_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2408_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2408_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2408_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2408_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2410      RF_LO_SDM_DITHER_SEL_BLE_2410
#define RF_LO_SDM_DITHER_SEL_BLE_2410_POS  (8U)
#define RF_LO_SDM_DITHER_SEL_BLE_2410_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2410_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2410_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2410_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2410_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2410_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2410_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2412      RF_LO_SDM_DITHER_SEL_BLE_2412
#define RF_LO_SDM_DITHER_SEL_BLE_2412_POS  (10U)
#define RF_LO_SDM_DITHER_SEL_BLE_2412_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2412_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2412_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2412_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2412_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2412_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2412_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2414      RF_LO_SDM_DITHER_SEL_BLE_2414
#define RF_LO_SDM_DITHER_SEL_BLE_2414_POS  (12U)
#define RF_LO_SDM_DITHER_SEL_BLE_2414_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2414_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2414_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2414_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2414_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2414_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2414_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2416      RF_LO_SDM_DITHER_SEL_BLE_2416
#define RF_LO_SDM_DITHER_SEL_BLE_2416_POS  (14U)
#define RF_LO_SDM_DITHER_SEL_BLE_2416_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2416_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2416_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2416_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2416_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2416_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2416_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2418      RF_LO_SDM_DITHER_SEL_BLE_2418
#define RF_LO_SDM_DITHER_SEL_BLE_2418_POS  (16U)
#define RF_LO_SDM_DITHER_SEL_BLE_2418_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2418_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2418_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2418_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2418_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2418_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2418_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2420      RF_LO_SDM_DITHER_SEL_BLE_2420
#define RF_LO_SDM_DITHER_SEL_BLE_2420_POS  (18U)
#define RF_LO_SDM_DITHER_SEL_BLE_2420_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2420_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2420_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2420_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2420_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2420_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2420_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2422      RF_LO_SDM_DITHER_SEL_BLE_2422
#define RF_LO_SDM_DITHER_SEL_BLE_2422_POS  (20U)
#define RF_LO_SDM_DITHER_SEL_BLE_2422_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2422_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2422_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2422_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2422_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2422_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2422_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2424      RF_LO_SDM_DITHER_SEL_BLE_2424
#define RF_LO_SDM_DITHER_SEL_BLE_2424_POS  (22U)
#define RF_LO_SDM_DITHER_SEL_BLE_2424_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2424_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2424_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2424_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2424_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2424_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2424_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2426      RF_LO_SDM_DITHER_SEL_BLE_2426
#define RF_LO_SDM_DITHER_SEL_BLE_2426_POS  (24U)
#define RF_LO_SDM_DITHER_SEL_BLE_2426_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2426_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2426_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2426_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2426_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2426_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2426_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2428      RF_LO_SDM_DITHER_SEL_BLE_2428
#define RF_LO_SDM_DITHER_SEL_BLE_2428_POS  (26U)
#define RF_LO_SDM_DITHER_SEL_BLE_2428_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2428_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2428_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2428_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2428_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2428_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2428_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2430      RF_LO_SDM_DITHER_SEL_BLE_2430
#define RF_LO_SDM_DITHER_SEL_BLE_2430_POS  (28U)
#define RF_LO_SDM_DITHER_SEL_BLE_2430_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2430_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2430_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2430_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2430_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2430_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2430_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2432      RF_LO_SDM_DITHER_SEL_BLE_2432
#define RF_LO_SDM_DITHER_SEL_BLE_2432_POS  (30U)
#define RF_LO_SDM_DITHER_SEL_BLE_2432_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2432_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2432_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2432_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2432_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2432_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2432_POS))

/* 0x1B8 : lo_sdm_ctrl_hw3 */
#define RF_LO_SDM_CTRL_HW3_OFFSET          (0x1B8)
#define RF_LO_SDM_DITHER_SEL_BLE_2434      RF_LO_SDM_DITHER_SEL_BLE_2434
#define RF_LO_SDM_DITHER_SEL_BLE_2434_POS  (0U)
#define RF_LO_SDM_DITHER_SEL_BLE_2434_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2434_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2434_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2434_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2434_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2434_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2434_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2436      RF_LO_SDM_DITHER_SEL_BLE_2436
#define RF_LO_SDM_DITHER_SEL_BLE_2436_POS  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2436_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2436_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2436_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2436_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2436_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2436_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2436_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2438      RF_LO_SDM_DITHER_SEL_BLE_2438
#define RF_LO_SDM_DITHER_SEL_BLE_2438_POS  (4U)
#define RF_LO_SDM_DITHER_SEL_BLE_2438_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2438_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2438_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2438_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2438_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2438_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2438_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2440      RF_LO_SDM_DITHER_SEL_BLE_2440
#define RF_LO_SDM_DITHER_SEL_BLE_2440_POS  (6U)
#define RF_LO_SDM_DITHER_SEL_BLE_2440_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2440_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2440_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2440_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2440_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2440_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2440_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2442      RF_LO_SDM_DITHER_SEL_BLE_2442
#define RF_LO_SDM_DITHER_SEL_BLE_2442_POS  (8U)
#define RF_LO_SDM_DITHER_SEL_BLE_2442_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2442_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2442_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2442_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2442_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2442_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2442_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2444      RF_LO_SDM_DITHER_SEL_BLE_2444
#define RF_LO_SDM_DITHER_SEL_BLE_2444_POS  (10U)
#define RF_LO_SDM_DITHER_SEL_BLE_2444_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2444_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2444_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2444_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2444_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2444_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2444_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2446      RF_LO_SDM_DITHER_SEL_BLE_2446
#define RF_LO_SDM_DITHER_SEL_BLE_2446_POS  (12U)
#define RF_LO_SDM_DITHER_SEL_BLE_2446_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2446_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2446_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2446_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2446_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2446_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2446_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2448      RF_LO_SDM_DITHER_SEL_BLE_2448
#define RF_LO_SDM_DITHER_SEL_BLE_2448_POS  (14U)
#define RF_LO_SDM_DITHER_SEL_BLE_2448_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2448_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2448_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2448_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2448_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2448_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2448_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2450      RF_LO_SDM_DITHER_SEL_BLE_2450
#define RF_LO_SDM_DITHER_SEL_BLE_2450_POS  (16U)
#define RF_LO_SDM_DITHER_SEL_BLE_2450_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2450_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2450_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2450_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2450_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2450_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2450_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2452      RF_LO_SDM_DITHER_SEL_BLE_2452
#define RF_LO_SDM_DITHER_SEL_BLE_2452_POS  (18U)
#define RF_LO_SDM_DITHER_SEL_BLE_2452_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2452_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2452_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2452_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2452_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2452_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2452_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2454      RF_LO_SDM_DITHER_SEL_BLE_2454
#define RF_LO_SDM_DITHER_SEL_BLE_2454_POS  (20U)
#define RF_LO_SDM_DITHER_SEL_BLE_2454_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2454_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2454_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2454_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2454_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2454_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2454_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2456      RF_LO_SDM_DITHER_SEL_BLE_2456
#define RF_LO_SDM_DITHER_SEL_BLE_2456_POS  (22U)
#define RF_LO_SDM_DITHER_SEL_BLE_2456_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2456_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2456_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2456_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2456_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2456_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2456_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2458      RF_LO_SDM_DITHER_SEL_BLE_2458
#define RF_LO_SDM_DITHER_SEL_BLE_2458_POS  (24U)
#define RF_LO_SDM_DITHER_SEL_BLE_2458_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2458_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2458_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2458_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2458_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2458_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2458_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2460      RF_LO_SDM_DITHER_SEL_BLE_2460
#define RF_LO_SDM_DITHER_SEL_BLE_2460_POS  (26U)
#define RF_LO_SDM_DITHER_SEL_BLE_2460_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2460_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2460_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2460_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2460_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2460_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2460_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2462      RF_LO_SDM_DITHER_SEL_BLE_2462
#define RF_LO_SDM_DITHER_SEL_BLE_2462_POS  (28U)
#define RF_LO_SDM_DITHER_SEL_BLE_2462_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2462_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2462_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2462_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2462_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2462_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2462_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2464      RF_LO_SDM_DITHER_SEL_BLE_2464
#define RF_LO_SDM_DITHER_SEL_BLE_2464_POS  (30U)
#define RF_LO_SDM_DITHER_SEL_BLE_2464_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2464_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2464_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2464_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2464_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2464_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2464_POS))

/* 0x1BC : lo_sdm_ctrl_hw4 */
#define RF_LO_SDM_CTRL_HW4_OFFSET          (0x1BC)
#define RF_LO_SDM_DITHER_SEL_BLE_2466      RF_LO_SDM_DITHER_SEL_BLE_2466
#define RF_LO_SDM_DITHER_SEL_BLE_2466_POS  (0U)
#define RF_LO_SDM_DITHER_SEL_BLE_2466_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2466_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2466_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2466_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2466_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2466_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2466_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2468      RF_LO_SDM_DITHER_SEL_BLE_2468
#define RF_LO_SDM_DITHER_SEL_BLE_2468_POS  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2468_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2468_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2468_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2468_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2468_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2468_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2468_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2470      RF_LO_SDM_DITHER_SEL_BLE_2470
#define RF_LO_SDM_DITHER_SEL_BLE_2470_POS  (4U)
#define RF_LO_SDM_DITHER_SEL_BLE_2470_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2470_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2470_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2470_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2470_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2470_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2470_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2472      RF_LO_SDM_DITHER_SEL_BLE_2472
#define RF_LO_SDM_DITHER_SEL_BLE_2472_POS  (6U)
#define RF_LO_SDM_DITHER_SEL_BLE_2472_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2472_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2472_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2472_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2472_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2472_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2472_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2474      RF_LO_SDM_DITHER_SEL_BLE_2474
#define RF_LO_SDM_DITHER_SEL_BLE_2474_POS  (8U)
#define RF_LO_SDM_DITHER_SEL_BLE_2474_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2474_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2474_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2474_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2474_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2474_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2474_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2476      RF_LO_SDM_DITHER_SEL_BLE_2476
#define RF_LO_SDM_DITHER_SEL_BLE_2476_POS  (10U)
#define RF_LO_SDM_DITHER_SEL_BLE_2476_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2476_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2476_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2476_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2476_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2476_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2476_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2478      RF_LO_SDM_DITHER_SEL_BLE_2478
#define RF_LO_SDM_DITHER_SEL_BLE_2478_POS  (12U)
#define RF_LO_SDM_DITHER_SEL_BLE_2478_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2478_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2478_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2478_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2478_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2478_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2478_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_2480      RF_LO_SDM_DITHER_SEL_BLE_2480
#define RF_LO_SDM_DITHER_SEL_BLE_2480_POS  (14U)
#define RF_LO_SDM_DITHER_SEL_BLE_2480_LEN  (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_2480_MSK  (((1U << RF_LO_SDM_DITHER_SEL_BLE_2480_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2480_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_2480_UMSK (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_2480_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_2480_POS))
#define RF_LO_SDM_DITHER_SEL_BLE_TX        RF_LO_SDM_DITHER_SEL_BLE_TX
#define RF_LO_SDM_DITHER_SEL_BLE_TX_POS    (16U)
#define RF_LO_SDM_DITHER_SEL_BLE_TX_LEN    (2U)
#define RF_LO_SDM_DITHER_SEL_BLE_TX_MSK    (((1U << RF_LO_SDM_DITHER_SEL_BLE_TX_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_TX_POS)
#define RF_LO_SDM_DITHER_SEL_BLE_TX_UMSK   (~(((1U << RF_LO_SDM_DITHER_SEL_BLE_TX_LEN) - 1) << RF_LO_SDM_DITHER_SEL_BLE_TX_POS))

/* 0x1C0 : lo_sdm_ctrl_hw5 */
#define RF_LO_SDM_CTRL_HW5_OFFSET  (0x1C0)
#define RF_LO_CENTER_FREQ_MHZ      RF_LO_CENTER_FREQ_MHZ
#define RF_LO_CENTER_FREQ_MHZ_POS  (0U)
#define RF_LO_CENTER_FREQ_MHZ_LEN  (12U)
#define RF_LO_CENTER_FREQ_MHZ_MSK  (((1U << RF_LO_CENTER_FREQ_MHZ_LEN) - 1) << RF_LO_CENTER_FREQ_MHZ_POS)
#define RF_LO_CENTER_FREQ_MHZ_UMSK (~(((1U << RF_LO_CENTER_FREQ_MHZ_LEN) - 1) << RF_LO_CENTER_FREQ_MHZ_POS))
#define RF_LO_SDM_BYPASS_MODE      RF_LO_SDM_BYPASS_MODE
#define RF_LO_SDM_BYPASS_MODE_POS  (12U)
#define RF_LO_SDM_BYPASS_MODE_LEN  (6U)
#define RF_LO_SDM_BYPASS_MODE_MSK  (((1U << RF_LO_SDM_BYPASS_MODE_LEN) - 1) << RF_LO_SDM_BYPASS_MODE_POS)
#define RF_LO_SDM_BYPASS_MODE_UMSK (~(((1U << RF_LO_SDM_BYPASS_MODE_LEN) - 1) << RF_LO_SDM_BYPASS_MODE_POS))

/* 0x1C4 : lo_sdm_ctrl_hw6 */
#define RF_LO_SDM_CTRL_HW6_OFFSET (0x1C4)
#define RF_LO_SDMIN_CENTER        RF_LO_SDMIN_CENTER
#define RF_LO_SDMIN_CENTER_POS    (0U)
#define RF_LO_SDMIN_CENTER_LEN    (29U)
#define RF_LO_SDMIN_CENTER_MSK    (((1U << RF_LO_SDMIN_CENTER_LEN) - 1) << RF_LO_SDMIN_CENTER_POS)
#define RF_LO_SDMIN_CENTER_UMSK   (~(((1U << RF_LO_SDMIN_CENTER_LEN) - 1) << RF_LO_SDMIN_CENTER_POS))

/* 0x1C8 : lo_sdm_ctrl_hw7 */
#define RF_LO_SDM_CTRL_HW7_OFFSET (0x1C8)
#define RF_LO_SDMIN_1M            RF_LO_SDMIN_1M
#define RF_LO_SDMIN_1M_POS        (0U)
#define RF_LO_SDMIN_1M_LEN        (20U)
#define RF_LO_SDMIN_1M_MSK        (((1U << RF_LO_SDMIN_1M_LEN) - 1) << RF_LO_SDMIN_1M_POS)
#define RF_LO_SDMIN_1M_UMSK       (~(((1U << RF_LO_SDMIN_1M_LEN) - 1) << RF_LO_SDMIN_1M_POS))

/* 0x1CC : lo_sdm_ctrl_hw8 */
#define RF_LO_SDM_CTRL_HW8_OFFSET (0x1CC)
#define RF_LO_SDMIN_IF            RF_LO_SDMIN_IF
#define RF_LO_SDMIN_IF_POS        (0U)
#define RF_LO_SDMIN_IF_LEN        (20U)
#define RF_LO_SDMIN_IF_MSK        (((1U << RF_LO_SDMIN_IF_LEN) - 1) << RF_LO_SDMIN_IF_POS)
#define RF_LO_SDMIN_IF_UMSK       (~(((1U << RF_LO_SDMIN_IF_LEN) - 1) << RF_LO_SDMIN_IF_POS))

