bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x1D0 : rbb_bw_ctrl_hw */
#define RF_RBB_BW_CTRL_HW_OFFSET (0x1D0)
#define RF_RBB_BT_MODE_BLE       RF_RBB_BT_MODE_BLE
#define RF_RBB_BT_MODE_BLE_POS   (0U)
#define RF_RBB_BT_MODE_BLE_LEN   (1U)
#define RF_RBB_BT_MODE_BLE_MSK   (((1U << RF_RBB_BT_MODE_BLE_LEN) - 1) << RF_RBB_BT_MODE_BLE_POS)
#define RF_RBB_BT_MODE_BLE_UMSK  (~(((1U << RF_RBB_BT_MODE_BLE_LEN) - 1) << RF_RBB_BT_MODE_BLE_POS))

/* 0x20C : singen_ctrl0 */
#define RF_SINGEN_CTRL0_OFFSET   (0x20C)
#define RF_SINGEN_INC_STEP1      RF_SINGEN_INC_STEP1
#define RF_SINGEN_INC_STEP1_POS  (0U)
#define RF_SINGEN_INC_STEP1_LEN  (10U)
#define RF_SINGEN_INC_STEP1_MSK  (((1U << RF_SINGEN_INC_STEP1_LEN) - 1) << RF_SINGEN_INC_STEP1_POS)
#define RF_SINGEN_INC_STEP1_UMSK (~(((1U << RF_SINGEN_INC_STEP1_LEN) - 1) << RF_SINGEN_INC_STEP1_POS))
#define RF_SINGEN_INC_STEP0      RF_SINGEN_INC_STEP0
#define RF_SINGEN_INC_STEP0_POS  (16U)
#define RF_SINGEN_INC_STEP0_LEN  (10U)
#define RF_SINGEN_INC_STEP0_MSK  (((1U << RF_SINGEN_INC_STEP0_LEN) - 1) << RF_SINGEN_INC_STEP0_POS)
#define RF_SINGEN_INC_STEP0_UMSK (~(((1U << RF_SINGEN_INC_STEP0_LEN) - 1) << RF_SINGEN_INC_STEP0_POS))
#define RF_SINGEN_UNSIGN_EN      RF_SINGEN_UNSIGN_EN
#define RF_SINGEN_UNSIGN_EN_POS  (28U)
#define RF_SINGEN_UNSIGN_EN_LEN  (1U)
#define RF_SINGEN_UNSIGN_EN_MSK  (((1U << RF_SINGEN_UNSIGN_EN_LEN) - 1) << RF_SINGEN_UNSIGN_EN_POS)
#define RF_SINGEN_UNSIGN_EN_UMSK (~(((1U << RF_SINGEN_UNSIGN_EN_LEN) - 1) << RF_SINGEN_UNSIGN_EN_POS))
#define RF_SINGEN_CLKDIV_N       RF_SINGEN_CLKDIV_N
#define RF_SINGEN_CLKDIV_N_POS   (29U)
#define RF_SINGEN_CLKDIV_N_LEN   (2U)
#define RF_SINGEN_CLKDIV_N_MSK   (((1U << RF_SINGEN_CLKDIV_N_LEN) - 1) << RF_SINGEN_CLKDIV_N_POS)
#define RF_SINGEN_CLKDIV_N_UMSK  (~(((1U << RF_SINGEN_CLKDIV_N_LEN) - 1) << RF_SINGEN_CLKDIV_N_POS))
#define RF_SINGEN_EN             RF_SINGEN_EN
#define RF_SINGEN_EN_POS         (31U)
#define RF_SINGEN_EN_LEN         (1U)
#define RF_SINGEN_EN_MSK         (((1U << RF_SINGEN_EN_LEN) - 1) << RF_SINGEN_EN_POS)
#define RF_SINGEN_EN_UMSK        (~(((1U << RF_SINGEN_EN_LEN) - 1) << RF_SINGEN_EN_POS))

/* 0x210 : singen_ctrl1 */
#define RF_SINGEN_CTRL1_OFFSET  (0x210)
#define RF_SINGEN_CLKDIV_Q      RF_SINGEN_CLKDIV_Q
#define RF_SINGEN_CLKDIV_Q_POS  (0U)
#define RF_SINGEN_CLKDIV_Q_LEN  (10U)
#define RF_SINGEN_CLKDIV_Q_MSK  (((1U << RF_SINGEN_CLKDIV_Q_LEN) - 1) << RF_SINGEN_CLKDIV_Q_POS)
#define RF_SINGEN_CLKDIV_Q_UMSK (~(((1U << RF_SINGEN_CLKDIV_Q_LEN) - 1) << RF_SINGEN_CLKDIV_Q_POS))
#define RF_SINGEN_MODE_Q        RF_SINGEN_MODE_Q
#define RF_SINGEN_MODE_Q_POS    (12U)
#define RF_SINGEN_MODE_Q_LEN    (4U)
#define RF_SINGEN_MODE_Q_MSK    (((1U << RF_SINGEN_MODE_Q_LEN) - 1) << RF_SINGEN_MODE_Q_POS)
#define RF_SINGEN_MODE_Q_UMSK   (~(((1U << RF_SINGEN_MODE_Q_LEN) - 1) << RF_SINGEN_MODE_Q_POS))
#define RF_SINGEN_CLKDIV_I      RF_SINGEN_CLKDIV_I
#define RF_SINGEN_CLKDIV_I_POS  (16U)
#define RF_SINGEN_CLKDIV_I_LEN  (10U)
#define RF_SINGEN_CLKDIV_I_MSK  (((1U << RF_SINGEN_CLKDIV_I_LEN) - 1) << RF_SINGEN_CLKDIV_I_POS)
#define RF_SINGEN_CLKDIV_I_UMSK (~(((1U << RF_SINGEN_CLKDIV_I_LEN) - 1) << RF_SINGEN_CLKDIV_I_POS))
#define RF_SINGEN_MODE_I        RF_SINGEN_MODE_I
#define RF_SINGEN_MODE_I_POS    (28U)
#define RF_SINGEN_MODE_I_LEN    (4U)
#define RF_SINGEN_MODE_I_MSK    (((1U << RF_SINGEN_MODE_I_LEN) - 1) << RF_SINGEN_MODE_I_POS)
#define RF_SINGEN_MODE_I_UMSK   (~(((1U << RF_SINGEN_MODE_I_LEN) - 1) << RF_SINGEN_MODE_I_POS))

/* 0x214 : singen_ctrl2 */
#define RF_SINGEN_CTRL2_OFFSET       (0x214)
#define RF_SINGEN_GAIN_I             RF_SINGEN_GAIN_I
#define RF_SINGEN_GAIN_I_POS         (0U)
#define RF_SINGEN_GAIN_I_LEN         (11U)
#define RF_SINGEN_GAIN_I_MSK         (((1U << RF_SINGEN_GAIN_I_LEN) - 1) << RF_SINGEN_GAIN_I_POS)
#define RF_SINGEN_GAIN_I_UMSK        (~(((1U << RF_SINGEN_GAIN_I_LEN) - 1) << RF_SINGEN_GAIN_I_POS))
#define RF_SINGEN_START_ADDR1_I      RF_SINGEN_START_ADDR1_I
#define RF_SINGEN_START_ADDR1_I_POS  (12U)
#define RF_SINGEN_START_ADDR1_I_LEN  (10U)
#define RF_SINGEN_START_ADDR1_I_MSK  (((1U << RF_SINGEN_START_ADDR1_I_LEN) - 1) << RF_SINGEN_START_ADDR1_I_POS)
#define RF_SINGEN_START_ADDR1_I_UMSK (~(((1U << RF_SINGEN_START_ADDR1_I_LEN) - 1) << RF_SINGEN_START_ADDR1_I_POS))
#define RF_SINGEN_START_ADDR0_I      RF_SINGEN_START_ADDR0_I
#define RF_SINGEN_START_ADDR0_I_POS  (22U)
#define RF_SINGEN_START_ADDR0_I_LEN  (10U)
#define RF_SINGEN_START_ADDR0_I_MSK  (((1U << RF_SINGEN_START_ADDR0_I_LEN) - 1) << RF_SINGEN_START_ADDR0_I_POS)
#define RF_SINGEN_START_ADDR0_I_UMSK (~(((1U << RF_SINGEN_START_ADDR0_I_LEN) - 1) << RF_SINGEN_START_ADDR0_I_POS))

/* 0x218 : singen_ctrl3 */
#define RF_SINGEN_CTRL3_OFFSET       (0x218)
#define RF_SINGEN_GAIN_Q             RF_SINGEN_GAIN_Q
#define RF_SINGEN_GAIN_Q_POS         (0U)
#define RF_SINGEN_GAIN_Q_LEN         (11U)
#define RF_SINGEN_GAIN_Q_MSK         (((1U << RF_SINGEN_GAIN_Q_LEN) - 1) << RF_SINGEN_GAIN_Q_POS)
#define RF_SINGEN_GAIN_Q_UMSK        (~(((1U << RF_SINGEN_GAIN_Q_LEN) - 1) << RF_SINGEN_GAIN_Q_POS))
#define RF_SINGEN_START_ADDR1_Q      RF_SINGEN_START_ADDR1_Q
#define RF_SINGEN_START_ADDR1_Q_POS  (12U)
#define RF_SINGEN_START_ADDR1_Q_LEN  (10U)
#define RF_SINGEN_START_ADDR1_Q_MSK  (((1U << RF_SINGEN_START_ADDR1_Q_LEN) - 1) << RF_SINGEN_START_ADDR1_Q_POS)
#define RF_SINGEN_START_ADDR1_Q_UMSK (~(((1U << RF_SINGEN_START_ADDR1_Q_LEN) - 1) << RF_SINGEN_START_ADDR1_Q_POS))
#define RF_SINGEN_START_ADDR0_Q      RF_SINGEN_START_ADDR0_Q
#define RF_SINGEN_START_ADDR0_Q_POS  (22U)
#define RF_SINGEN_START_ADDR0_Q_LEN  (10U)
#define RF_SINGEN_START_ADDR0_Q_MSK  (((1U << RF_SINGEN_START_ADDR0_Q_LEN) - 1) << RF_SINGEN_START_ADDR0_Q_POS)
#define RF_SINGEN_START_ADDR0_Q_UMSK (~(((1U << RF_SINGEN_START_ADDR0_Q_LEN) - 1) << RF_SINGEN_START_ADDR0_Q_POS))

/* 0x21C : singen_ctrl4 */
#define RF_SINGEN_CTRL4_OFFSET  (0x21C)
#define RF_SINGEN_FIX_Q         RF_SINGEN_FIX_Q
#define RF_SINGEN_FIX_Q_POS     (0U)
#define RF_SINGEN_FIX_Q_LEN     (12U)
#define RF_SINGEN_FIX_Q_MSK     (((1U << RF_SINGEN_FIX_Q_LEN) - 1) << RF_SINGEN_FIX_Q_POS)
#define RF_SINGEN_FIX_Q_UMSK    (~(((1U << RF_SINGEN_FIX_Q_LEN) - 1) << RF_SINGEN_FIX_Q_POS))
#define RF_SINGEN_FIX_EN_Q      RF_SINGEN_FIX_EN_Q
#define RF_SINGEN_FIX_EN_Q_POS  (12U)
#define RF_SINGEN_FIX_EN_Q_LEN  (1U)
#define RF_SINGEN_FIX_EN_Q_MSK  (((1U << RF_SINGEN_FIX_EN_Q_LEN) - 1) << RF_SINGEN_FIX_EN_Q_POS)
#define RF_SINGEN_FIX_EN_Q_UMSK (~(((1U << RF_SINGEN_FIX_EN_Q_LEN) - 1) << RF_SINGEN_FIX_EN_Q_POS))
#define RF_SINGEN_FIX_I         RF_SINGEN_FIX_I
#define RF_SINGEN_FIX_I_POS     (16U)
#define RF_SINGEN_FIX_I_LEN     (12U)
#define RF_SINGEN_FIX_I_MSK     (((1U << RF_SINGEN_FIX_I_LEN) - 1) << RF_SINGEN_FIX_I_POS)
#define RF_SINGEN_FIX_I_UMSK    (~(((1U << RF_SINGEN_FIX_I_LEN) - 1) << RF_SINGEN_FIX_I_POS))
#define RF_SINGEN_FIX_EN_I      RF_SINGEN_FIX_EN_I
#define RF_SINGEN_FIX_EN_I_POS  (28U)
#define RF_SINGEN_FIX_EN_I_LEN  (1U)
#define RF_SINGEN_FIX_EN_I_MSK  (((1U << RF_SINGEN_FIX_EN_I_LEN) - 1) << RF_SINGEN_FIX_EN_I_POS)
#define RF_SINGEN_FIX_EN_I_UMSK (~(((1U << RF_SINGEN_FIX_EN_I_LEN) - 1) << RF_SINGEN_FIX_EN_I_POS))

