bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x220 : rfif_dfe_ctrl0 */
#define RFIF_DFE_CTRL0_OFFSET         (0x220)
#define RFCKG_RXCLK_4S_ON             RFCKG_RXCLK_4S_ON
#define RFCKG_RXCLK_4S_ON_POS         (0U)
#define RFCKG_RXCLK_4S_ON_LEN         (1U)
#define RFCKG_RXCLK_4S_ON_MSK         (((1U << RFCKG_RXCLK_4S_ON_LEN) - 1) << RFCKG_RXCLK_4S_ON_POS)
#define RFCKG_RXCLK_4S_ON_UMSK        (~(((1U << RFCKG_RXCLK_4S_ON_LEN) - 1) << RFCKG_RXCLK_4S_ON_POS))
#define RFCKG_TXCLK_4S_ON             RFCKG_TXCLK_4S_ON
#define RFCKG_TXCLK_4S_ON_POS         (1U)
#define RFCKG_TXCLK_4S_ON_LEN         (1U)
#define RFCKG_TXCLK_4S_ON_MSK         (((1U << RFCKG_TXCLK_4S_ON_LEN) - 1) << RFCKG_TXCLK_4S_ON_POS)
#define RFCKG_TXCLK_4S_ON_UMSK        (~(((1U << RFCKG_TXCLK_4S_ON_LEN) - 1) << RFCKG_TXCLK_4S_ON_POS))
#define RFCKG_ADC_AFIFO_INV           RFCKG_ADC_AFIFO_INV
#define RFCKG_ADC_AFIFO_INV_POS       (2U)
#define RFCKG_ADC_AFIFO_INV_LEN       (1U)
#define RFCKG_ADC_AFIFO_INV_MSK       (((1U << RFCKG_ADC_AFIFO_INV_LEN) - 1) << RFCKG_ADC_AFIFO_INV_POS)
#define RFCKG_ADC_AFIFO_INV_UMSK      (~(((1U << RFCKG_ADC_AFIFO_INV_LEN) - 1) << RFCKG_ADC_AFIFO_INV_POS))
#define RFCKG_ADC_CLKOUT_SEL          RFCKG_ADC_CLKOUT_SEL
#define RFCKG_ADC_CLKOUT_SEL_POS      (3U)
#define RFCKG_ADC_CLKOUT_SEL_LEN      (1U)
#define RFCKG_ADC_CLKOUT_SEL_MSK      (((1U << RFCKG_ADC_CLKOUT_SEL_LEN) - 1) << RFCKG_ADC_CLKOUT_SEL_POS)
#define RFCKG_ADC_CLKOUT_SEL_UMSK     (~(((1U << RFCKG_ADC_CLKOUT_SEL_LEN) - 1) << RFCKG_ADC_CLKOUT_SEL_POS))
#define RFCKG_DAC_AFIFO_INV           RFCKG_DAC_AFIFO_INV
#define RFCKG_DAC_AFIFO_INV_POS       (4U)
#define RFCKG_DAC_AFIFO_INV_LEN       (1U)
#define RFCKG_DAC_AFIFO_INV_MSK       (((1U << RFCKG_DAC_AFIFO_INV_LEN) - 1) << RFCKG_DAC_AFIFO_INV_POS)
#define RFCKG_DAC_AFIFO_INV_UMSK      (~(((1U << RFCKG_DAC_AFIFO_INV_LEN) - 1) << RFCKG_DAC_AFIFO_INV_POS))
#define RF_RX_DFE_EN_4S               RF_RX_DFE_EN_4S
#define RF_RX_DFE_EN_4S_POS           (5U)
#define RF_RX_DFE_EN_4S_LEN           (1U)
#define RF_RX_DFE_EN_4S_MSK           (((1U << RF_RX_DFE_EN_4S_LEN) - 1) << RF_RX_DFE_EN_4S_POS)
#define RF_RX_DFE_EN_4S_UMSK          (~(((1U << RF_RX_DFE_EN_4S_LEN) - 1) << RF_RX_DFE_EN_4S_POS))
#define RF_RX_DFE_EN_4S_EN            RF_RX_DFE_EN_4S_EN
#define RF_RX_DFE_EN_4S_EN_POS        (6U)
#define RF_RX_DFE_EN_4S_EN_LEN        (1U)
#define RF_RX_DFE_EN_4S_EN_MSK        (((1U << RF_RX_DFE_EN_4S_EN_LEN) - 1) << RF_RX_DFE_EN_4S_EN_POS)
#define RF_RX_DFE_EN_4S_EN_UMSK       (~(((1U << RF_RX_DFE_EN_4S_EN_LEN) - 1) << RF_RX_DFE_EN_4S_EN_POS))
#define RF_TX_DFE_EN_4S               RF_TX_DFE_EN_4S
#define RF_TX_DFE_EN_4S_POS           (7U)
#define RF_TX_DFE_EN_4S_LEN           (1U)
#define RF_TX_DFE_EN_4S_MSK           (((1U << RF_TX_DFE_EN_4S_LEN) - 1) << RF_TX_DFE_EN_4S_POS)
#define RF_TX_DFE_EN_4S_UMSK          (~(((1U << RF_TX_DFE_EN_4S_LEN) - 1) << RF_TX_DFE_EN_4S_POS))
#define RF_TX_DFE_EN_4S_EN            RF_TX_DFE_EN_4S_EN
#define RF_TX_DFE_EN_4S_EN_POS        (8U)
#define RF_TX_DFE_EN_4S_EN_LEN        (1U)
#define RF_TX_DFE_EN_4S_EN_MSK        (((1U << RF_TX_DFE_EN_4S_EN_LEN) - 1) << RF_TX_DFE_EN_4S_EN_POS)
#define RF_TX_DFE_EN_4S_EN_UMSK       (~(((1U << RF_TX_DFE_EN_4S_EN_LEN) - 1) << RF_TX_DFE_EN_4S_EN_POS))
#define RF_RX_TEST_SEL                RF_RX_TEST_SEL
#define RF_RX_TEST_SEL_POS            (9U)
#define RF_RX_TEST_SEL_LEN            (2U)
#define RF_RX_TEST_SEL_MSK            (((1U << RF_RX_TEST_SEL_LEN) - 1) << RF_RX_TEST_SEL_POS)
#define RF_RX_TEST_SEL_UMSK           (~(((1U << RF_RX_TEST_SEL_LEN) - 1) << RF_RX_TEST_SEL_POS))
#define RF_TX_TEST_SEL                RF_TX_TEST_SEL
#define RF_TX_TEST_SEL_POS            (11U)
#define RF_TX_TEST_SEL_LEN            (2U)
#define RF_TX_TEST_SEL_MSK            (((1U << RF_TX_TEST_SEL_LEN) - 1) << RF_TX_TEST_SEL_POS)
#define RF_TX_TEST_SEL_UMSK           (~(((1U << RF_TX_TEST_SEL_LEN) - 1) << RF_TX_TEST_SEL_POS))
#define RF_PAD_ADC_CLKOUT_INV_EN      RF_PAD_ADC_CLKOUT_INV_EN
#define RF_PAD_ADC_CLKOUT_INV_EN_POS  (13U)
#define RF_PAD_ADC_CLKOUT_INV_EN_LEN  (1U)
#define RF_PAD_ADC_CLKOUT_INV_EN_MSK  (((1U << RF_PAD_ADC_CLKOUT_INV_EN_LEN) - 1) << RF_PAD_ADC_CLKOUT_INV_EN_POS)
#define RF_PAD_ADC_CLKOUT_INV_EN_UMSK (~(((1U << RF_PAD_ADC_CLKOUT_INV_EN_LEN) - 1) << RF_PAD_ADC_CLKOUT_INV_EN_POS))
#define RF_PAD_DAC_CLKOUT_INV_EN      RF_PAD_DAC_CLKOUT_INV_EN
#define RF_PAD_DAC_CLKOUT_INV_EN_POS  (14U)
#define RF_PAD_DAC_CLKOUT_INV_EN_LEN  (1U)
#define RF_PAD_DAC_CLKOUT_INV_EN_MSK  (((1U << RF_PAD_DAC_CLKOUT_INV_EN_LEN) - 1) << RF_PAD_DAC_CLKOUT_INV_EN_POS)
#define RF_PAD_DAC_CLKOUT_INV_EN_UMSK (~(((1U << RF_PAD_DAC_CLKOUT_INV_EN_LEN) - 1) << RF_PAD_DAC_CLKOUT_INV_EN_POS))
#define RF_CH_IND_BLE_4S              RF_CH_IND_BLE_4S
#define RF_CH_IND_BLE_4S_POS          (15U)
#define RF_CH_IND_BLE_4S_LEN          (7U)
#define RF_CH_IND_BLE_4S_MSK          (((1U << RF_CH_IND_BLE_4S_LEN) - 1) << RF_CH_IND_BLE_4S_POS)
#define RF_CH_IND_BLE_4S_UMSK         (~(((1U << RF_CH_IND_BLE_4S_LEN) - 1) << RF_CH_IND_BLE_4S_POS))
#define RF_CH_IND_BLE_4S_EN           RF_CH_IND_BLE_4S_EN
#define RF_CH_IND_BLE_4S_EN_POS       (22U)
#define RF_CH_IND_BLE_4S_EN_LEN       (1U)
#define RF_CH_IND_BLE_4S_EN_MSK       (((1U << RF_CH_IND_BLE_4S_EN_LEN) - 1) << RF_CH_IND_BLE_4S_EN_POS)
#define RF_CH_IND_BLE_4S_EN_UMSK      (~(((1U << RF_CH_IND_BLE_4S_EN_LEN) - 1) << RF_CH_IND_BLE_4S_EN_POS))
#define RF_WIFIMODE_4S                RF_WIFIMODE_4S
#define RF_WIFIMODE_4S_POS            (23U)
#define RF_WIFIMODE_4S_LEN            (2U)
#define RF_WIFIMODE_4S_MSK            (((1U << RF_WIFIMODE_4S_LEN) - 1) << RF_WIFIMODE_4S_POS)
#define RF_WIFIMODE_4S_UMSK           (~(((1U << RF_WIFIMODE_4S_LEN) - 1) << RF_WIFIMODE_4S_POS))
#define RF_WIFIMODE_4S_EN             RF_WIFIMODE_4S_EN
#define RF_WIFIMODE_4S_EN_POS         (25U)
#define RF_WIFIMODE_4S_EN_LEN         (1U)
#define RF_WIFIMODE_4S_EN_MSK         (((1U << RF_WIFIMODE_4S_EN_LEN) - 1) << RF_WIFIMODE_4S_EN_POS)
#define RF_WIFIMODE_4S_EN_UMSK        (~(((1U << RF_WIFIMODE_4S_EN_LEN) - 1) << RF_WIFIMODE_4S_EN_POS))
#define RF_BBMODE_4S                  RF_BBMODE_4S
#define RF_BBMODE_4S_POS              (26U)
#define RF_BBMODE_4S_LEN              (1U)
#define RF_BBMODE_4S_MSK              (((1U << RF_BBMODE_4S_LEN) - 1) << RF_BBMODE_4S_POS)
#define RF_BBMODE_4S_UMSK             (~(((1U << RF_BBMODE_4S_LEN) - 1) << RF_BBMODE_4S_POS))
#define RF_BBMODE_4S_EN               RF_BBMODE_4S_EN
#define RF_BBMODE_4S_EN_POS           (27U)
#define RF_BBMODE_4S_EN_LEN           (1U)
#define RF_BBMODE_4S_EN_MSK           (((1U << RF_BBMODE_4S_EN_LEN) - 1) << RF_BBMODE_4S_EN_POS)
#define RF_BBMODE_4S_EN_UMSK          (~(((1U << RF_BBMODE_4S_EN_LEN) - 1) << RF_BBMODE_4S_EN_POS))
#define RF_TEST_SEL                   RF_TEST_SEL
#define RF_TEST_SEL_POS               (28U)
#define RF_TEST_SEL_LEN               (4U)
#define RF_TEST_SEL_MSK               (((1U << RF_TEST_SEL_LEN) - 1) << RF_TEST_SEL_POS)
#define RF_TEST_SEL_UMSK              (~(((1U << RF_TEST_SEL_LEN) - 1) << RF_TEST_SEL_POS))

