bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x224 : rfif_test_read */
#define RFIF_TEST_READ_OFFSET (0x224)
#define RF_TEST_READ          RF_TEST_READ
#define RF_TEST_READ_POS      (0U)
#define RF_TEST_READ_LEN      (32U)
#define RF_TEST_READ_MSK      (((1U << RF_TEST_READ_LEN) - 1) << RF_TEST_READ_POS)
#define RF_TEST_READ_UMSK     (~(((1U << RF_TEST_READ_LEN) - 1) << RF_TEST_READ_POS))

/* 0x228 : rfif_dig_ctrl */
#define RFIF_DIG_CTRL_OFFSET           (0x228)
#define RF_TEST_FROM_PAD_EN            RF_TEST_FROM_PAD_EN
#define RF_TEST_FROM_PAD_EN_POS        (0U)
#define RF_TEST_FROM_PAD_EN_LEN        (1U)
#define RF_TEST_FROM_PAD_EN_MSK        (((1U << RF_TEST_FROM_PAD_EN_LEN) - 1) << RF_TEST_FROM_PAD_EN_POS)
#define RF_TEST_FROM_PAD_EN_UMSK       (~(((1U << RF_TEST_FROM_PAD_EN_LEN) - 1) << RF_TEST_FROM_PAD_EN_POS))
#define RF_TEST_GC_FROM_PAD_EN         RF_TEST_GC_FROM_PAD_EN
#define RF_TEST_GC_FROM_PAD_EN_POS     (1U)
#define RF_TEST_GC_FROM_PAD_EN_LEN     (1U)
#define RF_TEST_GC_FROM_PAD_EN_MSK     (((1U << RF_TEST_GC_FROM_PAD_EN_LEN) - 1) << RF_TEST_GC_FROM_PAD_EN_POS)
#define RF_TEST_GC_FROM_PAD_EN_UMSK    (~(((1U << RF_TEST_GC_FROM_PAD_EN_LEN) - 1) << RF_TEST_GC_FROM_PAD_EN_POS))
#define RFCKG_RXCLK_DIV2_MODE          RFCKG_RXCLK_DIV2_MODE
#define RFCKG_RXCLK_DIV2_MODE_POS      (2U)
#define RFCKG_RXCLK_DIV2_MODE_LEN      (1U)
#define RFCKG_RXCLK_DIV2_MODE_MSK      (((1U << RFCKG_RXCLK_DIV2_MODE_LEN) - 1) << RFCKG_RXCLK_DIV2_MODE_POS)
#define RFCKG_RXCLK_DIV2_MODE_UMSK     (~(((1U << RFCKG_RXCLK_DIV2_MODE_LEN) - 1) << RFCKG_RXCLK_DIV2_MODE_POS))
#define RFIF_INT_LO_UNLOCKED_MASK      RFIF_INT_LO_UNLOCKED_MASK
#define RFIF_INT_LO_UNLOCKED_MASK_POS  (3U)
#define RFIF_INT_LO_UNLOCKED_MASK_LEN  (1U)
#define RFIF_INT_LO_UNLOCKED_MASK_MSK  (((1U << RFIF_INT_LO_UNLOCKED_MASK_LEN) - 1) << RFIF_INT_LO_UNLOCKED_MASK_POS)
#define RFIF_INT_LO_UNLOCKED_MASK_UMSK (~(((1U << RFIF_INT_LO_UNLOCKED_MASK_LEN) - 1) << RFIF_INT_LO_UNLOCKED_MASK_POS))
#define RFIF_PPUD_CNT2                 RFIF_PPUD_CNT2
#define RFIF_PPUD_CNT2_POS             (16U)
#define RFIF_PPUD_CNT2_LEN             (9U)
#define RFIF_PPUD_CNT2_MSK             (((1U << RFIF_PPUD_CNT2_LEN) - 1) << RFIF_PPUD_CNT2_POS)
#define RFIF_PPUD_CNT2_UMSK            (~(((1U << RFIF_PPUD_CNT2_LEN) - 1) << RFIF_PPUD_CNT2_POS))
#define RFIF_PPUD_CNT1                 RFIF_PPUD_CNT1
#define RFIF_PPUD_CNT1_POS             (25U)
#define RFIF_PPUD_CNT1_LEN             (5U)
#define RFIF_PPUD_CNT1_MSK             (((1U << RFIF_PPUD_CNT1_LEN) - 1) << RFIF_PPUD_CNT1_POS)
#define RFIF_PPUD_CNT1_UMSK            (~(((1U << RFIF_PPUD_CNT1_LEN) - 1) << RFIF_PPUD_CNT1_POS))
#define RFIF_PPUD_MANAUAL_EN           RFIF_PPUD_MANAUAL_EN
#define RFIF_PPUD_MANAUAL_EN_POS       (30U)
#define RFIF_PPUD_MANAUAL_EN_LEN       (1U)
#define RFIF_PPUD_MANAUAL_EN_MSK       (((1U << RFIF_PPUD_MANAUAL_EN_LEN) - 1) << RFIF_PPUD_MANAUAL_EN_POS)
#define RFIF_PPUD_MANAUAL_EN_UMSK      (~(((1U << RFIF_PPUD_MANAUAL_EN_LEN) - 1) << RFIF_PPUD_MANAUAL_EN_POS))

/* 0x22C : rf_data_temp_0 */
#define RF_DATA_TEMP_0_OFFSET (0x22C)
#define RF_DATA_TEMP_0        RF_DATA_TEMP_0
#define RF_DATA_TEMP_0_POS    (0U)
#define RF_DATA_TEMP_0_LEN    (32U)
#define RF_DATA_TEMP_0_MSK    (((1U << RF_DATA_TEMP_0_LEN) - 1) << RF_DATA_TEMP_0_POS)
#define RF_DATA_TEMP_0_UMSK   (~(((1U << RF_DATA_TEMP_0_LEN) - 1) << RF_DATA_TEMP_0_POS))

/* 0x230 : rf_data_temp_1 */
#define RF_DATA_TEMP_1_OFFSET (0x230)
#define RF_DATA_TEMP_1        RF_DATA_TEMP_1
#define RF_DATA_TEMP_1_POS    (0U)
#define RF_DATA_TEMP_1_LEN    (32U)
#define RF_DATA_TEMP_1_MSK    (((1U << RF_DATA_TEMP_1_LEN) - 1) << RF_DATA_TEMP_1_POS)
#define RF_DATA_TEMP_1_UMSK   (~(((1U << RF_DATA_TEMP_1_LEN) - 1) << RF_DATA_TEMP_1_POS))

/* 0x234 : rf_data_temp_2 */
#define RF_DATA_TEMP_2_OFFSET (0x234)
#define RF_DATA_TEMP_2        RF_DATA_TEMP_2
#define RF_DATA_TEMP_2_POS    (0U)
#define RF_DATA_TEMP_2_LEN    (32U)
#define RF_DATA_TEMP_2_MSK    (((1U << RF_DATA_TEMP_2_LEN) - 1) << RF_DATA_TEMP_2_POS)
#define RF_DATA_TEMP_2_UMSK   (~(((1U << RF_DATA_TEMP_2_LEN) - 1) << RF_DATA_TEMP_2_POS))

/* 0x238 : rf_data_temp_3 */
#define RF_DATA_TEMP_3_OFFSET (0x238)
#define RF_DATA_TEMP_3        RF_DATA_TEMP_3
#define RF_DATA_TEMP_3_POS    (0U)
#define RF_DATA_TEMP_3_LEN    (32U)
#define RF_DATA_TEMP_3_MSK    (((1U << RF_DATA_TEMP_3_LEN) - 1) << RF_DATA_TEMP_3_POS)
#define RF_DATA_TEMP_3_UMSK   (~(((1U << RF_DATA_TEMP_3_LEN) - 1) << RF_DATA_TEMP_3_POS))

/* 0x23C : rf_sram_ctrl0 */
#define RF_SRAM_CTRL0_OFFSET   (0x23C)
#define RF_SRAM_LINK_DLY       RF_SRAM_LINK_DLY
#define RF_SRAM_LINK_DLY_POS   (0U)
#define RF_SRAM_LINK_DLY_LEN   (16U)
#define RF_SRAM_LINK_DLY_MSK   (((1U << RF_SRAM_LINK_DLY_LEN) - 1) << RF_SRAM_LINK_DLY_POS)
#define RF_SRAM_LINK_DLY_UMSK  (~(((1U << RF_SRAM_LINK_DLY_LEN) - 1) << RF_SRAM_LINK_DLY_POS))
#define RF_SRAM_LINK_MODE      RF_SRAM_LINK_MODE
#define RF_SRAM_LINK_MODE_POS  (16U)
#define RF_SRAM_LINK_MODE_LEN  (2U)
#define RF_SRAM_LINK_MODE_MSK  (((1U << RF_SRAM_LINK_MODE_LEN) - 1) << RF_SRAM_LINK_MODE_POS)
#define RF_SRAM_LINK_MODE_UMSK (~(((1U << RF_SRAM_LINK_MODE_LEN) - 1) << RF_SRAM_LINK_MODE_POS))
#define RF_SRAM_SWAP           RF_SRAM_SWAP
#define RF_SRAM_SWAP_POS       (18U)
#define RF_SRAM_SWAP_LEN       (1U)
#define RF_SRAM_SWAP_MSK       (((1U << RF_SRAM_SWAP_LEN) - 1) << RF_SRAM_SWAP_POS)
#define RF_SRAM_SWAP_UMSK      (~(((1U << RF_SRAM_SWAP_LEN) - 1) << RF_SRAM_SWAP_POS))
#define RF_SRAM_EXT_CLR        RF_SRAM_EXT_CLR
#define RF_SRAM_EXT_CLR_POS    (19U)
#define RF_SRAM_EXT_CLR_LEN    (1U)
#define RF_SRAM_EXT_CLR_MSK    (((1U << RF_SRAM_EXT_CLR_LEN) - 1) << RF_SRAM_EXT_CLR_POS)
#define RF_SRAM_EXT_CLR_UMSK   (~(((1U << RF_SRAM_EXT_CLR_LEN) - 1) << RF_SRAM_EXT_CLR_POS))

/* 0x240 : rf_sram_ctrl1 */
#define RF_SRAM_CTRL1_OFFSET      (0x240)
#define RF_SRAM_ADC_DONE          RF_SRAM_ADC_DONE
#define RF_SRAM_ADC_DONE_POS      (0U)
#define RF_SRAM_ADC_DONE_LEN      (1U)
#define RF_SRAM_ADC_DONE_MSK      (((1U << RF_SRAM_ADC_DONE_LEN) - 1) << RF_SRAM_ADC_DONE_POS)
#define RF_SRAM_ADC_DONE_UMSK     (~(((1U << RF_SRAM_ADC_DONE_LEN) - 1) << RF_SRAM_ADC_DONE_POS))
#define RF_SRAM_ADC_EN            RF_SRAM_ADC_EN
#define RF_SRAM_ADC_EN_POS        (1U)
#define RF_SRAM_ADC_EN_LEN        (1U)
#define RF_SRAM_ADC_EN_MSK        (((1U << RF_SRAM_ADC_EN_LEN) - 1) << RF_SRAM_ADC_EN_POS)
#define RF_SRAM_ADC_EN_UMSK       (~(((1U << RF_SRAM_ADC_EN_LEN) - 1) << RF_SRAM_ADC_EN_POS))
#define RF_SRAM_ADC_LOOP_EN       RF_SRAM_ADC_LOOP_EN
#define RF_SRAM_ADC_LOOP_EN_POS   (2U)
#define RF_SRAM_ADC_LOOP_EN_LEN   (1U)
#define RF_SRAM_ADC_LOOP_EN_MSK   (((1U << RF_SRAM_ADC_LOOP_EN_LEN) - 1) << RF_SRAM_ADC_LOOP_EN_POS)
#define RF_SRAM_ADC_LOOP_EN_UMSK  (~(((1U << RF_SRAM_ADC_LOOP_EN_LEN) - 1) << RF_SRAM_ADC_LOOP_EN_POS))
#define RF_SRAM_ADC_STS_CLR       RF_SRAM_ADC_STS_CLR
#define RF_SRAM_ADC_STS_CLR_POS   (3U)
#define RF_SRAM_ADC_STS_CLR_LEN   (1U)
#define RF_SRAM_ADC_STS_CLR_MSK   (((1U << RF_SRAM_ADC_STS_CLR_LEN) - 1) << RF_SRAM_ADC_STS_CLR_POS)
#define RF_SRAM_ADC_STS_CLR_UMSK  (~(((1U << RF_SRAM_ADC_STS_CLR_LEN) - 1) << RF_SRAM_ADC_STS_CLR_POS))
#define RF_SRAM_ADC_DONE_CNT      RF_SRAM_ADC_DONE_CNT
#define RF_SRAM_ADC_DONE_CNT_POS  (16U)
#define RF_SRAM_ADC_DONE_CNT_LEN  (16U)
#define RF_SRAM_ADC_DONE_CNT_MSK  (((1U << RF_SRAM_ADC_DONE_CNT_LEN) - 1) << RF_SRAM_ADC_DONE_CNT_POS)
#define RF_SRAM_ADC_DONE_CNT_UMSK (~(((1U << RF_SRAM_ADC_DONE_CNT_LEN) - 1) << RF_SRAM_ADC_DONE_CNT_POS))

/* 0x244 : rf_sram_ctrl2 */
#define RF_SRAM_CTRL2_OFFSET        (0x244)
#define RF_SRAM_ADC_ADDR_END        RF_SRAM_ADC_ADDR_END
#define RF_SRAM_ADC_ADDR_END_POS    (0U)
#define RF_SRAM_ADC_ADDR_END_LEN    (16U)
#define RF_SRAM_ADC_ADDR_END_MSK    (((1U << RF_SRAM_ADC_ADDR_END_LEN) - 1) << RF_SRAM_ADC_ADDR_END_POS)
#define RF_SRAM_ADC_ADDR_END_UMSK   (~(((1U << RF_SRAM_ADC_ADDR_END_LEN) - 1) << RF_SRAM_ADC_ADDR_END_POS))
#define RF_SRAM_ADC_ADDR_START      RF_SRAM_ADC_ADDR_START
#define RF_SRAM_ADC_ADDR_START_POS  (16U)
#define RF_SRAM_ADC_ADDR_START_LEN  (16U)
#define RF_SRAM_ADC_ADDR_START_MSK  (((1U << RF_SRAM_ADC_ADDR_START_LEN) - 1) << RF_SRAM_ADC_ADDR_START_POS)
#define RF_SRAM_ADC_ADDR_START_UMSK (~(((1U << RF_SRAM_ADC_ADDR_START_LEN) - 1) << RF_SRAM_ADC_ADDR_START_POS))

