bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x248 : rf_sram_ctrl3 */
#define RF_SRAM_CTRL3_OFFSET (0x248)
#define RF_SRAM_ADC_STS      RF_SRAM_ADC_STS
#define RF_SRAM_ADC_STS_POS  (0U)
#define RF_SRAM_ADC_STS_LEN  (32U)
#define RF_SRAM_ADC_STS_MSK  (((1U << RF_SRAM_ADC_STS_LEN) - 1) << RF_SRAM_ADC_STS_POS)
#define RF_SRAM_ADC_STS_UMSK (~(((1U << RF_SRAM_ADC_STS_LEN) - 1) << RF_SRAM_ADC_STS_POS))

/* 0x24C : rf_sram_ctrl4 */
#define RF_SRAM_CTRL4_OFFSET      (0x24C)
#define RF_SRAM_DAC_DONE          RF_SRAM_DAC_DONE
#define RF_SRAM_DAC_DONE_POS      (0U)
#define RF_SRAM_DAC_DONE_LEN      (1U)
#define RF_SRAM_DAC_DONE_MSK      (((1U << RF_SRAM_DAC_DONE_LEN) - 1) << RF_SRAM_DAC_DONE_POS)
#define RF_SRAM_DAC_DONE_UMSK     (~(((1U << RF_SRAM_DAC_DONE_LEN) - 1) << RF_SRAM_DAC_DONE_POS))
#define RF_SRAM_DAC_EN            RF_SRAM_DAC_EN
#define RF_SRAM_DAC_EN_POS        (1U)
#define RF_SRAM_DAC_EN_LEN        (1U)
#define RF_SRAM_DAC_EN_MSK        (((1U << RF_SRAM_DAC_EN_LEN) - 1) << RF_SRAM_DAC_EN_POS)
#define RF_SRAM_DAC_EN_UMSK       (~(((1U << RF_SRAM_DAC_EN_LEN) - 1) << RF_SRAM_DAC_EN_POS))
#define RF_SRAM_DAC_LOOP_EN       RF_SRAM_DAC_LOOP_EN
#define RF_SRAM_DAC_LOOP_EN_POS   (2U)
#define RF_SRAM_DAC_LOOP_EN_LEN   (1U)
#define RF_SRAM_DAC_LOOP_EN_MSK   (((1U << RF_SRAM_DAC_LOOP_EN_LEN) - 1) << RF_SRAM_DAC_LOOP_EN_POS)
#define RF_SRAM_DAC_LOOP_EN_UMSK  (~(((1U << RF_SRAM_DAC_LOOP_EN_LEN) - 1) << RF_SRAM_DAC_LOOP_EN_POS))
#define RF_SRAM_DAC_STS_CLR       RF_SRAM_DAC_STS_CLR
#define RF_SRAM_DAC_STS_CLR_POS   (3U)
#define RF_SRAM_DAC_STS_CLR_LEN   (1U)
#define RF_SRAM_DAC_STS_CLR_MSK   (((1U << RF_SRAM_DAC_STS_CLR_LEN) - 1) << RF_SRAM_DAC_STS_CLR_POS)
#define RF_SRAM_DAC_STS_CLR_UMSK  (~(((1U << RF_SRAM_DAC_STS_CLR_LEN) - 1) << RF_SRAM_DAC_STS_CLR_POS))
#define RF_SRAM_DAC_DONE_CNT      RF_SRAM_DAC_DONE_CNT
#define RF_SRAM_DAC_DONE_CNT_POS  (16U)
#define RF_SRAM_DAC_DONE_CNT_LEN  (16U)
#define RF_SRAM_DAC_DONE_CNT_MSK  (((1U << RF_SRAM_DAC_DONE_CNT_LEN) - 1) << RF_SRAM_DAC_DONE_CNT_POS)
#define RF_SRAM_DAC_DONE_CNT_UMSK (~(((1U << RF_SRAM_DAC_DONE_CNT_LEN) - 1) << RF_SRAM_DAC_DONE_CNT_POS))

/* 0x250 : rf_sram_ctrl5 */
#define RF_SRAM_CTRL5_OFFSET        (0x250)
#define RF_SRAM_DAC_ADDR_END        RF_SRAM_DAC_ADDR_END
#define RF_SRAM_DAC_ADDR_END_POS    (0U)
#define RF_SRAM_DAC_ADDR_END_LEN    (16U)
#define RF_SRAM_DAC_ADDR_END_MSK    (((1U << RF_SRAM_DAC_ADDR_END_LEN) - 1) << RF_SRAM_DAC_ADDR_END_POS)
#define RF_SRAM_DAC_ADDR_END_UMSK   (~(((1U << RF_SRAM_DAC_ADDR_END_LEN) - 1) << RF_SRAM_DAC_ADDR_END_POS))
#define RF_SRAM_DAC_ADDR_START      RF_SRAM_DAC_ADDR_START
#define RF_SRAM_DAC_ADDR_START_POS  (16U)
#define RF_SRAM_DAC_ADDR_START_LEN  (16U)
#define RF_SRAM_DAC_ADDR_START_MSK  (((1U << RF_SRAM_DAC_ADDR_START_LEN) - 1) << RF_SRAM_DAC_ADDR_START_POS)
#define RF_SRAM_DAC_ADDR_START_UMSK (~(((1U << RF_SRAM_DAC_ADDR_START_LEN) - 1) << RF_SRAM_DAC_ADDR_START_POS))

/* 0x254 : rf_sram_ctrl6 */
#define RF_SRAM_CTRL6_OFFSET (0x254)
#define RF_SRAM_DAC_STS      RF_SRAM_DAC_STS
#define RF_SRAM_DAC_STS_POS  (0U)
#define RF_SRAM_DAC_STS_LEN  (32U)
#define RF_SRAM_DAC_STS_MSK  (((1U << RF_SRAM_DAC_STS_LEN) - 1) << RF_SRAM_DAC_STS_POS)
#define RF_SRAM_DAC_STS_UMSK (~(((1U << RF_SRAM_DAC_STS_LEN) - 1) << RF_SRAM_DAC_STS_POS))

/* 0x258 : rf_ical_ctrl0 */
#define RF_ICAL_CTRL0_OFFSET     (0x258)
#define RF_ICAL_R_CNT_N          RF_ICAL_R_CNT_N
#define RF_ICAL_R_CNT_N_POS      (0U)
#define RF_ICAL_R_CNT_N_LEN      (10U)
#define RF_ICAL_R_CNT_N_MSK      (((1U << RF_ICAL_R_CNT_N_LEN) - 1) << RF_ICAL_R_CNT_N_POS)
#define RF_ICAL_R_CNT_N_UMSK     (~(((1U << RF_ICAL_R_CNT_N_LEN) - 1) << RF_ICAL_R_CNT_N_POS))
#define RF_ICAL_A_CNT_N          RF_ICAL_A_CNT_N
#define RF_ICAL_A_CNT_N_POS      (10U)
#define RF_ICAL_A_CNT_N_LEN      (10U)
#define RF_ICAL_A_CNT_N_MSK      (((1U << RF_ICAL_A_CNT_N_LEN) - 1) << RF_ICAL_A_CNT_N_POS)
#define RF_ICAL_A_CNT_N_UMSK     (~(((1U << RF_ICAL_A_CNT_N_LEN) - 1) << RF_ICAL_A_CNT_N_POS))
#define RF_ICAL_F_CNT_N          RF_ICAL_F_CNT_N
#define RF_ICAL_F_CNT_N_POS      (20U)
#define RF_ICAL_F_CNT_N_LEN      (10U)
#define RF_ICAL_F_CNT_N_MSK      (((1U << RF_ICAL_F_CNT_N_LEN) - 1) << RF_ICAL_F_CNT_N_POS)
#define RF_ICAL_F_CNT_N_UMSK     (~(((1U << RF_ICAL_F_CNT_N_LEN) - 1) << RF_ICAL_F_CNT_N_POS))
#define RF_ICAL_A_UD_INV_EN      RF_ICAL_A_UD_INV_EN
#define RF_ICAL_A_UD_INV_EN_POS  (30U)
#define RF_ICAL_A_UD_INV_EN_LEN  (1U)
#define RF_ICAL_A_UD_INV_EN_MSK  (((1U << RF_ICAL_A_UD_INV_EN_LEN) - 1) << RF_ICAL_A_UD_INV_EN_POS)
#define RF_ICAL_A_UD_INV_EN_UMSK (~(((1U << RF_ICAL_A_UD_INV_EN_LEN) - 1) << RF_ICAL_A_UD_INV_EN_POS))
#define RF_ICAL_F_UD_INV_EN      RF_ICAL_F_UD_INV_EN
#define RF_ICAL_F_UD_INV_EN_POS  (31U)
#define RF_ICAL_F_UD_INV_EN_LEN  (1U)
#define RF_ICAL_F_UD_INV_EN_MSK  (((1U << RF_ICAL_F_UD_INV_EN_LEN) - 1) << RF_ICAL_F_UD_INV_EN_POS)
#define RF_ICAL_F_UD_INV_EN_UMSK (~(((1U << RF_ICAL_F_UD_INV_EN_LEN) - 1) << RF_ICAL_F_UD_INV_EN_POS))

/* 0x25C : rf_ical_ctrl1 */
#define RF_ICAL_CTRL1_OFFSET (0x25C)
#define RF_ICAL_R_AVG_N      RF_ICAL_R_AVG_N
#define RF_ICAL_R_AVG_N_POS  (0U)
#define RF_ICAL_R_AVG_N_LEN  (5U)
#define RF_ICAL_R_AVG_N_MSK  (((1U << RF_ICAL_R_AVG_N_LEN) - 1) << RF_ICAL_R_AVG_N_POS)
#define RF_ICAL_R_AVG_N_UMSK (~(((1U << RF_ICAL_R_AVG_N_LEN) - 1) << RF_ICAL_R_AVG_N_POS))
#define RF_ICAL_R_OS_Q       RF_ICAL_R_OS_Q
#define RF_ICAL_R_OS_Q_POS   (10U)
#define RF_ICAL_R_OS_Q_LEN   (10U)
#define RF_ICAL_R_OS_Q_MSK   (((1U << RF_ICAL_R_OS_Q_LEN) - 1) << RF_ICAL_R_OS_Q_POS)
#define RF_ICAL_R_OS_Q_UMSK  (~(((1U << RF_ICAL_R_OS_Q_LEN) - 1) << RF_ICAL_R_OS_Q_POS))
#define RF_ICAL_R_OS_I       RF_ICAL_R_OS_I
#define RF_ICAL_R_OS_I_POS   (20U)
#define RF_ICAL_R_OS_I_LEN   (10U)
#define RF_ICAL_R_OS_I_MSK   (((1U << RF_ICAL_R_OS_I_LEN) - 1) << RF_ICAL_R_OS_I_POS)
#define RF_ICAL_R_OS_I_UMSK  (~(((1U << RF_ICAL_R_OS_I_LEN) - 1) << RF_ICAL_R_OS_I_POS))

/* 0x260 : rf_ical_ctrl2 */
#define RF_ICAL_CTRL2_OFFSET  (0x260)
#define RF_ICAL_PERIOD_N      RF_ICAL_PERIOD_N
#define RF_ICAL_PERIOD_N_POS  (0U)
#define RF_ICAL_PERIOD_N_LEN  (16U)
#define RF_ICAL_PERIOD_N_MSK  (((1U << RF_ICAL_PERIOD_N_LEN) - 1) << RF_ICAL_PERIOD_N_POS)
#define RF_ICAL_PERIOD_N_UMSK (~(((1U << RF_ICAL_PERIOD_N_LEN) - 1) << RF_ICAL_PERIOD_N_POS))

