bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x264 : rf_fsm_ctrl0 */
#define RF_FSM_CTRL0_OFFSET (0x264)
#define RF_CH_IND_WIFI      RF_CH_IND_WIFI
#define RF_CH_IND_WIFI_POS  (0U)
#define RF_CH_IND_WIFI_LEN  (12U)
#define RF_CH_IND_WIFI_MSK  (((1U << RF_CH_IND_WIFI_LEN) - 1) << RF_CH_IND_WIFI_POS)
#define RF_CH_IND_WIFI_UMSK (~(((1U << RF_CH_IND_WIFI_LEN) - 1) << RF_CH_IND_WIFI_POS))

/* 0x268 : rf_fsm_ctrl1 */
#define RF_FSM_CTRL1_OFFSET      (0x268)
#define RF_FSM_LO_TIME           RF_FSM_LO_TIME
#define RF_FSM_LO_TIME_POS       (0U)
#define RF_FSM_LO_TIME_LEN       (16U)
#define RF_FSM_LO_TIME_MSK       (((1U << RF_FSM_LO_TIME_LEN) - 1) << RF_FSM_LO_TIME_POS)
#define RF_FSM_LO_TIME_UMSK      (~(((1U << RF_FSM_LO_TIME_LEN) - 1) << RF_FSM_LO_TIME_POS))
#define RF_FSM_LO_RDY            RF_FSM_LO_RDY
#define RF_FSM_LO_RDY_POS        (16U)
#define RF_FSM_LO_RDY_LEN        (1U)
#define RF_FSM_LO_RDY_MSK        (((1U << RF_FSM_LO_RDY_LEN) - 1) << RF_FSM_LO_RDY_POS)
#define RF_FSM_LO_RDY_UMSK       (~(((1U << RF_FSM_LO_RDY_LEN) - 1) << RF_FSM_LO_RDY_POS))
#define RF_FSM_LO_RDY_RST        RF_FSM_LO_RDY_RST
#define RF_FSM_LO_RDY_RST_POS    (17U)
#define RF_FSM_LO_RDY_RST_LEN    (1U)
#define RF_FSM_LO_RDY_RST_MSK    (((1U << RF_FSM_LO_RDY_RST_LEN) - 1) << RF_FSM_LO_RDY_RST_POS)
#define RF_FSM_LO_RDY_RST_UMSK   (~(((1U << RF_FSM_LO_RDY_RST_LEN) - 1) << RF_FSM_LO_RDY_RST_POS))
#define RF_FSM_LO_RDY_4S_1       RF_FSM_LO_RDY_4S_1
#define RF_FSM_LO_RDY_4S_1_POS   (18U)
#define RF_FSM_LO_RDY_4S_1_LEN   (1U)
#define RF_FSM_LO_RDY_4S_1_MSK   (((1U << RF_FSM_LO_RDY_4S_1_LEN) - 1) << RF_FSM_LO_RDY_4S_1_POS)
#define RF_FSM_LO_RDY_4S_1_UMSK  (~(((1U << RF_FSM_LO_RDY_4S_1_LEN) - 1) << RF_FSM_LO_RDY_4S_1_POS))
#define RF_FSM_LO_RDY_SBCLR      RF_FSM_LO_RDY_SBCLR
#define RF_FSM_LO_RDY_SBCLR_POS  (19U)
#define RF_FSM_LO_RDY_SBCLR_LEN  (1U)
#define RF_FSM_LO_RDY_SBCLR_MSK  (((1U << RF_FSM_LO_RDY_SBCLR_LEN) - 1) << RF_FSM_LO_RDY_SBCLR_POS)
#define RF_FSM_LO_RDY_SBCLR_UMSK (~(((1U << RF_FSM_LO_RDY_SBCLR_LEN) - 1) << RF_FSM_LO_RDY_SBCLR_POS))
#define RF_FSM_PU_PA_DLY_N       RF_FSM_PU_PA_DLY_N
#define RF_FSM_PU_PA_DLY_N_POS   (20U)
#define RF_FSM_PU_PA_DLY_N_LEN   (10U)
#define RF_FSM_PU_PA_DLY_N_MSK   (((1U << RF_FSM_PU_PA_DLY_N_LEN) - 1) << RF_FSM_PU_PA_DLY_N_POS)
#define RF_FSM_PU_PA_DLY_N_UMSK  (~(((1U << RF_FSM_PU_PA_DLY_N_LEN) - 1) << RF_FSM_PU_PA_DLY_N_POS))

/* 0x26C : rf_fsm_ctrl2 */
#define RF_FSM_CTRL2_OFFSET      (0x26C)
#define RF_FSM_ST_DBG            RF_FSM_ST_DBG
#define RF_FSM_ST_DBG_POS        (0U)
#define RF_FSM_ST_DBG_LEN        (3U)
#define RF_FSM_ST_DBG_MSK        (((1U << RF_FSM_ST_DBG_LEN) - 1) << RF_FSM_ST_DBG_POS)
#define RF_FSM_ST_DBG_UMSK       (~(((1U << RF_FSM_ST_DBG_LEN) - 1) << RF_FSM_ST_DBG_POS))
#define RF_FSM_ST_DBG_EN         RF_FSM_ST_DBG_EN
#define RF_FSM_ST_DBG_EN_POS     (3U)
#define RF_FSM_ST_DBG_EN_LEN     (1U)
#define RF_FSM_ST_DBG_EN_MSK     (((1U << RF_FSM_ST_DBG_EN_LEN) - 1) << RF_FSM_ST_DBG_EN_POS)
#define RF_FSM_ST_DBG_EN_UMSK    (~(((1U << RF_FSM_ST_DBG_EN_LEN) - 1) << RF_FSM_ST_DBG_EN_POS))
#define RF_TRX_EN_BLE_4S         RF_TRX_EN_BLE_4S
#define RF_TRX_EN_BLE_4S_POS     (4U)
#define RF_TRX_EN_BLE_4S_LEN     (1U)
#define RF_TRX_EN_BLE_4S_MSK     (((1U << RF_TRX_EN_BLE_4S_LEN) - 1) << RF_TRX_EN_BLE_4S_POS)
#define RF_TRX_EN_BLE_4S_UMSK    (~(((1U << RF_TRX_EN_BLE_4S_LEN) - 1) << RF_TRX_EN_BLE_4S_POS))
#define RF_TRX_SW_BLE_4S         RF_TRX_SW_BLE_4S
#define RF_TRX_SW_BLE_4S_POS     (5U)
#define RF_TRX_SW_BLE_4S_LEN     (1U)
#define RF_TRX_SW_BLE_4S_MSK     (((1U << RF_TRX_SW_BLE_4S_LEN) - 1) << RF_TRX_SW_BLE_4S_POS)
#define RF_TRX_SW_BLE_4S_UMSK    (~(((1U << RF_TRX_SW_BLE_4S_LEN) - 1) << RF_TRX_SW_BLE_4S_POS))
#define RF_TRX_BLE_4S_EN         RF_TRX_BLE_4S_EN
#define RF_TRX_BLE_4S_EN_POS     (6U)
#define RF_TRX_BLE_4S_EN_LEN     (1U)
#define RF_TRX_BLE_4S_EN_MSK     (((1U << RF_TRX_BLE_4S_EN_LEN) - 1) << RF_TRX_BLE_4S_EN_POS)
#define RF_TRX_BLE_4S_EN_UMSK    (~(((1U << RF_TRX_BLE_4S_EN_LEN) - 1) << RF_TRX_BLE_4S_EN_POS))
#define RF_FSM_DFE_TX_DLY_N      RF_FSM_DFE_TX_DLY_N
#define RF_FSM_DFE_TX_DLY_N_POS  (10U)
#define RF_FSM_DFE_TX_DLY_N_LEN  (10U)
#define RF_FSM_DFE_TX_DLY_N_MSK  (((1U << RF_FSM_DFE_TX_DLY_N_LEN) - 1) << RF_FSM_DFE_TX_DLY_N_POS)
#define RF_FSM_DFE_TX_DLY_N_UMSK (~(((1U << RF_FSM_DFE_TX_DLY_N_LEN) - 1) << RF_FSM_DFE_TX_DLY_N_POS))
#define RF_FSM_DFE_RX_DLY_N      RF_FSM_DFE_RX_DLY_N
#define RF_FSM_DFE_RX_DLY_N_POS  (20U)
#define RF_FSM_DFE_RX_DLY_N_LEN  (10U)
#define RF_FSM_DFE_RX_DLY_N_MSK  (((1U << RF_FSM_DFE_RX_DLY_N_LEN) - 1) << RF_FSM_DFE_RX_DLY_N_POS)
#define RF_FSM_DFE_RX_DLY_N_UMSK (~(((1U << RF_FSM_DFE_RX_DLY_N_LEN) - 1) << RF_FSM_DFE_RX_DLY_N_POS))

/* 0x270 : rf_pkdet_ctrl0 */
#define RF_PKDET_CTRL0_OFFSET     (0x270)
#define RF_PKDET_OUT_CNT_STS      RF_PKDET_OUT_CNT_STS
#define RF_PKDET_OUT_CNT_STS_POS  (0U)
#define RF_PKDET_OUT_CNT_STS_LEN  (4U)
#define RF_PKDET_OUT_CNT_STS_MSK  (((1U << RF_PKDET_OUT_CNT_STS_LEN) - 1) << RF_PKDET_OUT_CNT_STS_POS)
#define RF_PKDET_OUT_CNT_STS_UMSK (~(((1U << RF_PKDET_OUT_CNT_STS_LEN) - 1) << RF_PKDET_OUT_CNT_STS_POS))
#define RF_PKDET_OUT_CNT_EN       RF_PKDET_OUT_CNT_EN
#define RF_PKDET_OUT_CNT_EN_POS   (4U)
#define RF_PKDET_OUT_CNT_EN_LEN   (1U)
#define RF_PKDET_OUT_CNT_EN_MSK   (((1U << RF_PKDET_OUT_CNT_EN_LEN) - 1) << RF_PKDET_OUT_CNT_EN_POS)
#define RF_PKDET_OUT_CNT_EN_UMSK  (~(((1U << RF_PKDET_OUT_CNT_EN_LEN) - 1) << RF_PKDET_OUT_CNT_EN_POS))
#define RF_PKDET_OUT_MODE         RF_PKDET_OUT_MODE
#define RF_PKDET_OUT_MODE_POS     (5U)
#define RF_PKDET_OUT_MODE_LEN     (1U)
#define RF_PKDET_OUT_MODE_MSK     (((1U << RF_PKDET_OUT_MODE_LEN) - 1) << RF_PKDET_OUT_MODE_POS)
#define RF_PKDET_OUT_MODE_UMSK    (~(((1U << RF_PKDET_OUT_MODE_LEN) - 1) << RF_PKDET_OUT_MODE_POS))

/* 0x600 : dfe_ctrl_0 */
#define RF_DFE_CTRL_0_OFFSET         (0x600)
#define RF_TX_IQC_PHASE              RF_TX_IQC_PHASE
#define RF_TX_IQC_PHASE_POS          (0U)
#define RF_TX_IQC_PHASE_LEN          (10U)
#define RF_TX_IQC_PHASE_MSK          (((1U << RF_TX_IQC_PHASE_LEN) - 1) << RF_TX_IQC_PHASE_POS)
#define RF_TX_IQC_PHASE_UMSK         (~(((1U << RF_TX_IQC_PHASE_LEN) - 1) << RF_TX_IQC_PHASE_POS))
#define RF_TX_IQC_PHASE_EN           RF_TX_IQC_PHASE_EN
#define RF_TX_IQC_PHASE_EN_POS       (10U)
#define RF_TX_IQC_PHASE_EN_LEN       (1U)
#define RF_TX_IQC_PHASE_EN_MSK       (((1U << RF_TX_IQC_PHASE_EN_LEN) - 1) << RF_TX_IQC_PHASE_EN_POS)
#define RF_TX_IQC_PHASE_EN_UMSK      (~(((1U << RF_TX_IQC_PHASE_EN_LEN) - 1) << RF_TX_IQC_PHASE_EN_POS))
#define RF_TX_IQC_GAIN               RF_TX_IQC_GAIN
#define RF_TX_IQC_GAIN_POS           (12U)
#define RF_TX_IQC_GAIN_LEN           (11U)
#define RF_TX_IQC_GAIN_MSK           (((1U << RF_TX_IQC_GAIN_LEN) - 1) << RF_TX_IQC_GAIN_POS)
#define RF_TX_IQC_GAIN_UMSK          (~(((1U << RF_TX_IQC_GAIN_LEN) - 1) << RF_TX_IQC_GAIN_POS))
#define RF_TX_IQC_GAIN_EN            RF_TX_IQC_GAIN_EN
#define RF_TX_IQC_GAIN_EN_POS        (23U)
#define RF_TX_IQC_GAIN_EN_LEN        (1U)
#define RF_TX_IQC_GAIN_EN_MSK        (((1U << RF_TX_IQC_GAIN_EN_LEN) - 1) << RF_TX_IQC_GAIN_EN_POS)
#define RF_TX_IQC_GAIN_EN_UMSK       (~(((1U << RF_TX_IQC_GAIN_EN_LEN) - 1) << RF_TX_IQC_GAIN_EN_POS))
#define RF_TX_DVGA_GAIN_QDB          RF_TX_DVGA_GAIN_QDB
#define RF_TX_DVGA_GAIN_QDB_POS      (24U)
#define RF_TX_DVGA_GAIN_QDB_LEN      (7U)
#define RF_TX_DVGA_GAIN_QDB_MSK      (((1U << RF_TX_DVGA_GAIN_QDB_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_POS)
#define RF_TX_DVGA_GAIN_QDB_UMSK     (~(((1U << RF_TX_DVGA_GAIN_QDB_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_POS))
#define RF_TX_DVGA_GAIN_CTRL_HW      RF_TX_DVGA_GAIN_CTRL_HW
#define RF_TX_DVGA_GAIN_CTRL_HW_POS  (31U)
#define RF_TX_DVGA_GAIN_CTRL_HW_LEN  (1U)
#define RF_TX_DVGA_GAIN_CTRL_HW_MSK  (((1U << RF_TX_DVGA_GAIN_CTRL_HW_LEN) - 1) << RF_TX_DVGA_GAIN_CTRL_HW_POS)
#define RF_TX_DVGA_GAIN_CTRL_HW_UMSK (~(((1U << RF_TX_DVGA_GAIN_CTRL_HW_LEN) - 1) << RF_TX_DVGA_GAIN_CTRL_HW_POS))

/* 0x604 : dfe_ctrl_1 */
#define RF_DFE_CTRL_1_OFFSET      (0x604)
#define RF_TX_DAC_OS_I            RF_TX_DAC_OS_I
#define RF_TX_DAC_OS_I_POS        (0U)
#define RF_TX_DAC_OS_I_LEN        (12U)
#define RF_TX_DAC_OS_I_MSK        (((1U << RF_TX_DAC_OS_I_LEN) - 1) << RF_TX_DAC_OS_I_POS)
#define RF_TX_DAC_OS_I_UMSK       (~(((1U << RF_TX_DAC_OS_I_LEN) - 1) << RF_TX_DAC_OS_I_POS))
#define RF_TX_DAC_OS_Q            RF_TX_DAC_OS_Q
#define RF_TX_DAC_OS_Q_POS        (16U)
#define RF_TX_DAC_OS_Q_LEN        (12U)
#define RF_TX_DAC_OS_Q_MSK        (((1U << RF_TX_DAC_OS_Q_LEN) - 1) << RF_TX_DAC_OS_Q_POS)
#define RF_TX_DAC_OS_Q_UMSK       (~(((1U << RF_TX_DAC_OS_Q_LEN) - 1) << RF_TX_DAC_OS_Q_POS))
#define RF_TX_DAC_DAT_FORMAT      RF_TX_DAC_DAT_FORMAT
#define RF_TX_DAC_DAT_FORMAT_POS  (30U)
#define RF_TX_DAC_DAT_FORMAT_LEN  (1U)
#define RF_TX_DAC_DAT_FORMAT_MSK  (((1U << RF_TX_DAC_DAT_FORMAT_LEN) - 1) << RF_TX_DAC_DAT_FORMAT_POS)
#define RF_TX_DAC_DAT_FORMAT_UMSK (~(((1U << RF_TX_DAC_DAT_FORMAT_LEN) - 1) << RF_TX_DAC_DAT_FORMAT_POS))
#define RF_TX_DAC_IQ_SWAP         RF_TX_DAC_IQ_SWAP
#define RF_TX_DAC_IQ_SWAP_POS     (31U)
#define RF_TX_DAC_IQ_SWAP_LEN     (1U)
#define RF_TX_DAC_IQ_SWAP_MSK     (((1U << RF_TX_DAC_IQ_SWAP_LEN) - 1) << RF_TX_DAC_IQ_SWAP_POS)
#define RF_TX_DAC_IQ_SWAP_UMSK    (~(((1U << RF_TX_DAC_IQ_SWAP_LEN) - 1) << RF_TX_DAC_IQ_SWAP_POS))

/* 0x608 : dfe_ctrl_2 */
#define RF_DFE_CTRL_2_OFFSET      (0x608)
#define RF_RX_ADC_OS_I            RF_RX_ADC_OS_I
#define RF_RX_ADC_OS_I_POS        (0U)
#define RF_RX_ADC_OS_I_LEN        (10U)
#define RF_RX_ADC_OS_I_MSK        (((1U << RF_RX_ADC_OS_I_LEN) - 1) << RF_RX_ADC_OS_I_POS)
#define RF_RX_ADC_OS_I_UMSK       (~(((1U << RF_RX_ADC_OS_I_LEN) - 1) << RF_RX_ADC_OS_I_POS))
#define RF_RX_ADC_OS_Q            RF_RX_ADC_OS_Q
#define RF_RX_ADC_OS_Q_POS        (16U)
#define RF_RX_ADC_OS_Q_LEN        (10U)
#define RF_RX_ADC_OS_Q_MSK        (((1U << RF_RX_ADC_OS_Q_LEN) - 1) << RF_RX_ADC_OS_Q_POS)
#define RF_RX_ADC_OS_Q_UMSK       (~(((1U << RF_RX_ADC_OS_Q_LEN) - 1) << RF_RX_ADC_OS_Q_POS))
#define RF_RX_ADC_DCE_FLT_EN      RF_RX_ADC_DCE_FLT_EN
#define RF_RX_ADC_DCE_FLT_EN_POS  (28U)
#define RF_RX_ADC_DCE_FLT_EN_LEN  (1U)
#define RF_RX_ADC_DCE_FLT_EN_MSK  (((1U << RF_RX_ADC_DCE_FLT_EN_LEN) - 1) << RF_RX_ADC_DCE_FLT_EN_POS)
#define RF_RX_ADC_DCE_FLT_EN_UMSK (~(((1U << RF_RX_ADC_DCE_FLT_EN_LEN) - 1) << RF_RX_ADC_DCE_FLT_EN_POS))
#define RF_RX_ADC_LOW_POW_EN      RF_RX_ADC_LOW_POW_EN
#define RF_RX_ADC_LOW_POW_EN_POS  (29U)
#define RF_RX_ADC_LOW_POW_EN_LEN  (1U)
#define RF_RX_ADC_LOW_POW_EN_MSK  (((1U << RF_RX_ADC_LOW_POW_EN_LEN) - 1) << RF_RX_ADC_LOW_POW_EN_POS)
#define RF_RX_ADC_LOW_POW_EN_UMSK (~(((1U << RF_RX_ADC_LOW_POW_EN_LEN) - 1) << RF_RX_ADC_LOW_POW_EN_POS))
#define RF_RX_ADC_DAT_FORMAT      RF_RX_ADC_DAT_FORMAT
#define RF_RX_ADC_DAT_FORMAT_POS  (30U)
#define RF_RX_ADC_DAT_FORMAT_LEN  (1U)
#define RF_RX_ADC_DAT_FORMAT_MSK  (((1U << RF_RX_ADC_DAT_FORMAT_LEN) - 1) << RF_RX_ADC_DAT_FORMAT_POS)
#define RF_RX_ADC_DAT_FORMAT_UMSK (~(((1U << RF_RX_ADC_DAT_FORMAT_LEN) - 1) << RF_RX_ADC_DAT_FORMAT_POS))
#define RF_RX_ADC_IQ_SWAP         RF_RX_ADC_IQ_SWAP
#define RF_RX_ADC_IQ_SWAP_POS     (31U)
#define RF_RX_ADC_IQ_SWAP_LEN     (1U)
#define RF_RX_ADC_IQ_SWAP_MSK     (((1U << RF_RX_ADC_IQ_SWAP_LEN) - 1) << RF_RX_ADC_IQ_SWAP_POS)
#define RF_RX_ADC_IQ_SWAP_UMSK    (~(((1U << RF_RX_ADC_IQ_SWAP_LEN) - 1) << RF_RX_ADC_IQ_SWAP_POS))

/* 0x60C : dfe_ctrl_3 */
#define RF_DFE_CTRL_3_OFFSET    (0x60C)
#define RF_RX_ADC_4S_I_VAL      RF_RX_ADC_4S_I_VAL
#define RF_RX_ADC_4S_I_VAL_POS  (0U)
#define RF_RX_ADC_4S_I_VAL_LEN  (10U)
#define RF_RX_ADC_4S_I_VAL_MSK  (((1U << RF_RX_ADC_4S_I_VAL_LEN) - 1) << RF_RX_ADC_4S_I_VAL_POS)
#define RF_RX_ADC_4S_I_VAL_UMSK (~(((1U << RF_RX_ADC_4S_I_VAL_LEN) - 1) << RF_RX_ADC_4S_I_VAL_POS))
#define RF_RX_ADC_4S_I_EN       RF_RX_ADC_4S_I_EN
#define RF_RX_ADC_4S_I_EN_POS   (10U)
#define RF_RX_ADC_4S_I_EN_LEN   (1U)
#define RF_RX_ADC_4S_I_EN_MSK   (((1U << RF_RX_ADC_4S_I_EN_LEN) - 1) << RF_RX_ADC_4S_I_EN_POS)
#define RF_RX_ADC_4S_I_EN_UMSK  (~(((1U << RF_RX_ADC_4S_I_EN_LEN) - 1) << RF_RX_ADC_4S_I_EN_POS))
#define RF_RX_ADC_4S_Q_VAL      RF_RX_ADC_4S_Q_VAL
#define RF_RX_ADC_4S_Q_VAL_POS  (16U)
#define RF_RX_ADC_4S_Q_VAL_LEN  (10U)
#define RF_RX_ADC_4S_Q_VAL_MSK  (((1U << RF_RX_ADC_4S_Q_VAL_LEN) - 1) << RF_RX_ADC_4S_Q_VAL_POS)
#define RF_RX_ADC_4S_Q_VAL_UMSK (~(((1U << RF_RX_ADC_4S_Q_VAL_LEN) - 1) << RF_RX_ADC_4S_Q_VAL_POS))
#define RF_RX_ADC_4S_Q_EN       RF_RX_ADC_4S_Q_EN
#define RF_RX_ADC_4S_Q_EN_POS   (26U)
#define RF_RX_ADC_4S_Q_EN_LEN   (1U)
#define RF_RX_ADC_4S_Q_EN_MSK   (((1U << RF_RX_ADC_4S_Q_EN_LEN) - 1) << RF_RX_ADC_4S_Q_EN_POS)
#define RF_RX_ADC_4S_Q_EN_UMSK  (~(((1U << RF_RX_ADC_4S_Q_EN_LEN) - 1) << RF_RX_ADC_4S_Q_EN_POS))

/* 0x610 : dfe_ctrl_4 */
#define RF_DFE_CTRL_4_OFFSET (0x610)
#define RF_RX_PF_TH2         RF_RX_PF_TH2
#define RF_RX_PF_TH2_POS     (0U)
#define RF_RX_PF_TH2_LEN     (10U)
#define RF_RX_PF_TH2_MSK     (((1U << RF_RX_PF_TH2_LEN) - 1) << RF_RX_PF_TH2_POS)
#define RF_RX_PF_TH2_UMSK    (~(((1U << RF_RX_PF_TH2_LEN) - 1) << RF_RX_PF_TH2_POS))
#define RF_RX_PF_TH1         RF_RX_PF_TH1
#define RF_RX_PF_TH1_POS     (16U)
#define RF_RX_PF_TH1_LEN     (10U)
#define RF_RX_PF_TH1_MSK     (((1U << RF_RX_PF_TH1_LEN) - 1) << RF_RX_PF_TH1_POS)
#define RF_RX_PF_TH1_UMSK    (~(((1U << RF_RX_PF_TH1_LEN) - 1) << RF_RX_PF_TH1_POS))
#define RF_RX_PF_Q_EN        RF_RX_PF_Q_EN
#define RF_RX_PF_Q_EN_POS    (30U)
#define RF_RX_PF_Q_EN_LEN    (1U)
#define RF_RX_PF_Q_EN_MSK    (((1U << RF_RX_PF_Q_EN_LEN) - 1) << RF_RX_PF_Q_EN_POS)
#define RF_RX_PF_Q_EN_UMSK   (~(((1U << RF_RX_PF_Q_EN_LEN) - 1) << RF_RX_PF_Q_EN_POS))
#define RF_RX_PF_I_EN        RF_RX_PF_I_EN
#define RF_RX_PF_I_EN_POS    (31U)
#define RF_RX_PF_I_EN_LEN    (1U)
#define RF_RX_PF_I_EN_MSK    (((1U << RF_RX_PF_I_EN_LEN) - 1) << RF_RX_PF_I_EN_POS)
#define RF_RX_PF_I_EN_UMSK   (~(((1U << RF_RX_PF_I_EN_LEN) - 1) << RF_RX_PF_I_EN_POS))

