bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x614 : dfe_ctrl_5 */
#define RF_DFE_CTRL_5_OFFSET    (0x614)
#define RF_RX_IQC_PHASE         RF_RX_IQC_PHASE
#define RF_RX_IQC_PHASE_POS     (0U)
#define RF_RX_IQC_PHASE_LEN     (10U)
#define RF_RX_IQC_PHASE_MSK     (((1U << RF_RX_IQC_PHASE_LEN) - 1) << RF_RX_IQC_PHASE_POS)
#define RF_RX_IQC_PHASE_UMSK    (~(((1U << RF_RX_IQC_PHASE_LEN) - 1) << RF_RX_IQC_PHASE_POS))
#define RF_RX_IQC_PHASE_EN      RF_RX_IQC_PHASE_EN
#define RF_RX_IQC_PHASE_EN_POS  (10U)
#define RF_RX_IQC_PHASE_EN_LEN  (1U)
#define RF_RX_IQC_PHASE_EN_MSK  (((1U << RF_RX_IQC_PHASE_EN_LEN) - 1) << RF_RX_IQC_PHASE_EN_POS)
#define RF_RX_IQC_PHASE_EN_UMSK (~(((1U << RF_RX_IQC_PHASE_EN_LEN) - 1) << RF_RX_IQC_PHASE_EN_POS))
#define RF_RX_IQC_GAIN          RF_RX_IQC_GAIN
#define RF_RX_IQC_GAIN_POS      (12U)
#define RF_RX_IQC_GAIN_LEN      (11U)
#define RF_RX_IQC_GAIN_MSK      (((1U << RF_RX_IQC_GAIN_LEN) - 1) << RF_RX_IQC_GAIN_POS)
#define RF_RX_IQC_GAIN_UMSK     (~(((1U << RF_RX_IQC_GAIN_LEN) - 1) << RF_RX_IQC_GAIN_POS))
#define RF_RX_IQC_GAIN_EN       RF_RX_IQC_GAIN_EN
#define RF_RX_IQC_GAIN_EN_POS   (23U)
#define RF_RX_IQC_GAIN_EN_LEN   (1U)
#define RF_RX_IQC_GAIN_EN_MSK   (((1U << RF_RX_IQC_GAIN_EN_LEN) - 1) << RF_RX_IQC_GAIN_EN_POS)
#define RF_RX_IQC_GAIN_EN_UMSK  (~(((1U << RF_RX_IQC_GAIN_EN_LEN) - 1) << RF_RX_IQC_GAIN_EN_POS))

/* 0x618 : dfe_ctrl_6 */
#define RF_DFE_CTRL_6_OFFSET       (0x618)
#define RF_RX_PM_FREQSHIFT_CW      RF_RX_PM_FREQSHIFT_CW
#define RF_RX_PM_FREQSHIFT_CW_POS  (0U)
#define RF_RX_PM_FREQSHIFT_CW_LEN  (20U)
#define RF_RX_PM_FREQSHIFT_CW_MSK  (((1U << RF_RX_PM_FREQSHIFT_CW_LEN) - 1) << RF_RX_PM_FREQSHIFT_CW_POS)
#define RF_RX_PM_FREQSHIFT_CW_UMSK (~(((1U << RF_RX_PM_FREQSHIFT_CW_LEN) - 1) << RF_RX_PM_FREQSHIFT_CW_POS))
#define RF_RX_PM_FREQSHIFT_EN      RF_RX_PM_FREQSHIFT_EN
#define RF_RX_PM_FREQSHIFT_EN_POS  (20U)
#define RF_RX_PM_FREQSHIFT_EN_LEN  (1U)
#define RF_RX_PM_FREQSHIFT_EN_MSK  (((1U << RF_RX_PM_FREQSHIFT_EN_LEN) - 1) << RF_RX_PM_FREQSHIFT_EN_POS)
#define RF_RX_PM_FREQSHIFT_EN_UMSK (~(((1U << RF_RX_PM_FREQSHIFT_EN_LEN) - 1) << RF_RX_PM_FREQSHIFT_EN_POS))
#define RF_RX_PM_DONE              RF_RX_PM_DONE
#define RF_RX_PM_DONE_POS          (28U)
#define RF_RX_PM_DONE_LEN          (1U)
#define RF_RX_PM_DONE_MSK          (((1U << RF_RX_PM_DONE_LEN) - 1) << RF_RX_PM_DONE_POS)
#define RF_RX_PM_DONE_UMSK         (~(((1U << RF_RX_PM_DONE_LEN) - 1) << RF_RX_PM_DONE_POS))
#define RF_RX_PM_EN                RF_RX_PM_EN
#define RF_RX_PM_EN_POS            (29U)
#define RF_RX_PM_EN_LEN            (1U)
#define RF_RX_PM_EN_MSK            (((1U << RF_RX_PM_EN_LEN) - 1) << RF_RX_PM_EN_POS)
#define RF_RX_PM_EN_UMSK           (~(((1U << RF_RX_PM_EN_LEN) - 1) << RF_RX_PM_EN_POS))
#define RF_RX_PM_IN_SEL            RF_RX_PM_IN_SEL
#define RF_RX_PM_IN_SEL_POS        (30U)
#define RF_RX_PM_IN_SEL_LEN        (2U)
#define RF_RX_PM_IN_SEL_MSK        (((1U << RF_RX_PM_IN_SEL_LEN) - 1) << RF_RX_PM_IN_SEL_POS)
#define RF_RX_PM_IN_SEL_UMSK       (~(((1U << RF_RX_PM_IN_SEL_LEN) - 1) << RF_RX_PM_IN_SEL_POS))

/* 0x61C : dfe_ctrl_7 */
#define RF_DFE_CTRL_7_OFFSET    (0x61C)
#define RF_RX_PM_START_OFS      RF_RX_PM_START_OFS
#define RF_RX_PM_START_OFS_POS  (0U)
#define RF_RX_PM_START_OFS_LEN  (16U)
#define RF_RX_PM_START_OFS_MSK  (((1U << RF_RX_PM_START_OFS_LEN) - 1) << RF_RX_PM_START_OFS_POS)
#define RF_RX_PM_START_OFS_UMSK (~(((1U << RF_RX_PM_START_OFS_LEN) - 1) << RF_RX_PM_START_OFS_POS))
#define RF_RX_PM_ACC_LEN        RF_RX_PM_ACC_LEN
#define RF_RX_PM_ACC_LEN_POS    (16U)
#define RF_RX_PM_ACC_LEN_LEN    (16U)
#define RF_RX_PM_ACC_LEN_MSK    (((1U << RF_RX_PM_ACC_LEN_LEN) - 1) << RF_RX_PM_ACC_LEN_POS)
#define RF_RX_PM_ACC_LEN_UMSK   (~(((1U << RF_RX_PM_ACC_LEN_LEN) - 1) << RF_RX_PM_ACC_LEN_POS))

/* 0x620 : dfe_ctrl_8 */
#define RF_DFE_CTRL_8_OFFSET  (0x620)
#define RF_RX_PM_IQACC_I      RF_RX_PM_IQACC_I
#define RF_RX_PM_IQACC_I_POS  (0U)
#define RF_RX_PM_IQACC_I_LEN  (25U)
#define RF_RX_PM_IQACC_I_MSK  (((1U << RF_RX_PM_IQACC_I_LEN) - 1) << RF_RX_PM_IQACC_I_POS)
#define RF_RX_PM_IQACC_I_UMSK (~(((1U << RF_RX_PM_IQACC_I_LEN) - 1) << RF_RX_PM_IQACC_I_POS))

/* 0x624 : dfe_ctrl_9 */
#define RF_DFE_CTRL_9_OFFSET  (0x624)
#define RF_RX_PM_IQACC_Q      RF_RX_PM_IQACC_Q
#define RF_RX_PM_IQACC_Q_POS  (0U)
#define RF_RX_PM_IQACC_Q_LEN  (25U)
#define RF_RX_PM_IQACC_Q_MSK  (((1U << RF_RX_PM_IQACC_Q_LEN) - 1) << RF_RX_PM_IQACC_Q_POS)
#define RF_RX_PM_IQACC_Q_UMSK (~(((1U << RF_RX_PM_IQACC_Q_LEN) - 1) << RF_RX_PM_IQACC_Q_POS))

/* 0x628 : dfe_ctrl_10 */
#define RF_DFE_CTRL_10_OFFSET (0x628)
#define RF_DFE_DAC_RAW_I      RF_DFE_DAC_RAW_I
#define RF_DFE_DAC_RAW_I_POS  (0U)
#define RF_DFE_DAC_RAW_I_LEN  (11U)
#define RF_DFE_DAC_RAW_I_MSK  (((1U << RF_DFE_DAC_RAW_I_LEN) - 1) << RF_DFE_DAC_RAW_I_POS)
#define RF_DFE_DAC_RAW_I_UMSK (~(((1U << RF_DFE_DAC_RAW_I_LEN) - 1) << RF_DFE_DAC_RAW_I_POS))
#define RF_DFE_DAC_RAW_Q      RF_DFE_DAC_RAW_Q
#define RF_DFE_DAC_RAW_Q_POS  (16U)
#define RF_DFE_DAC_RAW_Q_LEN  (11U)
#define RF_DFE_DAC_RAW_Q_MSK  (((1U << RF_DFE_DAC_RAW_Q_LEN) - 1) << RF_DFE_DAC_RAW_Q_POS)
#define RF_DFE_DAC_RAW_Q_UMSK (~(((1U << RF_DFE_DAC_RAW_Q_LEN) - 1) << RF_DFE_DAC_RAW_Q_POS))

/* 0x62C : dfe_ctrl_11 */
#define RF_DFE_CTRL_11_OFFSET (0x62C)
#define RF_DFE_ADC_RAW_I      RF_DFE_ADC_RAW_I
#define RF_DFE_ADC_RAW_I_POS  (0U)
#define RF_DFE_ADC_RAW_I_LEN  (10U)
#define RF_DFE_ADC_RAW_I_MSK  (((1U << RF_DFE_ADC_RAW_I_LEN) - 1) << RF_DFE_ADC_RAW_I_POS)
#define RF_DFE_ADC_RAW_I_UMSK (~(((1U << RF_DFE_ADC_RAW_I_LEN) - 1) << RF_DFE_ADC_RAW_I_POS))
#define RF_DFE_ADC_RAW_Q      RF_DFE_ADC_RAW_Q
#define RF_DFE_ADC_RAW_Q_POS  (16U)
#define RF_DFE_ADC_RAW_Q_LEN  (10U)
#define RF_DFE_ADC_RAW_Q_MSK  (((1U << RF_DFE_ADC_RAW_Q_LEN) - 1) << RF_DFE_ADC_RAW_Q_POS)
#define RF_DFE_ADC_RAW_Q_UMSK (~(((1U << RF_DFE_ADC_RAW_Q_LEN) - 1) << RF_DFE_ADC_RAW_Q_POS))

/* 0x630 : dfe_ctrl_12 */
#define RF_DFE_CTRL_12_OFFSET        (0x630)
#define RF_TX_DVGA_GAIN_QDB_GC0      RF_TX_DVGA_GAIN_QDB_GC0
#define RF_TX_DVGA_GAIN_QDB_GC0_POS  (0U)
#define RF_TX_DVGA_GAIN_QDB_GC0_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC0_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC0_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC0_POS)
#define RF_TX_DVGA_GAIN_QDB_GC0_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC0_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC0_POS))
#define RF_TX_DVGA_GAIN_QDB_GC1      RF_TX_DVGA_GAIN_QDB_GC1
#define RF_TX_DVGA_GAIN_QDB_GC1_POS  (8U)
#define RF_TX_DVGA_GAIN_QDB_GC1_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC1_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC1_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC1_POS)
#define RF_TX_DVGA_GAIN_QDB_GC1_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC1_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC1_POS))
#define RF_TX_DVGA_GAIN_QDB_GC2      RF_TX_DVGA_GAIN_QDB_GC2
#define RF_TX_DVGA_GAIN_QDB_GC2_POS  (16U)
#define RF_TX_DVGA_GAIN_QDB_GC2_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC2_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC2_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC2_POS)
#define RF_TX_DVGA_GAIN_QDB_GC2_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC2_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC2_POS))
#define RF_TX_DVGA_GAIN_QDB_GC3      RF_TX_DVGA_GAIN_QDB_GC3
#define RF_TX_DVGA_GAIN_QDB_GC3_POS  (24U)
#define RF_TX_DVGA_GAIN_QDB_GC3_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC3_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC3_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC3_POS)
#define RF_TX_DVGA_GAIN_QDB_GC3_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC3_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC3_POS))

