bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x634 : dfe_ctrl_13 */
#define RF_DFE_CTRL_13_OFFSET        (0x634)
#define RF_TX_DVGA_GAIN_QDB_GC4      RF_TX_DVGA_GAIN_QDB_GC4
#define RF_TX_DVGA_GAIN_QDB_GC4_POS  (0U)
#define RF_TX_DVGA_GAIN_QDB_GC4_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC4_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC4_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC4_POS)
#define RF_TX_DVGA_GAIN_QDB_GC4_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC4_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC4_POS))
#define RF_TX_DVGA_GAIN_QDB_GC5      RF_TX_DVGA_GAIN_QDB_GC5
#define RF_TX_DVGA_GAIN_QDB_GC5_POS  (8U)
#define RF_TX_DVGA_GAIN_QDB_GC5_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC5_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC5_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC5_POS)
#define RF_TX_DVGA_GAIN_QDB_GC5_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC5_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC5_POS))
#define RF_TX_DVGA_GAIN_QDB_GC6      RF_TX_DVGA_GAIN_QDB_GC6
#define RF_TX_DVGA_GAIN_QDB_GC6_POS  (16U)
#define RF_TX_DVGA_GAIN_QDB_GC6_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC6_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC6_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC6_POS)
#define RF_TX_DVGA_GAIN_QDB_GC6_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC6_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC6_POS))
#define RF_TX_DVGA_GAIN_QDB_GC7      RF_TX_DVGA_GAIN_QDB_GC7
#define RF_TX_DVGA_GAIN_QDB_GC7_POS  (24U)
#define RF_TX_DVGA_GAIN_QDB_GC7_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC7_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC7_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC7_POS)
#define RF_TX_DVGA_GAIN_QDB_GC7_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC7_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC7_POS))

/* 0x638 : dfe_ctrl_14 */
#define RF_DFE_CTRL_14_OFFSET         (0x638)
#define RF_TX_DVGA_GAIN_QDB_GC8       RF_TX_DVGA_GAIN_QDB_GC8
#define RF_TX_DVGA_GAIN_QDB_GC8_POS   (0U)
#define RF_TX_DVGA_GAIN_QDB_GC8_LEN   (7U)
#define RF_TX_DVGA_GAIN_QDB_GC8_MSK   (((1U << RF_TX_DVGA_GAIN_QDB_GC8_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC8_POS)
#define RF_TX_DVGA_GAIN_QDB_GC8_UMSK  (~(((1U << RF_TX_DVGA_GAIN_QDB_GC8_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC8_POS))
#define RF_TX_DVGA_GAIN_QDB_GC9       RF_TX_DVGA_GAIN_QDB_GC9
#define RF_TX_DVGA_GAIN_QDB_GC9_POS   (8U)
#define RF_TX_DVGA_GAIN_QDB_GC9_LEN   (7U)
#define RF_TX_DVGA_GAIN_QDB_GC9_MSK   (((1U << RF_TX_DVGA_GAIN_QDB_GC9_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC9_POS)
#define RF_TX_DVGA_GAIN_QDB_GC9_UMSK  (~(((1U << RF_TX_DVGA_GAIN_QDB_GC9_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC9_POS))
#define RF_TX_DVGA_GAIN_QDB_GC10      RF_TX_DVGA_GAIN_QDB_GC10
#define RF_TX_DVGA_GAIN_QDB_GC10_POS  (16U)
#define RF_TX_DVGA_GAIN_QDB_GC10_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC10_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC10_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC10_POS)
#define RF_TX_DVGA_GAIN_QDB_GC10_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC10_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC10_POS))
#define RF_TX_DVGA_GAIN_QDB_GC11      RF_TX_DVGA_GAIN_QDB_GC11
#define RF_TX_DVGA_GAIN_QDB_GC11_POS  (24U)
#define RF_TX_DVGA_GAIN_QDB_GC11_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC11_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC11_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC11_POS)
#define RF_TX_DVGA_GAIN_QDB_GC11_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC11_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC11_POS))

/* 0x63C : dfe_ctrl_15 */
#define RF_DFE_CTRL_15_OFFSET         (0x63C)
#define RF_TX_DVGA_GAIN_QDB_GC12      RF_TX_DVGA_GAIN_QDB_GC12
#define RF_TX_DVGA_GAIN_QDB_GC12_POS  (0U)
#define RF_TX_DVGA_GAIN_QDB_GC12_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC12_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC12_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC12_POS)
#define RF_TX_DVGA_GAIN_QDB_GC12_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC12_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC12_POS))
#define RF_TX_DVGA_GAIN_QDB_GC13      RF_TX_DVGA_GAIN_QDB_GC13
#define RF_TX_DVGA_GAIN_QDB_GC13_POS  (8U)
#define RF_TX_DVGA_GAIN_QDB_GC13_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC13_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC13_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC13_POS)
#define RF_TX_DVGA_GAIN_QDB_GC13_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC13_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC13_POS))
#define RF_TX_DVGA_GAIN_QDB_GC14      RF_TX_DVGA_GAIN_QDB_GC14
#define RF_TX_DVGA_GAIN_QDB_GC14_POS  (16U)
#define RF_TX_DVGA_GAIN_QDB_GC14_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC14_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC14_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC14_POS)
#define RF_TX_DVGA_GAIN_QDB_GC14_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC14_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC14_POS))
#define RF_TX_DVGA_GAIN_QDB_GC15      RF_TX_DVGA_GAIN_QDB_GC15
#define RF_TX_DVGA_GAIN_QDB_GC15_POS  (24U)
#define RF_TX_DVGA_GAIN_QDB_GC15_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_GC15_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_GC15_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC15_POS)
#define RF_TX_DVGA_GAIN_QDB_GC15_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_GC15_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_GC15_POS))

/* 0x640 : dfe_ctrl_16 */
#define RF_DFE_CTRL_16_OFFSET (0x640)
#define RF_TBB_IND_GC0        RF_TBB_IND_GC0
#define RF_TBB_IND_GC0_POS    (0U)
#define RF_TBB_IND_GC0_LEN    (3U)
#define RF_TBB_IND_GC0_MSK    (((1U << RF_TBB_IND_GC0_LEN) - 1) << RF_TBB_IND_GC0_POS)
#define RF_TBB_IND_GC0_UMSK   (~(((1U << RF_TBB_IND_GC0_LEN) - 1) << RF_TBB_IND_GC0_POS))
#define RF_TBB_IND_GC1        RF_TBB_IND_GC1
#define RF_TBB_IND_GC1_POS    (4U)
#define RF_TBB_IND_GC1_LEN    (3U)
#define RF_TBB_IND_GC1_MSK    (((1U << RF_TBB_IND_GC1_LEN) - 1) << RF_TBB_IND_GC1_POS)
#define RF_TBB_IND_GC1_UMSK   (~(((1U << RF_TBB_IND_GC1_LEN) - 1) << RF_TBB_IND_GC1_POS))
#define RF_TBB_IND_GC2        RF_TBB_IND_GC2
#define RF_TBB_IND_GC2_POS    (8U)
#define RF_TBB_IND_GC2_LEN    (3U)
#define RF_TBB_IND_GC2_MSK    (((1U << RF_TBB_IND_GC2_LEN) - 1) << RF_TBB_IND_GC2_POS)
#define RF_TBB_IND_GC2_UMSK   (~(((1U << RF_TBB_IND_GC2_LEN) - 1) << RF_TBB_IND_GC2_POS))
#define RF_TBB_IND_GC3        RF_TBB_IND_GC3
#define RF_TBB_IND_GC3_POS    (12U)
#define RF_TBB_IND_GC3_LEN    (3U)
#define RF_TBB_IND_GC3_MSK    (((1U << RF_TBB_IND_GC3_LEN) - 1) << RF_TBB_IND_GC3_POS)
#define RF_TBB_IND_GC3_UMSK   (~(((1U << RF_TBB_IND_GC3_LEN) - 1) << RF_TBB_IND_GC3_POS))
#define RF_TBB_IND_GC4        RF_TBB_IND_GC4
#define RF_TBB_IND_GC4_POS    (16U)
#define RF_TBB_IND_GC4_LEN    (3U)
#define RF_TBB_IND_GC4_MSK    (((1U << RF_TBB_IND_GC4_LEN) - 1) << RF_TBB_IND_GC4_POS)
#define RF_TBB_IND_GC4_UMSK   (~(((1U << RF_TBB_IND_GC4_LEN) - 1) << RF_TBB_IND_GC4_POS))
#define RF_TBB_IND_GC5        RF_TBB_IND_GC5
#define RF_TBB_IND_GC5_POS    (20U)
#define RF_TBB_IND_GC5_LEN    (3U)
#define RF_TBB_IND_GC5_MSK    (((1U << RF_TBB_IND_GC5_LEN) - 1) << RF_TBB_IND_GC5_POS)
#define RF_TBB_IND_GC5_UMSK   (~(((1U << RF_TBB_IND_GC5_LEN) - 1) << RF_TBB_IND_GC5_POS))
#define RF_TBB_IND_GC6        RF_TBB_IND_GC6
#define RF_TBB_IND_GC6_POS    (24U)
#define RF_TBB_IND_GC6_LEN    (3U)
#define RF_TBB_IND_GC6_MSK    (((1U << RF_TBB_IND_GC6_LEN) - 1) << RF_TBB_IND_GC6_POS)
#define RF_TBB_IND_GC6_UMSK   (~(((1U << RF_TBB_IND_GC6_LEN) - 1) << RF_TBB_IND_GC6_POS))
#define RF_TBB_IND_GC7        RF_TBB_IND_GC7
#define RF_TBB_IND_GC7_POS    (28U)
#define RF_TBB_IND_GC7_LEN    (3U)
#define RF_TBB_IND_GC7_MSK    (((1U << RF_TBB_IND_GC7_LEN) - 1) << RF_TBB_IND_GC7_POS)
#define RF_TBB_IND_GC7_UMSK   (~(((1U << RF_TBB_IND_GC7_LEN) - 1) << RF_TBB_IND_GC7_POS))

