bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
/* 0x644 : dfe_ctrl_17 */
#define RF_DFE_CTRL_17_OFFSET (0x644)
#define RF_TBB_IND_GC8        RF_TBB_IND_GC8
#define RF_TBB_IND_GC8_POS    (0U)
#define RF_TBB_IND_GC8_LEN    (3U)
#define RF_TBB_IND_GC8_MSK    (((1U << RF_TBB_IND_GC8_LEN) - 1) << RF_TBB_IND_GC8_POS)
#define RF_TBB_IND_GC8_UMSK   (~(((1U << RF_TBB_IND_GC8_LEN) - 1) << RF_TBB_IND_GC8_POS))
#define RF_TBB_IND_GC9        RF_TBB_IND_GC9
#define RF_TBB_IND_GC9_POS    (4U)
#define RF_TBB_IND_GC9_LEN    (3U)
#define RF_TBB_IND_GC9_MSK    (((1U << RF_TBB_IND_GC9_LEN) - 1) << RF_TBB_IND_GC9_POS)
#define RF_TBB_IND_GC9_UMSK   (~(((1U << RF_TBB_IND_GC9_LEN) - 1) << RF_TBB_IND_GC9_POS))
#define RF_TBB_IND_GC10       RF_TBB_IND_GC10
#define RF_TBB_IND_GC10_POS   (8U)
#define RF_TBB_IND_GC10_LEN   (3U)
#define RF_TBB_IND_GC10_MSK   (((1U << RF_TBB_IND_GC10_LEN) - 1) << RF_TBB_IND_GC10_POS)
#define RF_TBB_IND_GC10_UMSK  (~(((1U << RF_TBB_IND_GC10_LEN) - 1) << RF_TBB_IND_GC10_POS))
#define RF_TBB_IND_GC11       RF_TBB_IND_GC11
#define RF_TBB_IND_GC11_POS   (12U)
#define RF_TBB_IND_GC11_LEN   (3U)
#define RF_TBB_IND_GC11_MSK   (((1U << RF_TBB_IND_GC11_LEN) - 1) << RF_TBB_IND_GC11_POS)
#define RF_TBB_IND_GC11_UMSK  (~(((1U << RF_TBB_IND_GC11_LEN) - 1) << RF_TBB_IND_GC11_POS))
#define RF_TBB_IND_GC12       RF_TBB_IND_GC12
#define RF_TBB_IND_GC12_POS   (16U)
#define RF_TBB_IND_GC12_LEN   (3U)
#define RF_TBB_IND_GC12_MSK   (((1U << RF_TBB_IND_GC12_LEN) - 1) << RF_TBB_IND_GC12_POS)
#define RF_TBB_IND_GC12_UMSK  (~(((1U << RF_TBB_IND_GC12_LEN) - 1) << RF_TBB_IND_GC12_POS))
#define RF_TBB_IND_GC13       RF_TBB_IND_GC13
#define RF_TBB_IND_GC13_POS   (20U)
#define RF_TBB_IND_GC13_LEN   (3U)
#define RF_TBB_IND_GC13_MSK   (((1U << RF_TBB_IND_GC13_LEN) - 1) << RF_TBB_IND_GC13_POS)
#define RF_TBB_IND_GC13_UMSK  (~(((1U << RF_TBB_IND_GC13_LEN) - 1) << RF_TBB_IND_GC13_POS))
#define RF_TBB_IND_GC14       RF_TBB_IND_GC14
#define RF_TBB_IND_GC14_POS   (24U)
#define RF_TBB_IND_GC14_LEN   (3U)
#define RF_TBB_IND_GC14_MSK   (((1U << RF_TBB_IND_GC14_LEN) - 1) << RF_TBB_IND_GC14_POS)
#define RF_TBB_IND_GC14_UMSK  (~(((1U << RF_TBB_IND_GC14_LEN) - 1) << RF_TBB_IND_GC14_POS))
#define RF_TBB_IND_GC15       RF_TBB_IND_GC15
#define RF_TBB_IND_GC15_POS   (28U)
#define RF_TBB_IND_GC15_LEN   (3U)
#define RF_TBB_IND_GC15_MSK   (((1U << RF_TBB_IND_GC15_LEN) - 1) << RF_TBB_IND_GC15_POS)
#define RF_TBB_IND_GC15_UMSK  (~(((1U << RF_TBB_IND_GC15_LEN) - 1) << RF_TBB_IND_GC15_POS))

/* 0x648 : dfe_ctrl_18 */
#define RF_DFE_CTRL_18_OFFSET            (0x648)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC0      RF_TX_DVGA_GAIN_QDB_BLE_GC0
#define RF_TX_DVGA_GAIN_QDB_BLE_GC0_POS  (0U)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC0_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC0_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_BLE_GC0_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_BLE_GC0_POS)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC0_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_BLE_GC0_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_BLE_GC0_POS))
#define RF_TX_DVGA_GAIN_QDB_BLE_GC1      RF_TX_DVGA_GAIN_QDB_BLE_GC1
#define RF_TX_DVGA_GAIN_QDB_BLE_GC1_POS  (8U)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC1_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC1_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_BLE_GC1_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_BLE_GC1_POS)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC1_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_BLE_GC1_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_BLE_GC1_POS))
#define RF_TX_DVGA_GAIN_QDB_BLE_GC2      RF_TX_DVGA_GAIN_QDB_BLE_GC2
#define RF_TX_DVGA_GAIN_QDB_BLE_GC2_POS  (16U)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC2_LEN  (7U)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC2_MSK  (((1U << RF_TX_DVGA_GAIN_QDB_BLE_GC2_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_BLE_GC2_POS)
#define RF_TX_DVGA_GAIN_QDB_BLE_GC2_UMSK (~(((1U << RF_TX_DVGA_GAIN_QDB_BLE_GC2_LEN) - 1) << RF_TX_DVGA_GAIN_QDB_BLE_GC2_POS))

struct rf_reg {
    /* 0x0 : Silicon revision */
    union {
        struct
        {
            uint32_t rf_id          : 8; /* [ 7: 0],          r,        0x0 */
            uint32_t fw_rev         : 8; /* [15: 8],          r,        0x0 */
            uint32_t hw_rev         : 8; /* [23:16],          r,        0x0 */
            uint32_t reserved_24_31 : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_rev;

    /* 0x4 : Digital Control */
    union {
        struct
        {
            uint32_t reserved_0          : 1; /* [    0],       rsvd,        0x0 */
            uint32_t rf_fsm_ctrl_en      : 1; /* [    1],        r/w,        0x1 */
            uint32_t rf_fsm_t2r_cal_mode : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t rf_fsm_state        : 3; /* [ 6: 4],          r,        0x1 */
            uint32_t reserved_7          : 1; /* [    7],       rsvd,        0x0 */
            uint32_t rf_rc_state_dbg     : 3; /* [10: 8],        r/w,        0x0 */
            uint32_t rf_rc_state_dbg_en  : 1; /* [   11],        r/w,        0x0 */
            uint32_t rf_fsm_st_int_sel   : 3; /* [14:12],        r/w,        0x0 */
            uint32_t reserved_15         : 1; /* [   15],       rsvd,        0x0 */
            uint32_t rf_fsm_st_int       : 1; /* [   16],          r,        0x0 */
            uint32_t reserved_17_19      : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t rf_fsm_st_int_clr   : 1; /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t rf_fsm_st_int_set   : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27      : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t rf_rc_state_value   : 3; /* [30:28],          r,        0x0 */
            uint32_t reserved_31         : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fsm_ctrl_hw;

    /* 0x8 : rfsm status reg */
    union {
        struct
        {
            uint32_t rf_fsm_sw_st     : 5;  /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7     : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t rf_fsm_sw_st_vld : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11    : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t full_cal_en      : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15   : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t inc_cal_timeout  : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19   : 3;  /* [19:17],       rsvd,        0x0 */
            uint32_t lo_unlocked      : 1;  /* [   20],          r,        0x0 */
            uint32_t reserved_21_31   : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fsm_ctrl_sw;

