bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0xC : Control logic switch */
    union {
        struct
        {
            uint32_t pu_ctrl_hw                 : 1;  /* [    0],        r/w,        0x1 */
            uint32_t rx_gain_ctrl_hw            : 1;  /* [    1],        r/w,        0x1 */
            uint32_t tx_gain_ctrl_hw            : 1;  /* [    2],        r/w,        0x1 */
            uint32_t lna_ctrl_hw                : 1;  /* [    3],        r/w,        0x1 */
            uint32_t rbb_bw_ctrl_hw             : 1;  /* [    4],        r/w,        0x1 */
            uint32_t trxcal_ctrl_hw             : 1;  /* [    5],        r/w,        0x1 */
            uint32_t lo_ctrl_hw                 : 1;  /* [    6],        r/w,        0x1 */
            uint32_t inc_acal_ctrl_en_hw        : 1;  /* [    7],        r/w,        0x1 */
            uint32_t inc_fcal_ctrl_en_hw        : 1;  /* [    8],        r/w,        0x1 */
            uint32_t sdm_ctrl_hw                : 1;  /* [    9],        r/w,        0x1 */
            uint32_t rbb_pkdet_en_ctrl_hw       : 1;  /* [   10],        r/w,        0x1 */
            uint32_t rbb_pkdet_out_rstn_ctrl_hw : 1;  /* [   11],        r/w,        0x1 */
            uint32_t adda_ctrl_hw               : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31             : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rfctrl_hw_en;

    /* 0x10 : temp_comp */
    union {
        struct
        {
            uint32_t const_acal     : 8;  /* [ 7: 0],        r/w,       0x1a */
            uint32_t const_fcal     : 8;  /* [15: 8],        r/w,       0x74 */
            uint32_t temp_comp_en   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31 : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } temp_comp;

    /* 0x14 : rfcal_status */
    union {
        struct
        {
            uint32_t rcal_status        : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t adc_oscal_status   : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t fcal_status        : 2; /* [ 5: 4],        r/w,        0x0 */
            uint32_t acal_status        : 2; /* [ 7: 6],        r/w,        0x0 */
            uint32_t inc_fcal_status    : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t inc_acal_status    : 2; /* [11:10],        r/w,        0x0 */
            uint32_t clkpll_cal_status  : 2; /* [13:12],        r/w,        0x0 */
            uint32_t ros_status         : 2; /* [15:14],        r/w,        0x0 */
            uint32_t tos_status         : 2; /* [17:16],        r/w,        0x0 */
            uint32_t rccal_status       : 2; /* [19:18],        r/w,        0x0 */
            uint32_t lo_leakcal_status  : 2; /* [21:20],        r/w,        0x0 */
            uint32_t tiqcal_status_resv : 2; /* [23:22],        r/w,        0x0 */
            uint32_t riqcal_status_resv : 2; /* [25:24],        r/w,        0x0 */
            uint32_t pwdet_cal_status   : 2; /* [27:26],        r/w,        0x0 */
            uint32_t tenscal_status     : 2; /* [29:28],        r/w,        0x0 */
            uint32_t dpd_status         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rfcal_status;

    /* 0x18 : rfcal_status2 */
    union {
        struct
        {
            uint32_t dl_rfcal_table_status : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_31         : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rfcal_status2;

    /* 0x1C : Calibration mode register */
    union {
        struct
        {
            uint32_t rcal_en_resv      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t adc_oscal_en      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t dl_rfcal_table_en : 1;  /* [    2],        r/w,        0x0 */
            uint32_t fcal_en           : 1;  /* [    3],        r/w,        0x0 */
            uint32_t acal_en           : 1;  /* [    4],        r/w,        0x0 */
            uint32_t fcal_inc_en       : 1;  /* [    5],        r/w,        0x1 */
            uint32_t acal_inc_en       : 1;  /* [    6],        r/w,        0x1 */
            uint32_t roscal_inc_en     : 1;  /* [    7],        r/w,        0x1 */
            uint32_t clkpll_cal_en     : 1;  /* [    8],        r/w,        0x0 */
            uint32_t roscal_en         : 1;  /* [    9],        r/w,        0x0 */
            uint32_t toscal_en         : 1;  /* [   10],        r/w,        0x0 */
            uint32_t rccal_en          : 1;  /* [   11],        r/w,        0x0 */
            uint32_t lo_leakcal_en     : 1;  /* [   12],        r/w,        0x0 */
            uint32_t tiqcal_en         : 1;  /* [   13],        r/w,        0x0 */
            uint32_t riqcal_en         : 1;  /* [   14],        r/w,        0x0 */
            uint32_t pwdet_cal_en      : 1;  /* [   15],        r/w,        0x0 */
            uint32_t tsencal_en        : 1;  /* [   16],        r/w,        0x0 */
            uint32_t dpd_en            : 1;  /* [   17],        r/w,        0x0 */
            uint32_t reserved_18_31    : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rfcal_ctrlen;

    /* 0x20 : rf calibration state enabl in full cal list */
    union {
        struct
        {
            uint32_t rcal_sten_resv      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t adc_oscal_sten      : 1;  /* [    1],        r/w,        0x1 */
            uint32_t dl_rfcal_table_sten : 1;  /* [    2],        r/w,        0x1 */
            uint32_t fcal_sten           : 1;  /* [    3],        r/w,        0x1 */
            uint32_t acal_sten           : 1;  /* [    4],        r/w,        0x1 */
            uint32_t inc_fcal_sten       : 1;  /* [    5],        r/w,        0x1 */
            uint32_t inc_acal_sten       : 1;  /* [    6],        r/w,        0x1 */
            uint32_t clkpll_cal_sten     : 1;  /* [    7],        r/w,        0x1 */
            uint32_t roscal_sten         : 1;  /* [    8],        r/w,        0x1 */
            uint32_t toscal_sten_resv    : 1;  /* [    9],        r/w,        0x0 */
            uint32_t rccal_sten          : 1;  /* [   10],        r/w,        0x1 */
            uint32_t lo_leakcal_sten     : 1;  /* [   11],        r/w,        0x1 */
            uint32_t tiqcal_sten         : 1;  /* [   12],        r/w,        0x1 */
            uint32_t riqcal_sten         : 1;  /* [   13],        r/w,        0x0 */
            uint32_t pwdet_cal_sten      : 1;  /* [   14],        r/w,        0x1 */
            uint32_t tsencal_sten        : 1;  /* [   15],        r/w,        0x1 */
            uint32_t dpd_sten            : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_29      : 13; /* [29:17],       rsvd,        0x0 */
            uint32_t rfcal_level         : 2;  /* [31:30],        r/w,        0x2 */
        } BF;
        uint32_t WORD;
    } rfcal_stateen;

    /* 0x24 : SARADC Control Registers */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } saradc_resv;

    /* 0x28 : ZRF Control register 0 */
    union {
        struct
        {
            uint32_t aupll_sdm_rst_dly : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t lo_sdm_rst_dly    : 2;  /* [ 3: 2],        r/w,        0x3 */
            uint32_t reserved_4_7      : 4;  /* [ 7: 4],       rsvd,        0x0 */
            uint32_t ppu_lead          : 2;  /* [ 9: 8],        r/w,        0x1 */
            uint32_t pud_vco_dly       : 2;  /* [11:10],        r/w,        0x1 */
            uint32_t pud_iref_dly      : 2;  /* [13:12],        r/w,        0x1 */
            uint32_t pud_pa_dly        : 2;  /* [15:14],        r/w,        0x1 */
            uint32_t reserved_16_26    : 11; /* [26:16],       rsvd,        0x0 */
            uint32_t mbg_trim          : 2;  /* [28:27],        r/w,        0x2 */
            uint32_t reserved_29_31    : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_base_ctrl1;

    /* 0x2C : ZRF Control register 0 */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_base_ctrl2;

    /* 0x30 : pucr1 */
    union {
        struct
        {
            uint32_t pu_sfreg     : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7 : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t pu_lna       : 1; /* [    8],        r/w,        0x0 */
            uint32_t pu_rmxgm     : 1; /* [    9],        r/w,        0x0 */
            uint32_t pu_rmx       : 1; /* [   10],        r/w,        0x0 */
            uint32_t pu_rbb       : 1; /* [   11],        r/w,        0x0 */
            uint32_t pu_adda_ldo  : 1; /* [   12],        r/w,        0x0 */
            uint32_t adc_clk_en   : 1; /* [   13],        r/w,        0x0 */
            uint32_t pu_adc       : 1; /* [   14],        r/w,        0x0 */
            uint32_t pu_op_atest  : 1; /* [   15],        r/w,        0x0 */
            uint32_t pu_pa        : 1; /* [   16],        r/w,        0x0 */
            uint32_t pu_tmx       : 1; /* [   17],        r/w,        0x0 */
            uint32_t pu_tbb       : 1; /* [   18],        r/w,        0x0 */
            uint32_t pu_dac       : 1; /* [   19],        r/w,        0x0 */
            uint32_t pu_vco       : 1; /* [   20],        r/w,        0x0 */
            uint32_t pu_fbdv      : 1; /* [   21],        r/w,        0x0 */
            uint32_t pu_pfd       : 1; /* [   22],        r/w,        0x0 */
            uint32_t pu_osmx      : 1; /* [   23],        r/w,        0x0 */
            uint32_t pu_rxbuf     : 1; /* [   24],        r/w,        0x0 */
            uint32_t pu_txbuf     : 1; /* [   25],        r/w,        0x0 */
            uint32_t trsw_en      : 1; /* [   26],        r/w,        0x1 */
            uint32_t reserved_27  : 1; /* [   27],       rsvd,        0x0 */
            uint32_t pu_pkdet     : 1; /* [   28],        r/w,        0x0 */
            uint32_t pu_rosdac    : 1; /* [   29],        r/w,        0x0 */
            uint32_t pu_pwrmx     : 1; /* [   30],        r/w,        0x0 */
            uint32_t pu_tosdac    : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr1;

    /* 0x34 : read only from hardware logic */
    union {
        struct
        {
            uint32_t pu_sfreg_hw    : 1; /* [    0],          r,        0x1 */
            uint32_t reserved_1_7   : 7; /* [ 7: 1],       rsvd,        0x0 */
            uint32_t pu_lna_hw      : 1; /* [    8],          r,        0x1 */
            uint32_t pu_rmxgm_hw    : 1; /* [    9],          r,        0x1 */
            uint32_t pu_rmx_hw      : 1; /* [   10],          r,        0x1 */
            uint32_t pu_rbb_hw      : 1; /* [   11],          r,        0x1 */
            uint32_t pu_adda_ldo_hw : 1; /* [   12],          r,        0x1 */
            uint32_t adc_clk_en_hw  : 1; /* [   13],          r,        0x1 */
            uint32_t pu_adc_hw      : 1; /* [   14],          r,        0x1 */
            uint32_t reserved_15    : 1; /* [   15],       rsvd,        0x0 */
            uint32_t pu_pa_hw       : 1; /* [   16],          r,        0x1 */
            uint32_t pu_tmx_hw      : 1; /* [   17],          r,        0x1 */
            uint32_t pu_tbb_hw      : 1; /* [   18],          r,        0x1 */
            uint32_t pu_dac_hw      : 1; /* [   19],          r,        0x1 */
            uint32_t pu_vco_hw      : 1; /* [   20],          r,        0x1 */
            uint32_t pu_fbdv_hw     : 1; /* [   21],          r,        0x1 */
            uint32_t pu_pfd_hw      : 1; /* [   22],          r,        0x1 */
            uint32_t pu_osmx_hw     : 1; /* [   23],          r,        0x1 */
            uint32_t pu_rxbuf_hw    : 1; /* [   24],          r,        0x1 */
            uint32_t pu_txbuf_hw    : 1; /* [   25],          r,        0x1 */
            uint32_t trsw_en_hw     : 1; /* [   26],          r,        0x0 */
            uint32_t reserved_27    : 1; /* [   27],       rsvd,        0x0 */
            uint32_t pu_pkdet_hw    : 1; /* [   28],          r,        0x1 */
            uint32_t pu_rosdac_hw   : 1; /* [   29],          r,        0x1 */
            uint32_t reserved_30    : 1; /* [   30],       rsvd,        0x0 */
            uint32_t pu_tosdac_hw   : 1; /* [   31],          r,        0x1 */
        } BF;
        uint32_t WORD;
    } pucr1_hw;

    /* 0x38 : pucr2 */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr2;

    /* 0x3C : pucr2_hw */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pucr2_hw;

    /* 0x40 : ppu_ctrl_hw */
    union {
        struct
        {
            uint32_t reserved_0_7   : 8; /* [ 7: 0],       rsvd,        0x0 */
            uint32_t ppu_lna_hw     : 1; /* [    8],          r,        0x1 */
            uint32_t ppu_rmxgm_hw   : 1; /* [    9],          r,        0x1 */
            uint32_t reserved_10    : 1; /* [   10],       rsvd,        0x0 */
            uint32_t ppu_rbb_hw     : 1; /* [   11],          r,        0x1 */
            uint32_t reserved_12_19 : 8; /* [19:12],       rsvd,        0x0 */
            uint32_t ppu_vco_hw     : 1; /* [   20],          r,        0x1 */
            uint32_t ppu_fbdv_hw    : 1; /* [   21],          r,        0x1 */
            uint32_t ppu_pfd_hw     : 1; /* [   22],          r,        0x1 */
            uint32_t ppu_osmx_hw    : 1; /* [   23],          r,        0x1 */
            uint32_t ppu_rxbuf_hw   : 1; /* [   24],          r,        0x1 */
            uint32_t ppu_txbuf_hw   : 1; /* [   25],          r,        0x1 */
            uint32_t reserved_26_31 : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ppu_ctrl_hw;

    /* 0x44 : pud_ctrl_hw */
    union {
        struct
        {
            uint32_t reserved_0_19  : 20; /* [19: 0],       rsvd,        0x0 */
            uint32_t pud_vco_hw     : 1;  /* [   20],          r,        0x0 */
            uint32_t reserved_21_31 : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pud_ctrl_hw;

