bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x48 : gain control1 */
    union {
        struct
        {
            uint32_t gc_lna         : 3; /* [ 2: 0],        r/w,        0x7 */
            uint32_t reserved_3     : 1; /* [    3],       rsvd,        0x0 */
            uint32_t gc_rmxgm       : 2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t gc_rbb1        : 2; /* [ 9: 8],        r/w,        0x2 */
            uint32_t reserved_10_11 : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t gc_rbb2        : 3; /* [14:12],        r/w,        0x6 */
            uint32_t reserved_15    : 1; /* [   15],       rsvd,        0x0 */
            uint32_t gc_tmx         : 3; /* [18:16],        r/w,        0x2 */
            uint32_t reserved_19    : 1; /* [   19],       rsvd,        0x0 */
            uint32_t gc_tbb         : 5; /* [24:20],        r/w,        0x8 */
            uint32_t reserved_25_27 : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t gc_tbb_boost   : 2; /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } trx_gain1;

    /* 0x4C : trx gain hardware readback */
    union {
        struct
        {
            uint32_t gc_lna_hw       : 3; /* [ 2: 0],          r,        0x7 */
            uint32_t reserved_3      : 1; /* [    3],       rsvd,        0x0 */
            uint32_t gc_rmxgm_hw     : 2; /* [ 5: 4],          r,        0x1 */
            uint32_t reserved_6_7    : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t gc_rbb1_hw      : 2; /* [ 9: 8],          r,        0x2 */
            uint32_t reserved_10_11  : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t gc_rbb2_hw      : 3; /* [14:12],          r,        0x6 */
            uint32_t reserved_15     : 1; /* [   15],       rsvd,        0x0 */
            uint32_t gc_tmx_hw       : 3; /* [18:16],          r,        0x8 */
            uint32_t reserved_19     : 1; /* [   19],       rsvd,        0x0 */
            uint32_t gc_tbb_hw       : 5; /* [24:20],          r,        0x3 */
            uint32_t reserved_25_27  : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t gc_tbb_boost_hw : 2; /* [29:28],          r,        0x0 */
            uint32_t reserved_30_31  : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } trx_gain_hw;

    /* 0x50 : dc test register */
    union {
        struct
        {
            uint32_t tmux             : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t dc_tp_en         : 1; /* [    3],        r/w,        0x0 */
            uint32_t dc_tp_clkpll_en  : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7     : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t ten_clkpll       : 1; /* [    8],        r/w,        0x0 */
            uint32_t ten_clkpll_sfreg : 1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_11   : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t ten_rrf_0        : 1; /* [   12],        r/w,        0x0 */
            uint32_t ten_rrf_1        : 1; /* [   13],        r/w,        0x0 */
            uint32_t ten_pa           : 1; /* [   14],        r/w,        0x0 */
            uint32_t ten_tmx          : 1; /* [   15],        r/w,        0x0 */
            uint32_t ten_tia          : 1; /* [   16],        r/w,        0x0 */
            uint32_t ten_bq           : 1; /* [   17],        r/w,        0x0 */
            uint32_t ten_atest        : 1; /* [   18],        r/w,        0x0 */
            uint32_t ten_tbb          : 1; /* [   19],        r/w,        0x0 */
            uint32_t ten_adc          : 1; /* [   20],        r/w,        0x0 */
            uint32_t ten_dac_i        : 1; /* [   21],        r/w,        0x0 */
            uint32_t ten_dac_q        : 1; /* [   22],        r/w,        0x0 */
            uint32_t reserved_23      : 1; /* [   23],       rsvd,        0x0 */
            uint32_t ten_vco          : 1; /* [   24],        r/w,        0x0 */
            uint32_t ten_pfdcp        : 1; /* [   25],        r/w,        0x0 */
            uint32_t ten_lf           : 1; /* [   26],        r/w,        0x0 */
            uint32_t ten_lodist       : 1; /* [   27],        r/w,        0x0 */
            uint32_t reserved_28_31   : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ten_dc;

    /* 0x54 : digital test register */
    union {
        struct
        {
            uint32_t dten_clkpll_postdiv_clk : 1;  /* [    0],        r/w,        0x0 */
            uint32_t dten_clkpll_clk96m      : 1;  /* [    1],        r/w,        0x0 */
            uint32_t dten_clkpll_clk32m      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t dten_clkpll_fsdm        : 1;  /* [    3],        r/w,        0x0 */
            uint32_t dten_clkpll_fref        : 1;  /* [    4],        r/w,        0x0 */
            uint32_t dten_clkpll_fin         : 1;  /* [    5],        r/w,        0x0 */
            uint32_t dten_lo_fsdm            : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t dten_lo_fref            : 1;  /* [    8],        r/w,        0x0 */
            uint32_t dtest_pull_down         : 1;  /* [    9],        r/w,        0x1 */
            uint32_t reserved_10_22          : 13; /* [22:10],       rsvd,        0x0 */
            uint32_t rf_dtest_en             : 1;  /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_31          : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ten_dig;

    /* 0x58 : ac test register */
    union {
        struct
        {
            uint32_t atest_op_cc     : 4; /* [ 3: 0],        r/w,        0x0 */
            uint32_t atest_dac_en    : 1; /* [    4],        r/w,        0x0 */
            uint32_t atest_in_trx_sw : 1; /* [    5],        r/w,        0x0 */
            uint32_t atest_in_en     : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7      : 1; /* [    7],       rsvd,        0x0 */
            uint32_t atest_gain_r9   : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t atest_gain_r8   : 2; /* [11:10],        r/w,        0x0 */
            uint32_t atest_gain_r7   : 2; /* [13:12],        r/w,        0x0 */
            uint32_t atest_gain_r6   : 2; /* [15:14],        r/w,        0x0 */
            uint32_t atest_gain_r5   : 3; /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19     : 1; /* [   19],       rsvd,        0x0 */
            uint32_t atest_out_en_q  : 1; /* [   20],        r/w,        0x0 */
            uint32_t atest_out_en_i  : 1; /* [   21],        r/w,        0x0 */
            uint32_t atest_in_en_q   : 1; /* [   22],        r/w,        0x0 */
            uint32_t atest_in_en_i   : 1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_31  : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ten_ac;

    /* 0x5C : pmip_mv2aon */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pmip_mv2aon;

    /* 0x60 : RX normal bias mode registers */
    union {
        struct
        {
            uint32_t vg11_sel      : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t vg13_sel      : 2;  /* [ 3: 2],        r/w,        0x1 */
            uint32_t reserved_4_31 : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } cip;

    /* 0x64 : pa1 */
    union {
        struct
        {
            uint32_t pa_iaq                 : 3; /* [ 2: 0],        r/w,        0x3 */
            uint32_t pa_etb_en              : 1; /* [    3],        r/w,        0x1 */
            uint32_t pa_iet                 : 4; /* [ 7: 4],        r/w,        0x2 */
            uint32_t pa_vbcore              : 4; /* [11: 8],        r/w,        0xa */
            uint32_t pa_vbcas               : 3; /* [14:12],        r/w,        0x3 */
            uint32_t pa_half_on             : 1; /* [   15],        r/w,        0x0 */
            uint32_t pa_ib_fix              : 1; /* [   16],        r/w,        0x0 */
            uint32_t pa_lz_bias_en          : 1; /* [   17],        r/w,        0x1 */
            uint32_t pa_pwrmx_osdac         : 4; /* [21:18],        r/w,        0x4 */
            uint32_t pa_pwrmx_dac_pn_switch : 1; /* [   22],        r/w,        0x0 */
            uint32_t reserved_23            : 1; /* [   23],       rsvd,        0x0 */
            uint32_t pa_pwrmx_bm            : 3; /* [26:24],        r/w,        0x3 */
            uint32_t reserved_27            : 1; /* [   27],       rsvd,        0x0 */
            uint32_t pa_att_gc              : 4; /* [31:28],        r/w,        0x7 */
        } BF;
        uint32_t WORD;
    } pa1;

