bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x68 : RX normal bias mode registers */
    union {
        struct
        {
            uint32_t reserved_0_2   : 3;  /* [ 2: 0],       rsvd,        0x0 */
            uint32_t pa_etb_en_hw   : 1;  /* [    3],          r,        0x1 */
            uint32_t pa_iet_hw      : 4;  /* [ 7: 4],          r,        0x2 */
            uint32_t pa_vbcore_hw   : 4;  /* [11: 8],          r,        0xa */
            uint32_t pa_vbcas_hw    : 3;  /* [14:12],          r,        0x4 */
            uint32_t reserved_15    : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t pa_half_on_hw  : 1;  /* [   16],          r,        0x1 */
            uint32_t pa_ib_fix_hw   : 1;  /* [   17],          r,        0x1 */
            uint32_t reserved_18_31 : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pa2;

    /* 0x6C : tmx */
    union {
        struct
        {
            uint32_t tmx_cs          : 3;  /* [ 2: 0],        r/w,        0x3 */
            uint32_t reserved_3      : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t tmx_bm_sw       : 3;  /* [ 6: 4],        r/w,        0x4 */
            uint32_t reserved_7      : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t tmx_bm_cas      : 3;  /* [10: 8],        r/w,        0x6 */
            uint32_t reserved_11     : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t tmx_bm_cas_bulk : 3;  /* [14:12],        r/w,        0x0 */
            uint32_t reserved_15     : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t tx_tsense_en    : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31  : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tmx;

    /* 0x70 : tbb */
    union {
        struct
        {
            uint32_t tbb_bm_sf         : 2; /* [ 1: 0],        r/w,        0x2 */
            uint32_t reserved_2_3      : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t tbb_bm_cg         : 2; /* [ 5: 4],        r/w,        0x2 */
            uint32_t reserved_6_7      : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t tbb_vcm           : 2; /* [ 9: 8],        r/w,        0x2 */
            uint32_t reserved_10_11    : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t tbb_cflt          : 2; /* [13:12],        r/w,        0x1 */
            uint32_t tbb_iq_bias_short : 1; /* [   14],        r/w,        0x0 */
            uint32_t tbb_atest_out_en  : 1; /* [   15],        r/w,        0x0 */
            uint32_t tbb_tosdac_q      : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23    : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t tbb_tosdac_i      : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31    : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tbb;

    /* 0x74 : lna */
    union {
        struct
        {
            uint32_t lna_bm          : 4; /* [ 3: 0],        r/w,        0x6 */
            uint32_t lna_bm_hw       : 4; /* [ 7: 4],          r,        0x6 */
            uint32_t lna_load_csw    : 4; /* [11: 8],        r/w,        0x6 */
            uint32_t lna_load_csw_hw : 4; /* [15:12],          r,        0x6 */
            uint32_t lna_rfb_match   : 3; /* [18:16],        r/w,        0x4 */
            uint32_t reserved_19     : 1; /* [   19],       rsvd,        0x0 */
            uint32_t lna_cap_lg      : 2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23  : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t lna_lg_gsel     : 3; /* [26:24],        r/w,        0x1 */
            uint32_t reserved_27_31  : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lna;

    /* 0x78 : rmxgm */
    union {
        struct
        {
            uint32_t rmx_bm            : 3;  /* [ 2: 0],        r/w,        0x3 */
            uint32_t reserved_3        : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t rmxgm_bm          : 3;  /* [ 6: 4],        r/w,        0x3 */
            uint32_t reserved_7        : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t rmxgm_10m_mode_en : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_31     : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rmxgm;

    /* 0x7C : rbb1 */
    union {
        struct
        {
            uint32_t rosdac_q       : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rosdac_i       : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t rosdac_q_hw    : 6; /* [21:16],          r,       0x20 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rosdac_i_hw    : 6; /* [29:24],          r,       0x20 */
            uint32_t reserved_30    : 1; /* [   30],       rsvd,        0x0 */
            uint32_t rosdac_range   : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb1;

    /* 0x80 : rbb2 */
    union {
        struct
        {
            uint32_t rbb_cap2_fc_q  : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rbb_cap2_fc_i  : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_q  : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rbb_cap1_fc_i  : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb2;

    /* 0x84 : rbb3 */
    union {
        struct
        {
            uint32_t rbb_bt_mode_hw       : 1; /* [    0],          r,        0x0 */
            uint32_t reserved_1_3         : 3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t rbb_bt_mode          : 1; /* [    4],        r/w,        0x0 */
            uint32_t rbb_bt_fif_tune      : 2; /* [ 6: 5],        r/w,        0x1 */
            uint32_t reserved_7           : 1; /* [    7],       rsvd,        0x0 */
            uint32_t rbb_deq              : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_11       : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t rbb_bm_op            : 3; /* [14:12],        r/w,        0x4 */
            uint32_t reserved_15          : 1; /* [   15],       rsvd,        0x0 */
            uint32_t rbb_vcm              : 2; /* [17:16],        r/w,        0x2 */
            uint32_t reserved_18_19       : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t rbb_bq_iqbias_short  : 1; /* [   20],        r/w,        0x1 */
            uint32_t rbb_tia_iqbias_short : 1; /* [   21],        r/w,        0x1 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rbb_bw               : 2; /* [25:24],        r/w,        0x2 */
            uint32_t reserved_26_27       : 2; /* [27:26],       rsvd,        0x0 */
            uint32_t rxiqcal_en           : 1; /* [   28],        r/w,        0x0 */
            uint32_t reserved_29_30       : 2; /* [30:29],       rsvd,        0x0 */
            uint32_t pwr_det_en           : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb3;

