bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x88 : rbb4 */
    union {
        struct
        {
            uint32_t rbb_pkdet_vth         : 4; /* [ 3: 0],        r/w,        0x5 */
            uint32_t rbb_pkdet_out_rstn    : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7          : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t rbb_pkdet_en          : 1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11         : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t rbb_pkdet_out_rstn_hw : 1; /* [   12],          r,        0x0 */
            uint32_t reserved_13_15        : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t rbb_pkdet_en_hw       : 1; /* [   16],          r,        0x0 */
            uint32_t reserved_17_19        : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t pkdet_out_raw         : 1; /* [   20],          r,        0x0 */
            uint32_t reserved_21_23        : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t pkdet_out_latch       : 1; /* [   24],          r,        0x0 */
            uint32_t reserved_25_31        : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb4;

    /* 0x8C : adda1 */
    union {
        struct
        {
            uint32_t dac_dvdd_sel         : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3         : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t dac_bias_sel         : 2; /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7         : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t dac_clk_sel          : 2; /* [ 9: 8],        r/w,        0x2 */
            uint32_t reserved_10_11       : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t dac_rccalsel         : 1; /* [   12],        r/w,        0x0 */
            uint32_t dac_clk_sync_inv     : 1; /* [   13],        r/w,        0x1 */
            uint32_t reserved_14_15       : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t adda_ldo_byps        : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19       : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t adda_ldo_dvdd_sel    : 3; /* [22:20],        r/w,        0x2 */
            uint32_t reserved_23          : 1; /* [   23],       rsvd,        0x0 */
            uint32_t adda_ldo_dvdd_sel_hw : 3; /* [26:24],          r,        0x0 */
            uint32_t reserved_27_31       : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adda1;

    /* 0x90 : adda2 */
    union {
        struct
        {
            uint32_t adc_vref_sel     : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3     : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t adc_dly_ctl      : 2; /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7     : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t adc_dvdd_sel     : 2; /* [ 9: 8],        r/w,        0x1 */
            uint32_t reserved_10_11   : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t adc_sar_ascal_en : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15   : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t adc_gt_rm        : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19   : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t adc_clk_sync_inv : 1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_23   : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t adc_clk_inv      : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27   : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t adc_clk_div_sel  : 1; /* [   28],        r/w,        0x1 */
            uint32_t reserved_29_31   : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adda2;

    /* 0x94  reserved */
    uint8_t RESERVED0x94[12];

    /* 0xA0 : vco1 */
    union {
        struct
        {
            uint32_t lo_vco_freq_cw    : 8; /* [ 7: 0],        r/w,       0x80 */
            uint32_t lo_vco_freq_cw_hw : 8; /* [15: 8],          r,       0x80 */
            uint32_t lo_vco_idac_cw    : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23    : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_idac_cw_hw : 5; /* [28:24],          r,        0xf */
            uint32_t reserved_29_31    : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } vco1;

    /* 0xA4 : vco2 */
    union {
        struct
        {
            uint32_t lo_vco_vbias_cw           : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3              : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t lo_vco_idac_boot          : 1;  /* [    4],        r/w,        0x0 */
            uint32_t lo_vco_short_vbias_filter : 1;  /* [    5],        r/w,        0x0 */
            uint32_t lo_vco_short_idac_filter  : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7                : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t acal_vref_cw              : 3;  /* [10: 8],        r/w,        0x3 */
            uint32_t reserved_11               : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t acal_vco_ud               : 1;  /* [   12],          r,        0x0 */
            uint32_t reserved_13_15            : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t acal_inc_en_hw            : 1;  /* [   16],          r,        0x0 */
            uint32_t reserved_17_31            : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } vco2;

    /* 0xA8 : vco3 */
    union {
        struct
        {
            uint32_t fcal_div    : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t fcal_cnt_op : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } vco3;

    /* 0xAC : vco4 */
    union {
        struct
        {
            uint32_t reserved_0_3         : 4; /* [ 3: 0],       rsvd,        0x0 */
            uint32_t fcal_cnt_start       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7         : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t fcal_inc_en_hw       : 1; /* [    8],          r,        0x0 */
            uint32_t reserved_9_15        : 7; /* [15: 9],       rsvd,        0x0 */
            uint32_t fcal_inc_large_range : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19       : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t fcal_cnt_rdy         : 1; /* [   20],          r,        0x0 */
            uint32_t reserved_21_23       : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t fcal_inc_vctrl_ud    : 2; /* [25:24],          r,        0x0 */
            uint32_t reserved_26_31       : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } vco4;

    /* 0xB0 : pfdcp */
    union {
        struct
        {
            uint32_t lo_cp_sel         : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3      : 3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t lo_cp_sel_hw      : 1; /* [    4],          r,        0x1 */
            uint32_t reserved_5_7      : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_cp_startup_en  : 1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11     : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t lo_cp_ota_en      : 1; /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_15    : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t lo_cp_opamp_en    : 1; /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_19    : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t lo_cp_hiz         : 1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_23    : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_pfd_rvdd_boost : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27    : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t lo_pfd_rst_csd    : 1; /* [   28],        r/w,        0x0 */
            uint32_t lo_pfd_rst_csd_hw : 1; /* [   29],          r,        0x0 */
            uint32_t reserved_30_31    : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pfdcp;

    /* 0xB4 : lo */
    union {
        struct
        {
            uint32_t lo_lf_rz_hw    : 2; /* [ 1: 0],          r,        0x2 */
            uint32_t reserved_2_3   : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t lo_lf_r4_hw    : 2; /* [ 5: 4],          r,        0x2 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t lo_lf_cz_hw    : 2; /* [ 9: 8],          r,        0x2 */
            uint32_t reserved_10_11 : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t lo_lf_rz       : 2; /* [13:12],        r/w,        0x2 */
            uint32_t lo_lf_cz       : 2; /* [15:14],        r/w,        0x2 */
            uint32_t lo_lf_r4       : 2; /* [17:16],        r/w,        0x2 */
            uint32_t lo_lf_r4_short : 1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19    : 1; /* [   19],       rsvd,        0x0 */
            uint32_t lo_slipped_dn  : 1; /* [   20],          r,        0x0 */
            uint32_t reserved_21_23 : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_slipped_up  : 1; /* [   24],          r,        0x0 */
            uint32_t reserved_25_31 : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo;

    /* 0xB8 : fbdv */
    union {
        struct
        {
            uint32_t lo_fbdv_halfstep_en_hw : 1;  /* [    0],          r,        0x0 */
            uint32_t reserved_1_3           : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t lo_fbdv_halfstep_en    : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7           : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_fbdv_sel_sample_clk : 2;  /* [ 9: 8],        r/w,        0x1 */
            uint32_t reserved_10_11         : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t lo_fbdv_sel_fb_clk     : 2;  /* [13:12],        r/w,        0x1 */
            uint32_t reserved_14_15         : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t lo_fbdv_rst            : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19         : 3;  /* [19:17],       rsvd,        0x0 */
            uint32_t lo_fbdv_rst_hw         : 1;  /* [   20],          r,        0x0 */
            uint32_t reserved_21_31         : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } fbdv;

    /* 0xBC : lodist */
    union {
        struct
        {
            uint32_t lo_osmx_xgm_boost    : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3         : 3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t lo_osmx_en_xgm       : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7         : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_osmx_fix_cap      : 1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11        : 3; /* [11: 9],       rsvd,        0x0 */
            uint32_t lo_osmx_vbuf_stre    : 1; /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_15       : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t lo_osmx_capbank_bias : 2; /* [17:16],        r/w,        0x1 */
            uint32_t reserved_18_19       : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t lo_osmx_cap          : 4; /* [23:20],        r/w,        0x8 */
            uint32_t lo_lodist_txbuf_stre : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27       : 3; /* [27:25],       rsvd,        0x0 */
            uint32_t lo_lodist_rxbuf_stre : 1; /* [   28],        r/w,        0x1 */
            uint32_t reserved_29_31       : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lodist;

    /* 0xC0 : sdm1 */
    union {
        struct
        {
            uint32_t lo_sdm_dither_sel_hw : 2;  /* [ 1: 0],          r,        0x1 */
            uint32_t reserved_2_3         : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t lo_sdm_bypass_hw     : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_7         : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_sdm_dither_sel    : 2;  /* [ 9: 8],        r/w,        0x1 */
            uint32_t reserved_10_11       : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t lo_sdm_bypass        : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15       : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t lo_sdm_rstb          : 1;  /* [   16],        r/w,        0x1 */
            uint32_t lo_sdm_rstb_hw       : 1;  /* [   17],          r,        0x1 */
            uint32_t reserved_18_19       : 2;  /* [19:18],       rsvd,        0x0 */
            uint32_t lo_sdm_flag          : 1;  /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_31       : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sdm1;

    /* 0xC4 : sdm2 */
    union {
        struct
        {
            uint32_t lo_sdmin       : 30; /* [29: 0],        r/w, 0x1501c71c */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sdm2;

    /* 0xC8 : sdm3 */
    union {
        struct
        {
            uint32_t lo_sdmin_hw    : 30; /* [29: 0],          r,        0x1 */
            uint32_t reserved_30_31 : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sdm3;

