bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0xcc  reserved */
    uint8_t RESERVED0xcc[32];

    /* 0xEC : rf_resv_reg_0 */
    union {
        struct
        {
            uint32_t rf_reserved0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_resv_reg_0;

    /* 0xF0 : rf_resv_reg_1 */
    union {
        struct
        {
            uint32_t rf_reserved1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_resv_reg_1;

    /* 0xF4 : rf_resv_reg_2 */
    union {
        struct
        {
            uint32_t rf_reserved2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_resv_reg_2;

    /* 0xF8 : rrf_gain_index1 */
    union {
        struct
        {
            uint32_t gain_ctrl0_gc_rmxgm : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t gain_ctrl0_gc_lna   : 3; /* [ 4: 2],        r/w,        0x0 */
            uint32_t gain_ctrl1_gc_rmxgm : 2; /* [ 6: 5],        r/w,        0x1 */
            uint32_t gain_ctrl1_gc_lna   : 3; /* [ 9: 7],        r/w,        0x1 */
            uint32_t gain_ctrl2_gc_rmxgm : 2; /* [11:10],        r/w,        0x1 */
            uint32_t gain_ctrl2_gc_lna   : 3; /* [14:12],        r/w,        0x2 */
            uint32_t gain_ctrl3_gc_rmxgm : 2; /* [16:15],        r/w,        0x1 */
            uint32_t gain_ctrl3_gc_lna   : 3; /* [19:17],        r/w,        0x3 */
            uint32_t gain_ctrl4_gc_rmxgm : 2; /* [21:20],        r/w,        0x1 */
            uint32_t gain_ctrl4_gc_lna   : 3; /* [24:22],        r/w,        0x4 */
            uint32_t gain_ctrl5_gc_rmxgm : 2; /* [26:25],        r/w,        0x1 */
            uint32_t gain_ctrl5_gc_lna   : 3; /* [29:27],        r/w,        0x5 */
            uint32_t reserved_30_31      : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rrf_gain_index1;

    /* 0xFC : rrf_gain_index2 */
    union {
        struct
        {
            uint32_t gain_ctrl8_gc_rmxgm : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t gain_ctrl8_gc_lna   : 3;  /* [ 4: 2],        r/w,        0x7 */
            uint32_t gain_ctrl7_gc_rmxgm : 2;  /* [ 6: 5],        r/w,        0x1 */
            uint32_t gain_ctrl7_gc_lna   : 3;  /* [ 9: 7],        r/w,        0x7 */
            uint32_t gain_ctrl6_gc_rmxgm : 2;  /* [11:10],        r/w,        0x1 */
            uint32_t gain_ctrl6_gc_lna   : 3;  /* [14:12],        r/w,        0x6 */
            uint32_t reserved_15_31      : 17; /* [31:15],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rrf_gain_index2;

    /* 0x100 : lna_ctrl_hw_mux */
    union {
        struct
        {
            uint32_t lna_bm_hg       : 4;  /* [ 3: 0],        r/w,        0x6 */
            uint32_t lna_bm_lg       : 4;  /* [ 7: 4],        r/w,        0x6 */
            uint32_t lna_load_csw_hg : 4;  /* [11: 8],        r/w,        0x6 */
            uint32_t lna_load_csw_lg : 4;  /* [15:12],        r/w,        0x6 */
            uint32_t reserved_16_31  : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lna_ctrl_hw_mux;

    /* 0x104 : rbb_gain_index1 */
    union {
        struct
        {
            uint32_t gain_ctrl0_gc_rbb1 : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_3       : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t gain_ctrl0_gc_rbb2 : 3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7         : 1; /* [    7],       rsvd,        0x0 */
            uint32_t gain_ctrl1_gc_rbb1 : 2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_11     : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t gain_ctrl1_gc_rbb2 : 3; /* [14:12],        r/w,        0x1 */
            uint32_t reserved_15        : 1; /* [   15],       rsvd,        0x0 */
            uint32_t gain_ctrl2_gc_rbb1 : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_19     : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t gain_ctrl2_gc_rbb2 : 3; /* [22:20],        r/w,        0x2 */
            uint32_t reserved_23        : 1; /* [   23],       rsvd,        0x0 */
            uint32_t gain_ctrl3_gc_rbb1 : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_27     : 2; /* [27:26],       rsvd,        0x0 */
            uint32_t gain_ctrl3_gc_rbb2 : 3; /* [30:28],        r/w,        0x0 */
            uint32_t reserved_31        : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_index1;

    /* 0x108 : rbb_gain_index2 */
    union {
        struct
        {
            uint32_t gain_ctrl4_gc_rbb1 : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3       : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t gain_ctrl4_gc_rbb2 : 3; /* [ 6: 4],        r/w,        0x1 */
            uint32_t reserved_7         : 1; /* [    7],       rsvd,        0x0 */
            uint32_t gain_ctrl5_gc_rbb1 : 2; /* [ 9: 8],        r/w,        0x1 */
            uint32_t reserved_10_11     : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t gain_ctrl5_gc_rbb2 : 3; /* [14:12],        r/w,        0x2 */
            uint32_t reserved_15        : 1; /* [   15],       rsvd,        0x0 */
            uint32_t gain_ctrl6_gc_rbb1 : 2; /* [17:16],        r/w,        0x1 */
            uint32_t reserved_18_19     : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t gain_ctrl6_gc_rbb2 : 3; /* [22:20],        r/w,        0x3 */
            uint32_t reserved_23        : 1; /* [   23],       rsvd,        0x0 */
            uint32_t gain_ctrl7_gc_rbb1 : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_27     : 2; /* [27:26],       rsvd,        0x0 */
            uint32_t gain_ctrl7_gc_rbb2 : 3; /* [30:28],        r/w,        0x4 */
            uint32_t reserved_31        : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_index2;

