bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x10C : rbb_gain_index3 */
    union {
        struct
        {
            uint32_t gain_ctrl8_gc_rbb1  : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3        : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t gain_ctrl8_gc_rbb2  : 3; /* [ 6: 4],        r/w,        0x5 */
            uint32_t reserved_7          : 1; /* [    7],       rsvd,        0x0 */
            uint32_t gain_ctrl9_gc_rbb1  : 2; /* [ 9: 8],        r/w,        0x2 */
            uint32_t reserved_10_11      : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t gain_ctrl9_gc_rbb2  : 3; /* [14:12],        r/w,        0x3 */
            uint32_t reserved_15         : 1; /* [   15],       rsvd,        0x0 */
            uint32_t gain_ctrl10_gc_rbb1 : 2; /* [17:16],        r/w,        0x2 */
            uint32_t reserved_18_19      : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t gain_ctrl10_gc_rbb2 : 3; /* [22:20],        r/w,        0x4 */
            uint32_t reserved_23         : 1; /* [   23],       rsvd,        0x0 */
            uint32_t gain_ctrl11_gc_rbb1 : 2; /* [25:24],        r/w,        0x2 */
            uint32_t reserved_26_27      : 2; /* [27:26],       rsvd,        0x0 */
            uint32_t gain_ctrl11_gc_rbb2 : 3; /* [30:28],        r/w,        0x5 */
            uint32_t reserved_31         : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_index3;

    /* 0x110 : rbb_gain_index4 */
    union {
        struct
        {
            uint32_t gain_ctrl12_gc_rbb1 : 2; /* [ 1: 0],        r/w,        0x2 */
            uint32_t reserved_2_3        : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t gain_ctrl12_gc_rbb2 : 3; /* [ 6: 4],        r/w,        0x6 */
            uint32_t reserved_7          : 1; /* [    7],       rsvd,        0x0 */
            uint32_t gain_ctrl13_gc_rbb1 : 2; /* [ 9: 8],        r/w,        0x3 */
            uint32_t reserved_10_11      : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t gain_ctrl13_gc_rbb2 : 3; /* [14:12],        r/w,        0x4 */
            uint32_t reserved_15         : 1; /* [   15],       rsvd,        0x0 */
            uint32_t gain_ctrl14_gc_rbb1 : 2; /* [17:16],        r/w,        0x3 */
            uint32_t reserved_18_19      : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t gain_ctrl14_gc_rbb2 : 3; /* [22:20],        r/w,        0x5 */
            uint32_t reserved_23         : 1; /* [   23],       rsvd,        0x0 */
            uint32_t gain_ctrl15_gc_rbb1 : 2; /* [25:24],        r/w,        0x3 */
            uint32_t reserved_26_27      : 2; /* [27:26],       rsvd,        0x0 */
            uint32_t gain_ctrl15_gc_rbb2 : 3; /* [30:28],        r/w,        0x6 */
            uint32_t reserved_31         : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_index4;

    /* 0x114 : rbb_gain_index5 */
    union {
        struct
        {
            uint32_t gain_ctrl16_gc_rbb1 : 2;  /* [ 1: 0],        r/w,        0x3 */
            uint32_t reserved_2_3        : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t gain_ctrl16_gc_rbb2 : 3;  /* [ 6: 4],        r/w,        0x7 */
            uint32_t reserved_7_31       : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_gain_index5;

    /* 0x118 : tbb_gain_index1 */
    union {
        struct
        {
            uint32_t gain_ctrl0_gc_tbb       : 5; /* [ 4: 0],        r/w,        0x4 */
            uint32_t reserved_5_7            : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t gain_ctrl0_gc_tmx       : 3; /* [10: 8],        r/w,        0x7 */
            uint32_t reserved_11             : 1; /* [   11],       rsvd,        0x0 */
            uint32_t gain_ctrl0_dac_bias_sel : 2; /* [13:12],        r/w,        0x1 */
            uint32_t gain_ctrl0_gc_tbb_boost : 2; /* [15:14],        r/w,        0x0 */
            uint32_t gain_ctrl1_gc_tbb       : 5; /* [20:16],        r/w,        0x6 */
            uint32_t reserved_21_23          : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t gain_ctrl1_gc_tmx       : 3; /* [26:24],        r/w,        0x6 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl1_dac_bias_sel : 2; /* [29:28],        r/w,        0x1 */
            uint32_t gain_ctrl1_gc_tbb_boost : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tbb_gain_index1;

    /* 0x11C : tbb_gain_index2 */
    union {
        struct
        {
            uint32_t gain_ctrl2_gc_tbb       : 5; /* [ 4: 0],        r/w,        0x7 */
            uint32_t reserved_5_7            : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t gain_ctrl2_gc_tmx       : 3; /* [10: 8],        r/w,        0x7 */
            uint32_t reserved_11             : 1; /* [   11],       rsvd,        0x0 */
            uint32_t gain_ctrl2_dac_bias_sel : 2; /* [13:12],        r/w,        0x1 */
            uint32_t gain_ctrl2_gc_tbb_boost : 2; /* [15:14],        r/w,        0x0 */
            uint32_t gain_ctrl3_gc_tbb       : 5; /* [20:16],        r/w,        0x9 */
            uint32_t reserved_21_23          : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t gain_ctrl3_gc_tmx       : 3; /* [26:24],        r/w,        0x7 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl3_dac_bias_sel : 2; /* [29:28],        r/w,        0x1 */
            uint32_t gain_ctrl3_gc_tbb_boost : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tbb_gain_index2;

    /* 0x120 : tbb_gain_index3 */
    union {
        struct
        {
            uint32_t gain_ctrl4_gc_tbb       : 5; /* [ 4: 0],        r/w,        0xc */
            uint32_t reserved_5_7            : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t gain_ctrl4_gc_tmx       : 3; /* [10: 8],        r/w,        0x7 */
            uint32_t reserved_11             : 1; /* [   11],       rsvd,        0x0 */
            uint32_t gain_ctrl4_dac_bias_sel : 2; /* [13:12],        r/w,        0x1 */
            uint32_t gain_ctrl4_gc_tbb_boost : 2; /* [15:14],        r/w,        0x0 */
            uint32_t gain_ctrl5_gc_tbb       : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23          : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t gain_ctrl5_gc_tmx       : 3; /* [26:24],        r/w,        0x7 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl5_dac_bias_sel : 2; /* [29:28],        r/w,        0x1 */
            uint32_t gain_ctrl5_gc_tbb_boost : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tbb_gain_index3;

