bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x124 : tbb_gain_index4 */
    union {
        struct
        {
            uint32_t gain_ctrl6_gc_tbb       : 5; /* [ 4: 0],        r/w,       0x13 */
            uint32_t reserved_5_7            : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t gain_ctrl6_gc_tmx       : 3; /* [10: 8],        r/w,        0x7 */
            uint32_t reserved_11             : 1; /* [   11],       rsvd,        0x0 */
            uint32_t gain_ctrl6_dac_bias_sel : 2; /* [13:12],        r/w,        0x1 */
            uint32_t gain_ctrl6_gc_tbb_boost : 2; /* [15:14],        r/w,        0x0 */
            uint32_t gain_ctrl7_gc_tbb       : 5; /* [20:16],        r/w,       0x18 */
            uint32_t reserved_21_23          : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t gain_ctrl7_gc_tmx       : 3; /* [26:24],        r/w,        0x7 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t gain_ctrl7_dac_bias_sel : 2; /* [29:28],        r/w,        0x1 */
            uint32_t gain_ctrl7_gc_tbb_boost : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } tbb_gain_index4;

    /* 0x128 : pa_reg_ctrl_hw1 */
    union {
        struct
        {
            uint32_t reserved_0_11  : 12; /* [11: 0],       rsvd,        0x0 */
            uint32_t pa_iet_11n     : 4;  /* [15:12],        r/w,        0x2 */
            uint32_t pa_vbcore_11n  : 4;  /* [19:16],        r/w,        0xa */
            uint32_t pa_vbcas_11n   : 3;  /* [22:20],        r/w,        0x4 */
            uint32_t reserved_23_31 : 9;  /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pa_reg_ctrl_hw1;

    /* 0x12C : pa_reg_ctrl_hw2 */
    union {
        struct
        {
            uint32_t pa_iet_11g     : 4; /* [ 3: 0],        r/w,        0x2 */
            uint32_t pa_vbcore_11g  : 4; /* [ 7: 4],        r/w,        0xa */
            uint32_t pa_vbcas_11g   : 3; /* [10: 8],        r/w,        0x4 */
            uint32_t reserved_11    : 1; /* [   11],       rsvd,        0x0 */
            uint32_t pa_iet_11b     : 4; /* [15:12],        r/w,        0x4 */
            uint32_t pa_vbcore_11b  : 4; /* [19:16],        r/w,        0xd */
            uint32_t pa_vbcas_11b   : 3; /* [22:20],        r/w,        0x4 */
            uint32_t reserved_23_31 : 9; /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pa_reg_ctrl_hw2;

    /* 0x130 : pa_reg_wifi_ctrl_hw */
    union {
        struct
        {
            uint32_t pa_half_on_wifi : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_7    : 7;  /* [ 7: 1],       rsvd,        0x0 */
            uint32_t pa_etb_en_wifi  : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_15   : 7;  /* [15: 9],       rsvd,        0x0 */
            uint32_t pa_ib_fix_wifi  : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_31  : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pa_reg_wifi_ctrl_hw;

    /* 0x134 : adda_reg_ctrl_hw */
    union {
        struct
        {
            uint32_t adda_ldo_dvdd_sel_rx : 3;  /* [ 2: 0],        r/w,        0x2 */
            uint32_t reserved_3           : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t adda_ldo_dvdd_sel_tx : 3;  /* [ 6: 4],        r/w,        0x4 */
            uint32_t reserved_7_31        : 25; /* [31: 7],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } adda_reg_ctrl_hw;

    /* 0x138 : lo_reg_ctrl_hw1 */
    union {
        struct
        {
            uint32_t lo_fbdv_halfstep_en_rx : 1; /* [    0],        r/w,        0x0 */
            uint32_t lo_fbdv_halfstep_en_tx : 1; /* [    1],        r/w,        0x1 */
            uint32_t lo_cp_sel_rx           : 1; /* [    2],        r/w,        0x1 */
            uint32_t lo_cp_sel_tx           : 1; /* [    3],        r/w,        0x1 */
            uint32_t lo_lf_cz_rx            : 2; /* [ 5: 4],        r/w,        0x2 */
            uint32_t reserved_6_7           : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t lo_lf_cz_tx            : 2; /* [ 9: 8],        r/w,        0x2 */
            uint32_t reserved_10_11         : 2; /* [11:10],       rsvd,        0x0 */
            uint32_t lo_lf_rz_rx            : 2; /* [13:12],        r/w,        0x2 */
            uint32_t reserved_14_15         : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t lo_lf_rz_tx            : 2; /* [17:16],        r/w,        0x2 */
            uint32_t reserved_18_19         : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t lo_lf_r4_rx            : 2; /* [21:20],        r/w,        0x2 */
            uint32_t reserved_22_23         : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t lo_lf_r4_tx            : 2; /* [25:24],        r/w,        0x2 */
            uint32_t reserved_26_31         : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_reg_ctrl_hw1;

    /* 0x13C : lo_cal_ctrl_hw1 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2404 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2404 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2408 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2408 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw1;

    /* 0x140 : lo_cal_ctrl_hw2 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2412 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2412 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2416 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2416 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw2;

