bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x144 : lo_cal_ctrl_hw3 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2420 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2420 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2424 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2424 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw3;

    /* 0x148 : lo_cal_ctrl_hw4 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2428 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2428 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2432 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2432 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw4;

    /* 0x14C : lo_cal_ctrl_hw5 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2436 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2436 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2440 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2440 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw5;

    /* 0x150 : lo_cal_ctrl_hw6 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2444 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2444 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2448 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2448 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw6;

    /* 0x154 : lo_cal_ctrl_hw7 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2452 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2452 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2456 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2456 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw7;

    /* 0x158 : lo_cal_ctrl_hw8 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2460 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2460 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2464 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2464 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw8;

    /* 0x15C : lo_cal_ctrl_hw9 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2468 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2468 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2472 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2472 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw9;

    /* 0x160 : lo_cal_ctrl_hw10 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2476 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2476 : 8; /* [15: 8],        r/w,       0x80 */
            uint32_t lo_vco_idac_cw_2480 : 5; /* [20:16],        r/w,        0xf */
            uint32_t reserved_21_23      : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2480 : 8; /* [31:24],        r/w,       0x80 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw10;

    /* 0x164 : lo_cal_ctrl_hw11 */
    union {
        struct
        {
            uint32_t lo_vco_idac_cw_2484 : 5;  /* [ 4: 0],        r/w,        0xf */
            uint32_t reserved_5_7        : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t lo_vco_freq_cw_2484 : 8;  /* [15: 8],        r/w,       0x80 */
            uint32_t reserved_16_31      : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_cal_ctrl_hw11;

    /* 0x168 : rosdac_ctrl_hw1 */
    union {
        struct
        {
            uint32_t rosdac_i_gc0   : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rosdac_q_gc0   : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t rosdac_i_gc1   : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rosdac_q_gc1   : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rosdac_ctrl_hw1;

    /* 0x16C : rosdac_ctrl_hw2 */
    union {
        struct
        {
            uint32_t rosdac_i_gc2   : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7   : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t rosdac_q_gc2   : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15 : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t rosdac_i_gc3   : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23 : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t rosdac_q_gc3   : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31 : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rosdac_ctrl_hw2;

