bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x170 : rxiq_ctrl_hw1 */
    union {
        struct
        {
            uint32_t rx_iq_phase_comp_gc0 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t rx_iq_gain_comp_gc0  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rxiq_ctrl_hw1;

    /* 0x174 : rxiq_ctrl_hw2 */
    union {
        struct
        {
            uint32_t rx_iq_phase_comp_gc1 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t rx_iq_gain_comp_gc1  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rxiq_ctrl_hw2;

    /* 0x178 : rxiq_ctrl_hw3 */
    union {
        struct
        {
            uint32_t rx_iq_phase_comp_gc2 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t rx_iq_gain_comp_gc2  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rxiq_ctrl_hw3;

    /* 0x17C : rxiq_ctrl_hw4 */
    union {
        struct
        {
            uint32_t rx_iq_phase_comp_gc3 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t rx_iq_gain_comp_gc3  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rxiq_ctrl_hw4;

    /* 0x180 : tosdac_ctrl_hw1 */
    union {
        struct
        {
            uint32_t tbb_tosdac_i_gc0 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7     : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t tbb_tosdac_q_gc0 : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15   : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t tbb_tosdac_i_gc1 : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23   : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t tbb_tosdac_q_gc1 : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31   : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tosdac_ctrl_hw1;

    /* 0x184 : tosdac_ctrl_hw2 */
    union {
        struct
        {
            uint32_t tbb_tosdac_i_gc2 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7     : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t tbb_tosdac_q_gc2 : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15   : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t tbb_tosdac_i_gc3 : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23   : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t tbb_tosdac_q_gc3 : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31   : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tosdac_ctrl_hw2;

    /* 0x188 : tosdac_ctrl_hw3 */
    union {
        struct
        {
            uint32_t tbb_tosdac_i_gc4 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7     : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t tbb_tosdac_q_gc4 : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15   : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t tbb_tosdac_i_gc5 : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23   : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t tbb_tosdac_q_gc5 : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31   : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tosdac_ctrl_hw3;

    /* 0x18C : tosdac_ctrl_hw4 */
    union {
        struct
        {
            uint32_t tbb_tosdac_i_gc6 : 6; /* [ 5: 0],        r/w,       0x20 */
            uint32_t reserved_6_7     : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t tbb_tosdac_q_gc6 : 6; /* [13: 8],        r/w,       0x20 */
            uint32_t reserved_14_15   : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t tbb_tosdac_i_gc7 : 6; /* [21:16],        r/w,       0x20 */
            uint32_t reserved_22_23   : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t tbb_tosdac_q_gc7 : 6; /* [29:24],        r/w,       0x20 */
            uint32_t reserved_30_31   : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tosdac_ctrl_hw4;

    /* 0x190 : tx_iq_gain_hw0 */
    union {
        struct
        {
            uint32_t tx_iq_phase_comp_gc0 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tx_iq_gain_comp_gc0  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_iq_gain_hw0;

    /* 0x194 : tx_iq_gain_hw1 */
    union {
        struct
        {
            uint32_t tx_iq_phase_comp_gc1 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tx_iq_gain_comp_gc1  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_iq_gain_hw1;

