bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x198 : tx_iq_gain_hw2 */
    union {
        struct
        {
            uint32_t tx_iq_phase_comp_gc2 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tx_iq_gain_comp_gc2  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_iq_gain_hw2;

    /* 0x19C : tx_iq_gain_hw3 */
    union {
        struct
        {
            uint32_t tx_iq_phase_comp_gc3 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tx_iq_gain_comp_gc3  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_iq_gain_hw3;

    /* 0x1A0 : tx_iq_gain_hw4 */
    union {
        struct
        {
            uint32_t tx_iq_phase_comp_gc4 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tx_iq_gain_comp_gc4  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_iq_gain_hw4;

    /* 0x1A4 : tx_iq_gain_hw5 */
    union {
        struct
        {
            uint32_t tx_iq_phase_comp_gc5 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tx_iq_gain_comp_gc5  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_iq_gain_hw5;

    /* 0x1A8 : tx_iq_gain_hw6 */
    union {
        struct
        {
            uint32_t tx_iq_phase_comp_gc6 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tx_iq_gain_comp_gc6  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_iq_gain_hw6;

    /* 0x1AC : tx_iq_gain_hw7 */
    union {
        struct
        {
            uint32_t tx_iq_phase_comp_gc7 : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t tx_iq_gain_comp_gc7  : 11; /* [26:16],        r/w,      0x400 */
            uint32_t reserved_27_31       : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } tx_iq_gain_hw7;

    /* 0x1B0 : lo_sdm_ctrl_hw1 */
    union {
        struct
        {
            uint32_t lo_sdm_dither_sel_wlan_2412 : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2417 : 2; /* [ 3: 2],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2422 : 2; /* [ 5: 4],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2427 : 2; /* [ 7: 6],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2432 : 2; /* [ 9: 8],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2437 : 2; /* [11:10],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2442 : 2; /* [13:12],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2447 : 2; /* [15:14],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2452 : 2; /* [17:16],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2457 : 2; /* [19:18],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2462 : 2; /* [21:20],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2467 : 2; /* [23:22],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2472 : 2; /* [25:24],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_wlan_2484 : 2; /* [27:26],        r/w,        0x1 */
            uint32_t reserved_28_31              : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_sdm_ctrl_hw1;

    /* 0x1B4 : lo_sdm_ctrl_hw2 */
    union {
        struct
        {
            uint32_t lo_sdm_dither_sel_ble_2402 : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2404 : 2; /* [ 3: 2],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2406 : 2; /* [ 5: 4],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2408 : 2; /* [ 7: 6],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2410 : 2; /* [ 9: 8],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2412 : 2; /* [11:10],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2414 : 2; /* [13:12],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2416 : 2; /* [15:14],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2418 : 2; /* [17:16],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2420 : 2; /* [19:18],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2422 : 2; /* [21:20],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2424 : 2; /* [23:22],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2426 : 2; /* [25:24],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2428 : 2; /* [27:26],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2430 : 2; /* [29:28],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2432 : 2; /* [31:30],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } lo_sdm_ctrl_hw2;

    /* 0x1B8 : lo_sdm_ctrl_hw3 */
    union {
        struct
        {
            uint32_t lo_sdm_dither_sel_ble_2434 : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2436 : 2; /* [ 3: 2],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2438 : 2; /* [ 5: 4],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2440 : 2; /* [ 7: 6],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2442 : 2; /* [ 9: 8],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2444 : 2; /* [11:10],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2446 : 2; /* [13:12],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2448 : 2; /* [15:14],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2450 : 2; /* [17:16],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2452 : 2; /* [19:18],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2454 : 2; /* [21:20],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2456 : 2; /* [23:22],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2458 : 2; /* [25:24],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2460 : 2; /* [27:26],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2462 : 2; /* [29:28],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2464 : 2; /* [31:30],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } lo_sdm_ctrl_hw3;

    /* 0x1BC : lo_sdm_ctrl_hw4 */
    union {
        struct
        {
            uint32_t lo_sdm_dither_sel_ble_2466 : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2468 : 2;  /* [ 3: 2],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2470 : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2472 : 2;  /* [ 7: 6],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2474 : 2;  /* [ 9: 8],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2476 : 2;  /* [11:10],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2478 : 2;  /* [13:12],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_2480 : 2;  /* [15:14],        r/w,        0x1 */
            uint32_t lo_sdm_dither_sel_ble_tx   : 2;  /* [17:16],        r/w,        0x1 */
            uint32_t reserved_18_31             : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_sdm_ctrl_hw4;

    /* 0x1C0 : lo_sdm_ctrl_hw5 */
    union {
        struct
        {
            uint32_t lo_center_freq_mhz : 12; /* [11: 0],        r/w,      0x97e */
            uint32_t lo_sdm_bypass_mode : 6;  /* [17:12],        r/w,        0x0 */
            uint32_t reserved_18_31     : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_sdm_ctrl_hw5;

    /* 0x1C4 : lo_sdm_ctrl_hw6 */
    union {
        struct
        {
            uint32_t lo_sdmin_center : 29; /* [28: 0],        r/w, 0x14400000 */
            uint32_t reserved_29_31  : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_sdm_ctrl_hw6;

    /* 0x1C8 : lo_sdm_ctrl_hw7 */
    union {
        struct
        {
            uint32_t lo_sdmin_1m    : 20; /* [19: 0],        r/w,    0x22222 */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_sdm_ctrl_hw7;

    /* 0x1CC : lo_sdm_ctrl_hw8 */
    union {
        struct
        {
            uint32_t lo_sdmin_if    : 20; /* [19: 0],        r/w,    0x2aaab */
            uint32_t reserved_20_31 : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } lo_sdm_ctrl_hw8;

