bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x1D0 : rbb_bw_ctrl_hw */
    union {
        struct
        {
            uint32_t rbb_bt_mode_ble : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_31   : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rbb_bw_ctrl_hw;

    /* 0x1d4  reserved */
    uint8_t RESERVED0x1d4[56];

    /* 0x20C : singen_ctrl0 */
    union {
        struct
        {
            uint32_t singen_inc_step1 : 10; /* [ 9: 0],        r/w,        0x1 */
            uint32_t reserved_10_15   : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t singen_inc_step0 : 10; /* [25:16],        r/w,        0x1 */
            uint32_t reserved_26_27   : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t singen_unsign_en : 1;  /* [   28],        r/w,        0x0 */
            uint32_t singen_clkdiv_n  : 2;  /* [30:29],        r/w,        0x0 */
            uint32_t singen_en        : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } singen_ctrl0;

    /* 0x210 : singen_ctrl1 */
    union {
        struct
        {
            uint32_t singen_clkdiv_q : 10; /* [ 9: 0],        r/w,        0x1 */
            uint32_t reserved_10_11  : 2;  /* [11:10],       rsvd,        0x0 */
            uint32_t singen_mode_q   : 4;  /* [15:12],        r/w,        0x0 */
            uint32_t singen_clkdiv_i : 10; /* [25:16],        r/w,        0x1 */
            uint32_t reserved_26_27  : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t singen_mode_i   : 4;  /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } singen_ctrl1;

    /* 0x214 : singen_ctrl2 */
    union {
        struct
        {
            uint32_t singen_gain_i        : 11; /* [10: 0],        r/w,      0x3ff */
            uint32_t reserved_11          : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t singen_start_addr1_i : 10; /* [21:12],        r/w,        0x0 */
            uint32_t singen_start_addr0_i : 10; /* [31:22],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } singen_ctrl2;

    /* 0x218 : singen_ctrl3 */
    union {
        struct
        {
            uint32_t singen_gain_q        : 11; /* [10: 0],        r/w,      0x3ff */
            uint32_t reserved_11          : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t singen_start_addr1_q : 10; /* [21:12],        r/w,        0x0 */
            uint32_t singen_start_addr0_q : 10; /* [31:22],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } singen_ctrl3;

    /* 0x21C : singen_ctrl4 */
    union {
        struct
        {
            uint32_t singen_fix_q    : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t singen_fix_en_q : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15  : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t singen_fix_i    : 12; /* [27:16],        r/w,        0x0 */
            uint32_t singen_fix_en_i : 1;  /* [   28],        r/w,        0x0 */
            uint32_t reserved_29_31  : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } singen_ctrl4;

    /* 0x220 : rfif_dfe_ctrl0 */
    union {
        struct
        {
            uint32_t rfckg_rxclk_4s_on     : 1; /* [    0],        r/w,        0x0 */
            uint32_t rfckg_txclk_4s_on     : 1; /* [    1],        r/w,        0x0 */
            uint32_t rfckg_adc_afifo_inv   : 1; /* [    2],        r/w,        0x0 */
            uint32_t rfckg_adc_clkout_sel  : 1; /* [    3],        r/w,        0x0 */
            uint32_t rfckg_dac_afifo_inv   : 1; /* [    4],        r/w,        0x1 */
            uint32_t rx_dfe_en_4s          : 1; /* [    5],        r/w,        0x0 */
            uint32_t rx_dfe_en_4s_en       : 1; /* [    6],        r/w,        0x0 */
            uint32_t tx_dfe_en_4s          : 1; /* [    7],        r/w,        0x0 */
            uint32_t tx_dfe_en_4s_en       : 1; /* [    8],        r/w,        0x0 */
            uint32_t rx_test_sel           : 2; /* [10: 9],        r/w,        0x0 */
            uint32_t tx_test_sel           : 2; /* [12:11],        r/w,        0x0 */
            uint32_t pad_adc_clkout_inv_en : 1; /* [   13],        r/w,        0x1 */
            uint32_t pad_dac_clkout_inv_en : 1; /* [   14],        r/w,        0x0 */
            uint32_t rf_ch_ind_ble_4s      : 7; /* [21:15],        r/w,        0x0 */
            uint32_t rf_ch_ind_ble_4s_en   : 1; /* [   22],        r/w,        0x0 */
            uint32_t wifimode_4s           : 2; /* [24:23],        r/w,        0x0 */
            uint32_t wifimode_4s_en        : 1; /* [   25],        r/w,        0x0 */
            uint32_t bbmode_4s             : 1; /* [   26],        r/w,        0x0 */
            uint32_t bbmode_4s_en          : 1; /* [   27],        r/w,        0x0 */
            uint32_t test_sel              : 4; /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rfif_dfe_ctrl0;

    /* 0x224 : rfif_test_read */
    union {
        struct
        {
            uint32_t test_read : 32; /* [31: 0],          r,     0x1111 */
        } BF;
        uint32_t WORD;
    } rfif_test_read;

    /* 0x228 : rfif_dig_ctrl */
    union {
        struct
        {
            uint32_t test_from_pad_en          : 1;  /* [    0],        r/w,        0x0 */
            uint32_t test_gc_from_pad_en       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rfckg_rxclk_div2_mode     : 1;  /* [    2],        r/w,        0x0 */
            uint32_t rfif_int_lo_unlocked_mask : 1;  /* [    3],        r/w,        0x1 */
            uint32_t reserved_4_15             : 12; /* [15: 4],       rsvd,        0x0 */
            uint32_t rfif_ppud_cnt2            : 9;  /* [24:16],        r/w,       0x9a */
            uint32_t rfif_ppud_cnt1            : 5;  /* [29:25],        r/w,        0xf */
            uint32_t rfif_ppud_manaual_en      : 1;  /* [   30],        r/w,        0x0 */
            uint32_t reserved_31               : 1;  /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rfif_dig_ctrl;

