bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x22C : rf_data_temp_0 */
    union {
        struct
        {
            uint32_t rf_data_temp_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_data_temp_0;

    /* 0x230 : rf_data_temp_1 */
    union {
        struct
        {
            uint32_t rf_data_temp_1 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_data_temp_1;

    /* 0x234 : rf_data_temp_2 */
    union {
        struct
        {
            uint32_t rf_data_temp_2 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_data_temp_2;

    /* 0x238 : rf_data_temp_3 */
    union {
        struct
        {
            uint32_t rf_data_temp_3 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_data_temp_3;

    /* 0x23C : rf_sram_ctrl0 */
    union {
        struct
        {
            uint32_t rf_sram_link_dly  : 16; /* [15: 0],        r/w,       0x20 */
            uint32_t rf_sram_link_mode : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t rf_sram_swap      : 1;  /* [   18],        r/w,        0x0 */
            uint32_t rf_sram_ext_clr   : 1;  /* [   19],        r/w,        0x0 */
            uint32_t reserved_20_31    : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl0;

    /* 0x240 : rf_sram_ctrl1 */
    union {
        struct
        {
            uint32_t rf_sram_adc_done     : 1;  /* [    0],          r,        0x0 */
            uint32_t rf_sram_adc_en       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rf_sram_adc_loop_en  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t rf_sram_adc_sts_clr  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_15        : 12; /* [15: 4],       rsvd,        0x0 */
            uint32_t rf_sram_adc_done_cnt : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl1;

    /* 0x244 : rf_sram_ctrl2 */
    union {
        struct
        {
            uint32_t rf_sram_adc_addr_end   : 16; /* [15: 0],        r/w,      0xfff */
            uint32_t rf_sram_adc_addr_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl2;

    /* 0x248 : rf_sram_ctrl3 */
    union {
        struct
        {
            uint32_t rf_sram_adc_sts : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl3;

    /* 0x24C : rf_sram_ctrl4 */
    union {
        struct
        {
            uint32_t rf_sram_dac_done     : 1;  /* [    0],          r,        0x0 */
            uint32_t rf_sram_dac_en       : 1;  /* [    1],        r/w,        0x0 */
            uint32_t rf_sram_dac_loop_en  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t rf_sram_dac_sts_clr  : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_15        : 12; /* [15: 4],       rsvd,        0x0 */
            uint32_t rf_sram_dac_done_cnt : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl4;

    /* 0x250 : rf_sram_ctrl5 */
    union {
        struct
        {
            uint32_t rf_sram_dac_addr_end   : 16; /* [15: 0],        r/w,      0xfff */
            uint32_t rf_sram_dac_addr_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl5;

    /* 0x254 : rf_sram_ctrl6 */
    union {
        struct
        {
            uint32_t rf_sram_dac_sts : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_sram_ctrl6;

    /* 0x258 : rf_ical_ctrl0 */
    union {
        struct
        {
            uint32_t rf_ical_r_cnt_n     : 10; /* [ 9: 0],        r/w,       0x50 */
            uint32_t rf_ical_a_cnt_n     : 10; /* [19:10],        r/w,       0xa0 */
            uint32_t rf_ical_f_cnt_n     : 10; /* [29:20],        r/w,       0x50 */
            uint32_t rf_ical_a_ud_inv_en : 1;  /* [   30],        r/w,        0x0 */
            uint32_t rf_ical_f_ud_inv_en : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_ical_ctrl0;

    /* 0x25C : rf_ical_ctrl1 */
    union {
        struct
        {
            uint32_t rf_ical_r_avg_n : 5;  /* [ 4: 0],        r/w,       0x1f */
            uint32_t reserved_5_9    : 5;  /* [ 9: 5],       rsvd,        0x0 */
            uint32_t rf_ical_r_os_q  : 10; /* [19:10],          r,      0x200 */
            uint32_t rf_ical_r_os_i  : 10; /* [29:20],          r,      0x200 */
            uint32_t reserved_30_31  : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_ical_ctrl1;

    /* 0x260 : rf_ical_ctrl2 */
    union {
        struct
        {
            uint32_t rf_ical_period_n : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31   : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_ical_ctrl2;

    /* 0x264 : rf_fsm_ctrl0 */
    union {
        struct
        {
            uint32_t rf_ch_ind_wifi : 12; /* [11: 0],        r/w,      0x99c */
            uint32_t reserved_12_31 : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fsm_ctrl0;

    /* 0x268 : rf_fsm_ctrl1 */
    union {
        struct
        {
            uint32_t rf_fsm_lo_time      : 16; /* [15: 0],        r/w,      0xc80 */
            uint32_t rf_fsm_lo_rdy       : 1;  /* [   16],          r,        0x0 */
            uint32_t rf_fsm_lo_rdy_rst   : 1;  /* [   17],        r/w,        0x0 */
            uint32_t rf_fsm_lo_rdy_4s_1  : 1;  /* [   18],        r/w,        0x0 */
            uint32_t rf_fsm_lo_rdy_sbclr : 1;  /* [   19],        r/w,        0x0 */
            uint32_t rf_fsm_pu_pa_dly_n  : 10; /* [29:20],        r/w,       0x50 */
            uint32_t reserved_30_31      : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fsm_ctrl1;

    /* 0x26C : rf_fsm_ctrl2 */
    union {
        struct
        {
            uint32_t rf_fsm_st_dbg       : 3;  /* [ 2: 0],        r/w,        0x0 */
            uint32_t rf_fsm_st_dbg_en    : 1;  /* [    3],        r/w,        0x0 */
            uint32_t rf_trx_en_ble_4s    : 1;  /* [    4],        r/w,        0x0 */
            uint32_t rf_trx_sw_ble_4s    : 1;  /* [    5],        r/w,        0x0 */
            uint32_t rf_trx_ble_4s_en    : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_9        : 3;  /* [ 9: 7],       rsvd,        0x0 */
            uint32_t rf_fsm_dfe_tx_dly_n : 10; /* [19:10],        r/w,        0xa */
            uint32_t rf_fsm_dfe_rx_dly_n : 10; /* [29:20],        r/w,       0xa0 */
            uint32_t reserved_30_31      : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_fsm_ctrl2;

    /* 0x270 : rf_pkdet_ctrl0 */
    union {
        struct
        {
            uint32_t pkdet_out_cnt_sts : 4;  /* [ 3: 0],          r,        0x0 */
            uint32_t pkdet_out_cnt_en  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t pkdet_out_mode    : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31     : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_pkdet_ctrl0;

    /* 0x274  reserved */
    uint8_t RESERVED0x274[908];

