bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x600 : dfe_ctrl_0 */
    union {
        struct
        {
            uint32_t tx_iqc_phase         : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t tx_iqc_phase_en      : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11          : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t tx_iqc_gain          : 11; /* [22:12],        r/w,      0x400 */
            uint32_t tx_iqc_gain_en       : 1;  /* [   23],        r/w,        0x1 */
            uint32_t tx_dvga_gain_qdb     : 7;  /* [30:24],        r/w,        0x0 */
            uint32_t tx_dvga_gain_ctrl_hw : 1;  /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_0;

    /* 0x604 : dfe_ctrl_1 */
    union {
        struct
        {
            uint32_t tx_dac_os_i       : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15    : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t tx_dac_os_q       : 12; /* [27:16],        r/w,        0x0 */
            uint32_t reserved_28_29    : 2;  /* [29:28],       rsvd,        0x0 */
            uint32_t tx_dac_dat_format : 1;  /* [   30],        r/w,        0x0 */
            uint32_t tx_dac_iq_swap    : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_1;

    /* 0x608 : dfe_ctrl_2 */
    union {
        struct
        {
            uint32_t rx_adc_os_i       : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t reserved_10_15    : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t rx_adc_os_q       : 10; /* [25:16],        r/w,        0x0 */
            uint32_t reserved_26_27    : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t rx_adc_dce_flt_en : 1;  /* [   28],        r/w,        0x1 */
            uint32_t rx_adc_low_pow_en : 1;  /* [   29],        r/w,        0x0 */
            uint32_t rx_adc_dat_format : 1;  /* [   30],        r/w,        0x0 */
            uint32_t rx_adc_iq_swap    : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_2;

    /* 0x60C : dfe_ctrl_3 */
    union {
        struct
        {
            uint32_t rx_adc_4s_i_val : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t rx_adc_4s_i_en  : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_15  : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t rx_adc_4s_q_val : 10; /* [25:16],        r/w,        0x0 */
            uint32_t rx_adc_4s_q_en  : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31  : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_3;

    /* 0x610 : dfe_ctrl_4 */
    union {
        struct
        {
            uint32_t rx_pf_th2      : 10; /* [ 9: 0],        r/w,        0xf */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t rx_pf_th1      : 10; /* [25:16],        r/w,       0x7f */
            uint32_t reserved_26_29 : 4;  /* [29:26],       rsvd,        0x0 */
            uint32_t rx_pf_q_en     : 1;  /* [   30],        r/w,        0x0 */
            uint32_t rx_pf_i_en     : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_4;

    /* 0x614 : dfe_ctrl_5 */
    union {
        struct
        {
            uint32_t rx_iqc_phase    : 10; /* [ 9: 0],        r/w,        0x0 */
            uint32_t rx_iqc_phase_en : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11     : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t rx_iqc_gain     : 11; /* [22:12],        r/w,      0x400 */
            uint32_t rx_iqc_gain_en  : 1;  /* [   23],        r/w,        0x1 */
            uint32_t reserved_24_31  : 8;  /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_5;

    /* 0x618 : dfe_ctrl_6 */
    union {
        struct
        {
            uint32_t rx_pm_freqshift_cw : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t rx_pm_freqshift_en : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_27     : 7;  /* [27:21],       rsvd,        0x0 */
            uint32_t rx_pm_done         : 1;  /* [   28],          r,        0x0 */
            uint32_t rx_pm_en           : 1;  /* [   29],        r/w,        0x0 */
            uint32_t rx_pm_in_sel       : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_6;

    /* 0x61C : dfe_ctrl_7 */
    union {
        struct
        {
            uint32_t rx_pm_start_ofs : 16; /* [15: 0],        r/w,       0x50 */
            uint32_t rx_pm_acc_len   : 16; /* [31:16],        r/w,      0x400 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_7;

    /* 0x620 : dfe_ctrl_8 */
    union {
        struct
        {
            uint32_t rx_pm_iqacc_i  : 25; /* [24: 0],          r,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_8;

    /* 0x624 : dfe_ctrl_9 */
    union {
        struct
        {
            uint32_t rx_pm_iqacc_q  : 25; /* [24: 0],          r,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_9;

    /* 0x628 : dfe_ctrl_10 */
    union {
        struct
        {
            uint32_t dfe_dac_raw_i  : 11; /* [10: 0],          r,        0x0 */
            uint32_t reserved_11_15 : 5;  /* [15:11],       rsvd,        0x0 */
            uint32_t dfe_dac_raw_q  : 11; /* [26:16],          r,        0x0 */
            uint32_t reserved_27_31 : 5;  /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_10;

    /* 0x62C : dfe_ctrl_11 */
    union {
        struct
        {
            uint32_t dfe_adc_raw_i  : 10; /* [ 9: 0],          r,        0x0 */
            uint32_t reserved_10_15 : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t dfe_adc_raw_q  : 10; /* [25:16],          r,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_11;

    /* 0x630 : dfe_ctrl_12 */
    union {
        struct
        {
            uint32_t tx_dvga_gain_qdb_gc0 : 7; /* [ 6: 0],        r/w,        0x0 */
            uint32_t reserved_7           : 1; /* [    7],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc1 : 7; /* [14: 8],        r/w,        0x0 */
            uint32_t reserved_15          : 1; /* [   15],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc2 : 7; /* [22:16],        r/w,        0x0 */
            uint32_t reserved_23          : 1; /* [   23],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc3 : 7; /* [30:24],        r/w,        0x0 */
            uint32_t reserved_31          : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_12;

