bouffalolab/bouffalo_sdk/drivers/bl602_driver/regs/rf_reg.h
    /* 0x634 : dfe_ctrl_13 */
    union {
        struct
        {
            uint32_t tx_dvga_gain_qdb_gc4 : 7; /* [ 6: 0],        r/w,        0x0 */
            uint32_t reserved_7           : 1; /* [    7],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc5 : 7; /* [14: 8],        r/w,        0x0 */
            uint32_t reserved_15          : 1; /* [   15],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc6 : 7; /* [22:16],        r/w,        0x0 */
            uint32_t reserved_23          : 1; /* [   23],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc7 : 7; /* [30:24],        r/w,        0x0 */
            uint32_t reserved_31          : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_13;

    /* 0x638 : dfe_ctrl_14 */
    union {
        struct
        {
            uint32_t tx_dvga_gain_qdb_gc8  : 7; /* [ 6: 0],        r/w,        0x0 */
            uint32_t reserved_7            : 1; /* [    7],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc9  : 7; /* [14: 8],        r/w,        0x0 */
            uint32_t reserved_15           : 1; /* [   15],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc10 : 7; /* [22:16],        r/w,        0x0 */
            uint32_t reserved_23           : 1; /* [   23],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc11 : 7; /* [30:24],        r/w,        0x0 */
            uint32_t reserved_31           : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_14;

    /* 0x63C : dfe_ctrl_15 */
    union {
        struct
        {
            uint32_t tx_dvga_gain_qdb_gc12 : 7; /* [ 6: 0],        r/w,        0x0 */
            uint32_t reserved_7            : 1; /* [    7],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc13 : 7; /* [14: 8],        r/w,        0x0 */
            uint32_t reserved_15           : 1; /* [   15],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc14 : 7; /* [22:16],        r/w,        0x0 */
            uint32_t reserved_23           : 1; /* [   23],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_gc15 : 7; /* [30:24],        r/w,        0x0 */
            uint32_t reserved_31           : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_15;

    /* 0x640 : dfe_ctrl_16 */
    union {
        struct
        {
            uint32_t rf_tbb_ind_gc0 : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t reserved_3     : 1; /* [    3],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc1 : 3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7     : 1; /* [    7],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc2 : 3; /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11    : 1; /* [   11],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc3 : 3; /* [14:12],        r/w,        0x0 */
            uint32_t reserved_15    : 1; /* [   15],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc4 : 3; /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19    : 1; /* [   19],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc5 : 3; /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23    : 1; /* [   23],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc6 : 3; /* [26:24],        r/w,        0x0 */
            uint32_t reserved_27    : 1; /* [   27],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc7 : 3; /* [30:28],        r/w,        0x0 */
            uint32_t reserved_31    : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_16;

    /* 0x644 : dfe_ctrl_17 */
    union {
        struct
        {
            uint32_t rf_tbb_ind_gc8  : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t reserved_3      : 1; /* [    3],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc9  : 3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t reserved_7      : 1; /* [    7],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc10 : 3; /* [10: 8],        r/w,        0x0 */
            uint32_t reserved_11     : 1; /* [   11],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc11 : 3; /* [14:12],        r/w,        0x0 */
            uint32_t reserved_15     : 1; /* [   15],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc12 : 3; /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19     : 1; /* [   19],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc13 : 3; /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23     : 1; /* [   23],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc14 : 3; /* [26:24],        r/w,        0x0 */
            uint32_t reserved_27     : 1; /* [   27],       rsvd,        0x0 */
            uint32_t rf_tbb_ind_gc15 : 3; /* [30:28],        r/w,        0x0 */
            uint32_t reserved_31     : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_17;

    /* 0x648 : dfe_ctrl_18 */
    union {
        struct
        {
            uint32_t tx_dvga_gain_qdb_ble_gc0 : 7; /* [ 6: 0],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_ble_gc1 : 7; /* [14: 8],        r/w,        0x0 */
            uint32_t reserved_15              : 1; /* [   15],       rsvd,        0x0 */
            uint32_t tx_dvga_gain_qdb_ble_gc2 : 7; /* [22:16],        r/w,        0x0 */
            uint32_t reserved_23_31           : 9; /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dfe_ctrl_18;
};

typedef volatile struct rf_reg rf_reg_t;

#endif /* __RF_REG_H__ */
